esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AHB_DMA</name>
      <description>AHB_DMA Peripheral</description>
      <groupName>AHB_DMA</groupName>
      <baseAddress>0x20343000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x370</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AHB_PDMA_IN_CH0</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_IN_CH1</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_IN_CH2</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_IN_CH3</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_IN_CH4</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_OUT_CH0</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_OUT_CH1</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_OUT_CH2</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_OUT_CH3</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_OUT_CH4</name>
        <value>45</value>
      </interrupt>
      <registers>
        <register>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>IN_INT_RAW_CH%s</name>
          <description>Raw interrupt status of RX channel %s</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_RESP_ERR_CH%s_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>IN_INT_ST_CH%s</name>
          <description>Masked interrupt status of RX channel %s</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_RESP_ERR_CH%s_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>IN_INT_ENA_CH%s</name>
          <description>Interrupt enable bits of RX channel %s</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_RESP_ERR_CH%s_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>IN_INT_CLR_CH%s</name>
          <description>Interrupt clear bits of RX channel %s</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_RESP_ERR_CH%s_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>OUT_INT_RAW_CH%s</name>
          <description>Raw interrupt status of TX channel %s</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_RESP_ERR_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>OUT_INT_ST_CH%s</name>
          <description>Masked interrupt status of TX channel %s</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_EOF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_RESP_ERR_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>OUT_INT_ENA_CH%s</name>
          <description>Interrupt enable bits of TX channel %s</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_RESP_ERR_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>OUT_INT_CLR_CH%s</name>
          <description>Interrupt clear bits of TX channel %s</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_EOF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_RESP_ERR_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_TEST</name>
          <description>reserved</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_TESTMODE</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_TESTADDR</name>
              <description>reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
