esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>CHNL1_CFG5</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHNL1_IN_CNT_ENA</name>
              <description>Set this bit to enable in data byte counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_IN_CNT_CLR</name>
              <description>Set this bit to clear in data byte counter.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL1_IN_LEN</name>
              <description>Write the bits to specify the data byte numbers of data from the DMA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_CFG6</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHNL1_OUT_EOF_GEN_MODE</name>
              <description>Write the bits to specify the which eof will be written to DMA. 0:  counter eof, 1: DMA ineof, 2: both counter eof and DMA ineof, 3 none.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_OUT_CNT_ENA</name>
              <description>Set this bit to enable out data byte counter.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_OUT_CNT_CLR</name>
              <description>Set this bit to clear out data byte counter.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL1_OUT_SAMPLES_COMP</name>
              <description>Set this bit to enable out data byte counter compensation when using fractional re-sampler and decimation by factor of 2 which results in reg_chnl1_out_cnt &gt;= reg_chnl1_out_len</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_OUT_LEN</name>
              <description>Write the bits to specify the data byte number of data to the DMA, the counter eof will be set when the counter approaches.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_FIFO_CTRL</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHNL1_INFIFO_RESET</name>
              <description>Set this bit to reset outfifo.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL1_OUTFIFO_RESET</name>
              <description>Set this bit to reset infifo.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_INT_RAW</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHNL1_OUTCNT_EOF_INT_RAW</name>
              <description>This interrupt raw bit turns to high level when the counter approach to reg_out_len.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_OUTFIFO_EOF_INT_RAW</name>
              <description>This interrupt raw bit turns to high level when getting the eof from DMA and write the several data to DMA.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_INT_ST</name>
          <description>Masked interrupt status</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHNL1_OUTCNT_EOF_INT_ST</name>
              <description>This is the status bit for reg_out_cnt_eof_int_raw when reg_out_cnt_eof_int_ena is set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHNL1_OUTFIFO_EOF_INT_ST</name>
              <description>This is the status bit for reg_outfifo_eof_int_raw when reg_outfifo_eof_int_ena is set to 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_INT_ENA</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHNL1_OUTCNT_EOF_INT_ENA</name>
              <description>This is the enable bit for reg_out_cnt_eof_int_st register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_OUTFIFO_EOF_INT_ENA</name>
              <description>This is the enable bit for reg_outfifo_eof_int_st register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_INT_CLR</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHNL1_OUTCNT_EOF_INT_CLR</name>
              <description>Set this bit to clear the reg_out_cnt_eof_int_raw interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL1_OUTFIFO_EOF_INT_CLR</name>
              <description>Set this bit to clear the reg_outfifo_eof_int_raw interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_OUT_CNT</name>
          <description>Status Registers</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHNL1_OUT_CNT</name>
              <description>Represents the data byte numbers send to the DMA when EOF occurs.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_TRACE0</name>
          <description>Status Registers</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHNL1_FRAC_FSM_CS</name>
              <description>Represents fractional re-sampler status in channel1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHNL1_RS2_STG1_FSM_CS</name>
              <description>Represents re-sampler 2 stag1 status in channel1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHNL1_RS2_STG0_FSM_CS</name>
              <description>Represents re-sampler 2 stag0 status in channel1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_TRACE1</name>
          <description>Debug Register1</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHNL1_OUT_INC</name>
              <description>Represents the data byte numbers send to the DMA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS</name>
          <description>Control and configuration</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_CLK_FO</name>
              <description>Set this bit to make channel0 clock free run.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_CLK_FO</name>
              <description>Set this bit to make channel1 clock free run.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_OUTFIFO_CLK_FO</name>
              <description>Set this bit to make channel0 outfifo clock free run.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_INFIFO_CLK_FO</name>
              <description>Set this bit to make channel0 infifo clock free run.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_OUTFIFO_CLK_FO</name>
              <description>Set this bit to make channel1 outfifo clock free run.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_INFIFO_CLK_FO</name>
              <description>Set this bit to make channel1 infifo clock free run.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Control and configuration registers</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2407240</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
