esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUTFIFO_STATUS_CH%s</name>
          <description>Transmit FIFO status of Tx channel%s</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0x7f808802</resetValue>
          <fields>
            <field>
              <name>OUTFIFO_L3_FULL_CH</name>
              <description>L3 Tx FIFO full signal for Tx channel0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_L3_EMPTY_CH</name>
              <description>L3 Tx FIFO empty signal for Tx channel0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_L3_CNT_CH</name>
              <description>The register stores the byte number of the data in L3 Tx FIFO for Tx channel0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_L3_UDF_CH</name>
              <description>L3 Tx FIFO under flow signal for Tx channel0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_L3_OVF_CH</name>
              <description>L3 Tx FIFO over flow signal for Tx channel0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_L1_FULL_CH</name>
              <description>L1 Tx FIFO full signal for Tx channel0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_L1_EMPTY_CH</name>
              <description>L1 Tx FIFO empty signal for Tx channel0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_L1_UDF_CH</name>
              <description>L1 Tx FIFO under flow signal for Tx channel0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_L1_OVF_CH</name>
              <description>L1 Tx FIFO over flow signal for Tx channel0.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_L2_FULL_CH</name>
              <description>L2 Tx RAM full signal for Tx channel0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_L2_EMPTY_CH</name>
              <description>L2 Tx RAM empty signal for Tx channel0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_L2_UDF_CH</name>
              <description>L2 Tx FIFO under flow signal for Tx channel0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_L2_OVF_CH</name>
              <description>L2 Tx FIFO over flow signal for Tx channel0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_1B_CH</name>
              <description>reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_2B_CH</name>
              <description>reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_3B_CH</name>
              <description>reserved</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_4B_CH</name>
              <description>reserved</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_5B_CH</name>
              <description>reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_6B_CH</name>
              <description>reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_7B_CH</name>
              <description>reserved</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_8B_CH</name>
              <description>reserved</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_PUSH_CH%s</name>
          <description>Push control register of Tx channel%s</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTFIFO_WDATA_CH</name>
              <description>This register stores the data that need to be pushed into AXI_DMA FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_PUSH_CH</name>
              <description>Set this bit to push data into AXI_DMA FIFO.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_LINK1_CH%s</name>
          <description>Link descriptor configure and control register of Tx channel%s</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>OUTLINK_STOP_CH</name>
              <description>Set this bit to stop dealing with the outlink descriptors.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_START_CH</name>
              <description>Set this bit to start dealing with the outlink descriptors.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_RESTART_CH</name>
              <description>Set this bit to restart a new outlink from the last address.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_PARK_CH</name>
              <description>1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM is working.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_LINK2_CH%s</name>
          <description>Link descriptor configure and control register of Tx channel%s</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_ADDR_CH</name>
              <description>This register stores the 32 least significant bits of the first outlink descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_STATE_CH%s</name>
          <description>Transmit status of Tx channel%s</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_ADDR_CH</name>
              <description>This register stores the current outlink descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_STATE_CH</name>
              <description>reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_STATE_CH</name>
              <description>reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_EOF_DES_ADDR_CH%s</name>
          <description>Outlink descriptor address when EOF occurs of Tx channel%s</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_EOF_DES_ADDR_CH</name>
              <description>This register stores the address of the outlink descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_EOF_BFR_DES_ADDR_CH%s</name>
          <description>The last outlink descriptor address when EOF occurs of Tx channel%s</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_EOF_BFR_DES_ADDR_CH</name>
              <description>This register stores the address of the outlink descriptor before the last outlink descriptor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_DSCR_CH%s</name>
          <description>Current outlink descriptor address of Tx channel%s</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_CH</name>
              <description>The address of the current outlink descriptor y.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_DSCR_BF0_CH%s</name>
          <description>The last outlink descriptor address of Tx channel%s</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF0_CH</name>
              <description>The address of the last outlink descriptor y-1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_DSCR_BF1_CH%s</name>
          <description>The second-to-last outlink descriptor address of Tx channel%s</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF1_CH</name>
              <description>The address of the second-to-last outlink descriptor x-2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_PRI_CH%s</name>
          <description>Priority register of Tx channel%s.</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_PRI_CH</name>
              <description>The priority of Tx channel0. The larger of the value the higher of the priority.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CH_ARB_WEIGH_CH</name>
              <description>The weight of Tx channel0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ARB_WEIGH_OPT_DIR_CH</name>
              <description>0: mean not optimazation weight function ,1: mean optimazation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_PERI_SEL_CH%s</name>
          <description>Peripheral selection of Tx channel%s</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <resetValue>0x3f</resetValue>
          <fields>
            <field>
              <name>PERI_OUT_SEL_CH</name>
              <description>This register is used to select peripheral for Tx channel0. 0:lcdcam. 1: gpspi_2. 2: gpspi_3. 3: parl_io. 4: aes. 5: sha. 6~15: Dummy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_CRC_INIT_DATA_CH%s</name>
          <description>This register is used to config ch%s crc initial data(max 32 bit)</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>OUT_CRC_INIT_DATA_CH</name>
              <description>This register is used to config ch0 of tx crc initial value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>TX_CRC_WIDTH_CH%s</name>
          <description>This register is used to confiig tx ch%s crc result width,2'b00 mean crc_width &lt;=8bit,2'b01 8&lt;crc_width&lt;=16 ,2'b10 mean 16&lt;crc_width  &lt;=24,2'b11 mean 24&lt;crc_width&lt;=32</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CRC_WIDTH_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CRC_LAUTCH_FLGA_CH</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_CRC_CLEAR_CH%s</name>
          <description>This register is used to clear ch%s crc result</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_CRC_CLEAR_CH</name>
              <description>This register is used to clear ch0 of tx crc result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>OUT_CRC_FINAL_RESULT_CH%s</name>
          <description>This register is used to store ch%s crc result</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_CRC_FINAL_RESULT_CH</name>
              <description>This register is used to store result ch0 of tx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>TX_CRC_EN_WR_DATA_CH%s</name>
          <description>This resister is used to config ch%s crc en for every bit</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CRC_EN_WR_DATA_CH</name>
              <description>This register is used to enable tx ch0 crc 32bit on/off</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>TX_CRC_EN_ADDR_CH%s</name>
          <description>This register is used to config ch%s crc en addr</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CRC_EN_ADDR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>TX_CRC_DATA_EN_WR_DATA_CH%s</name>
          <description>This register is used to config crc data_8bit en</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CRC_DATA_EN_WR_DATA_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x68</dimIncrement>
          <name>TX_CRC_DATA_EN_ADDR_CH%s</name>
          <description>This register is used to config addr of crc data_8bit en</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CRC_DATA_EN_ADDR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
