esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>OUT_CONF0_CH1</name>
          <description>Configure 0 register of Tx channel1</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>OUT_RST_CH1</name>
              <description>This bit is used to reset AXI_DMA channel1 Tx FSM and Tx FIFO pointer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_LOOP_TEST_CH1</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AUTO_WRBACK_CH1</name>
              <description>Set this bit to enable automatic outlink-writeback when all the data in tx buffer has been transmitted.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_MODE_CH1</name>
              <description>EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel1 is generated when data need to transmit has been popped from FIFO in AXI_DMA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ETM_EN_CH1</name>
              <description>Set this bit to 1 to enable etm control mode, dma Tx channel1 is triggered by etm task.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_BURST_SIZE_SEL_CH1</name>
              <description>3'b000-3'b100:burst length 8byte~128byte</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CMD_DISABLE_CH1</name>
              <description>1:mean disable cmd of this ch1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ECC_AEC_EN_CH1</name>
              <description>1: mean access ecc or aes domain,0: mean not</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDSCR_BURST_EN_CH1</name>
              <description>Set this bit to 1 to enable INCR burst transfer for Tx channel1 reading link descriptor when accessing internal SRAM.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CONF0_CH2</name>
          <description>Configure 0 register of Tx channel2</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>OUT_RST_CH2</name>
              <description>This bit is used to reset AXI_DMA channel2 Tx FSM and Tx FIFO pointer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_LOOP_TEST_CH2</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AUTO_WRBACK_CH2</name>
              <description>Set this bit to enable automatic outlink-writeback when all the data in tx buffer has been transmitted.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_MODE_CH2</name>
              <description>EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel2 is generated when data need to transmit has been popped from FIFO in AXI_DMA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ETM_EN_CH2</name>
              <description>Set this bit to 1 to enable etm control mode, dma Tx channel2 is triggered by etm task.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_BURST_SIZE_SEL_CH2</name>
              <description>3'b000-3'b100:burst length 8byte~128byte</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CMD_DISABLE_CH2</name>
              <description>1:mean disable cmd of this ch2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ECC_AEC_EN_CH2</name>
              <description>1: mean access ecc or aes domain,0: mean not</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDSCR_BURST_EN_CH2</name>
              <description>Set this bit to 1 to enable INCR burst transfer for Tx channel2 reading link descriptor when accessing internal SRAM.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_TIMEOUT</name>
          <description>This retister is used to config arbiter time slice</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX</name>
              <description>This register is used to config tx arbiter time out value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX</name>
              <description>This register is used to config rx arbiter time out value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WEIGHT_EN</name>
          <description>This register is used to config arbiter weight function to on or off</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX</name>
              <description>This register is used to config tx arbiter weight function  off/on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX</name>
              <description>This register is used to config rx arbiter weight function  off/on</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_MEM_CONF</name>
          <description>Mem power configure register of Rx channel</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_MEM_CLK_FORCE_EN</name>
              <description>1: Force to open the clock and bypass the gate-clock when accessing the RAM in AXI_DMA. 0: A gate-clock will be used when accessing the RAM in AXI_DMA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_MEM_FORCE_PU</name>
              <description>Force power up ram</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_MEM_FORCE_PD</name>
              <description>Force power down ram</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_MEM_CLK_FORCE_EN</name>
              <description>1: Force to open the clock and bypass the gate-clock when accessing the RAM in AXI_DMA. 0: A gate-clock will be used when accessing the RAM in AXI_DMA.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_MEM_FORCE_PU</name>
              <description>Force power up ram</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_MEM_FORCE_PD</name>
              <description>Force power down ram</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_START_ADDR</name>
          <description>The start address of accessible address space.</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <resetValue>0x30100000</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_START_ADDR</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_END_ADDR</name>
          <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>0x8fffffff</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_END_ADDR</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTR_MEM_START_ADDR</name>
          <description>The start address of accessible address space.</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <resetValue>0x30100000</resetValue>
          <fields>
            <field>
              <name>ACCESS_EXTR_MEM_START_ADDR</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTR_MEM_END_ADDR</name>
          <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <resetValue>0x8fffffff</resetValue>
          <fields>
            <field>
              <name>ACCESS_EXTR_MEM_END_ADDR</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IN_RESET_AVAIL_CH%s</name>
          <description>The rx channel %s reset valid_flag register.</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>IN_RESET_AVAIL_CH</name>
              <description>rx chan0 reset valid reg.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>OUT_RESET_AVAIL_CH%s</name>
          <description>The tx channel %s reset valid_flag register.</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>OUT_RESET_AVAIL_CH</name>
              <description>tx chan0 reset valid reg.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CONF</name>
          <description>MISC register</description>
          <addressOffset>0x2a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AXIM_RST_WR_INTER</name>
              <description>Set this bit then clear this bit to reset the internal axi_wr FSM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIM_RST_RD_INTER</name>
              <description>Set this bit then clear this bit to reset the internal axi_rd FSM.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARB_PRI_DIS</name>
              <description>Set this bit to disable priority arbitration function.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>1'h1: Force clock on for register. 1'h0: Support clock only when application writes registers.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_RESULT</name>
          <description>reserved</description>
          <addressOffset>0x2ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_ENA</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDN_RESULT</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_HIGH</name>
          <description>reserved</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>RDN_ECO_HIGH</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_LOW</name>
          <description>reserved</description>
          <addressOffset>0x2b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_ECO_LOW</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRESP_CNT</name>
          <description>AXI wr responce cnt register.</description>
          <addressOffset>0x2b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WRESP_CNT</name>
              <description>axi wr responce cnt reg.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RRESP_CNT</name>
          <description>AXI wr responce cnt register.</description>
          <addressOffset>0x2bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RRESP_CNT</name>
              <description>axi rd responce cnt reg.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>INFIFO_STATUS1_CH%s</name>
          <description>Receive FIFO status of Rx channel %s</description>
          <addressOffset>0x2c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1INFIFO_CNT_CH</name>
              <description>The register stores the byte number of the data in L1 Rx FIFO for Rx channel 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2INFIFO_CNT_CH</name>
              <description>The register stores the byte number of the data in L2 Rx FIFO for Rx channel 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>OUTFIFO_STATUS1_CH%s</name>
          <description>Receive FIFO status of Tx channel %s</description>
          <addressOffset>0x2cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1OUTFIFO_CNT_CH</name>
              <description>The register stores the byte number of the data in L1 Tx FIFO for Tx channel 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2OUTFIFO_CNT_CH</name>
              <description>The register stores the byte number of the data in L2 Tx FIFO for Tx channel 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x2d8</addressOffset>
          <size>32</size>
          <resetValue>0x2303140</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LINK_SWITCH_STATE</name>
          <description>Version control register</description>
          <addressOffset>0x2dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0</name>
              <description>The register that confirm ch dscr switch success</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>The register that confirm ch dscr switch success</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <description>The register that confirm ch dscr switch success</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
