esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AXI_PERF_MON</name>
      <description>AXI_PERF_MON Peripheral</description>
      <groupName>AXI_PERF_MON</groupName>
      <baseAddress>0x20511000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x678</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AXI_PERF_MON</name>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>CLK_EN</name>
          <description>reserved</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGENT_SELECT</name>
          <description>reserved</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AGENT_SELECT</name>
              <description>Select Agent in slot to be monitored, 4 bits means one agent number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_COUNTER0</name>
          <description>reserved</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_COUNTER0</name>
          <description>reserved</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_COUNTER0</name>
          <description>reserved</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_COUNTER0</name>
          <description>reserved</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_COUNTER0</name>
          <description>reserved</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_COUNTER0</name>
          <description>reserved</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_COUNTER0</name>
          <description>reserved</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_COUNTER1</name>
          <description>reserved</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_COUNTER1</name>
          <description>reserved</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_COUNTER1</name>
          <description>reserved</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_COUNTER1</name>
          <description>reserved</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_COUNTER1</name>
          <description>reserved</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_COUNTER1</name>
          <description>reserved</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_COUNTER1</name>
          <description>reserved</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_COUNTER2</name>
          <description>reserved</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_COUNTER2</name>
          <description>reserved</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_COUNTER2</name>
          <description>reserved</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_COUNTER2</name>
          <description>reserved</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_COUNTER2</name>
          <description>reserved</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_COUNTER2</name>
          <description>reserved</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_COUNTER2</name>
          <description>reserved</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_COUNTER3</name>
          <description>reserved</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_COUNTER3</name>
          <description>reserved</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_COUNTER3</name>
          <description>reserved</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_COUNTER3</name>
          <description>reserved</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_COUNTER3</name>
          <description>reserved</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_COUNTER3</name>
          <description>reserved</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_COUNTER3</name>
          <description>reserved</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_COUNTER4</name>
          <description>reserved</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_COUNTER4</name>
          <description>reserved</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_COUNTER4</name>
          <description>reserved</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_COUNTER4</name>
          <description>reserved</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_COUNTER4</name>
          <description>reserved</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_COUNTER4</name>
          <description>reserved</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_COUNTER4</name>
          <description>reserved</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_COUNTER5</name>
          <description>reserved</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_COUNTER5</name>
          <description>reserved</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_COUNTER5</name>
          <description>reserved</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_COUNTER5</name>
          <description>reserved</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
