esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG4_COUNTER5</name>
          <description>reserved</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_COUNTER5</name>
          <description>reserved</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_COUNTER5</name>
          <description>reserved</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_COUNTER6</name>
          <description>reserved</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_COUNTER6</name>
          <description>reserved</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_COUNTER6</name>
          <description>reserved</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_COUNTER6</name>
          <description>reserved</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_COUNTER6</name>
          <description>reserved</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_COUNTER6</name>
          <description>reserved</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_COUNTER6</name>
          <description>reserved</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_COUNTER7</name>
          <description>reserved</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_COUNTER7</name>
          <description>reserved</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_COUNTER7</name>
          <description>reserved</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_COUNTER7</name>
          <description>reserved</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_COUNTER7</name>
          <description>reserved</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_COUNTER7</name>
          <description>reserved</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_COUNTER7</name>
          <description>reserved</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The result for sel agent metric measured in this counter, [15:0] is min result, and [31:16] is max result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
