esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG5_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x1bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESULT</name>
              <description>The interval statistics results in this counter for sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RD_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RD_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RD_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RD_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RD_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RD_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RD_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RD_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RD_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RD_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RD_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RD_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RD_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
