esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG6_RD_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RD_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RD_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RD_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RD_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RD_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RD_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RD_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RD_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RD_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RD_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RD_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RD_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RD_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RD_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for ARLEN, [23:8] for ARID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_WR_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_WR_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_WR_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_WR_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_WR_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_WR_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_WR_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_WR_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_WR_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_WR_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_WR_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x24c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_WR_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_WR_AXI_INFO_RECORD0</name>
          <description>reserved</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_WR_AXI_INFO_RECORD0</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_WR_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_WR_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_WR_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_WR_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_WR_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_WR_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_WR_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_WR_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_WR_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_WR_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_WR_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_WR_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_WR_AXI_INFO_RECORD1</name>
          <description>reserved</description>
          <addressOffset>0x26c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_WR_AXI_INFO_RECORD1</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_WR_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_WR_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_WR_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_WR_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_WR_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_WR_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_WR_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_WR_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_WR_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_WR_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_WR_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_WR_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_WR_AXI_INFO_RECORD2</name>
          <description>reserved</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_WR_AXI_INFO_RECORD2</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_WR_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_WR_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_WR_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_WR_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_WR_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_WR_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_WR_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_WR_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
