esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG4_WR_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x29c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_WR_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_WR_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x2a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_WR_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_WR_AXI_INFO_RECORD3</name>
          <description>reserved</description>
          <addressOffset>0x2a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_WR_AXI_INFO_RECORD3</name>
              <description>The latest x axi transaction information record for sel agent, [7:0] for AWLEN, [23:8] for AWID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_INS_BANDW_DATA0</name>
          <description>reserved</description>
          <addressOffset>0x2a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_INS_BANDW_DATA0</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_INS_BANDW_DATA0</name>
          <description>reserved</description>
          <addressOffset>0x2ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_INS_BANDW_DATA0</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_INS_BANDW_DATA0</name>
          <description>reserved</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_INS_BANDW_DATA0</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_INS_BANDW_DATA0</name>
          <description>reserved</description>
          <addressOffset>0x2b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_INS_BANDW_DATA0</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_INS_BANDW_DATA0</name>
          <description>reserved</description>
          <addressOffset>0x2b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_INS_BANDW_DATA0</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_INS_BANDW_DATA0</name>
          <description>reserved</description>
          <addressOffset>0x2bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_INS_BANDW_DATA0</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_INS_BANDW_DATA0</name>
          <description>reserved</description>
          <addressOffset>0x2c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_INS_BANDW_DATA0</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_INS_BANDW_DATA1</name>
          <description>reserved</description>
          <addressOffset>0x2c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_INS_BANDW_DATA1</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_INS_BANDW_DATA1</name>
          <description>reserved</description>
          <addressOffset>0x2c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_INS_BANDW_DATA1</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_INS_BANDW_DATA1</name>
          <description>reserved</description>
          <addressOffset>0x2cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_INS_BANDW_DATA1</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_INS_BANDW_DATA1</name>
          <description>reserved</description>
          <addressOffset>0x2d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_INS_BANDW_DATA1</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_INS_BANDW_DATA1</name>
          <description>reserved</description>
          <addressOffset>0x2d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_INS_BANDW_DATA1</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_INS_BANDW_DATA1</name>
          <description>reserved</description>
          <addressOffset>0x2d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_INS_BANDW_DATA1</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_INS_BANDW_DATA1</name>
          <description>reserved</description>
          <addressOffset>0x2dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_INS_BANDW_DATA1</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_INS_BANDW_DATA2</name>
          <description>reserved</description>
          <addressOffset>0x2e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_INS_BANDW_DATA2</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_INS_BANDW_DATA2</name>
          <description>reserved</description>
          <addressOffset>0x2e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_INS_BANDW_DATA2</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_INS_BANDW_DATA2</name>
          <description>reserved</description>
          <addressOffset>0x2e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_INS_BANDW_DATA2</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_INS_BANDW_DATA2</name>
          <description>reserved</description>
          <addressOffset>0x2ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_INS_BANDW_DATA2</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_INS_BANDW_DATA2</name>
          <description>reserved</description>
          <addressOffset>0x2f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_INS_BANDW_DATA2</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_INS_BANDW_DATA2</name>
          <description>reserved</description>
          <addressOffset>0x2f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_INS_BANDW_DATA2</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_INS_BANDW_DATA2</name>
          <description>reserved</description>
          <addressOffset>0x2f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_INS_BANDW_DATA2</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_INS_BANDW_DATA3</name>
          <description>reserved</description>
          <addressOffset>0x2fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_INS_BANDW_DATA3</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_INS_BANDW_DATA3</name>
          <description>reserved</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_INS_BANDW_DATA3</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_INS_BANDW_DATA3</name>
          <description>reserved</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_INS_BANDW_DATA3</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_INS_BANDW_DATA3</name>
          <description>reserved</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_INS_BANDW_DATA3</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_INS_BANDW_DATA3</name>
          <description>reserved</description>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_INS_BANDW_DATA3</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_INS_BANDW_DATA3</name>
          <description>reserved</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_INS_BANDW_DATA3</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_INS_BANDW_DATA3</name>
          <description>reserved</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_INS_BANDW_DATA3</name>
              <description>The latest x bandwidth date num in config time record for sel agent, [15:0] for Read and [31:16] for write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_METRIC_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_METRIC_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_METRIC_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_METRIC_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_METRIC_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_METRIC_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0x32c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
