esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG6_METRIC_RANGE0</name>
          <description>reserved</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_METRIC_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_METRIC_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_METRIC_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x33c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_METRIC_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_METRIC_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_METRIC_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_METRIC_RANGE1</name>
          <description>reserved</description>
          <addressOffset>0x34c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_METRIC_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_METRIC_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_METRIC_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_METRIC_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x35c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_METRIC_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_METRIC_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_METRIC_RANGE2</name>
          <description>reserved</description>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_METRIC_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x36c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_METRIC_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_METRIC_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_METRIC_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x378</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_METRIC_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x37c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_METRIC_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_METRIC_RANGE3</name>
          <description>reserved</description>
          <addressOffset>0x384</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_METRIC_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_METRIC_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x38c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_METRIC_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x390</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_METRIC_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x394</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_METRIC_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x398</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_METRIC_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x39c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
