esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG6_METRIC_RANGE4</name>
          <description>reserved</description>
          <addressOffset>0x3a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_METRIC_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x3a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_METRIC_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x3a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_METRIC_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x3ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_METRIC_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x3b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_METRIC_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x3b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_METRIC_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x3b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_METRIC_RANGE5</name>
          <description>reserved</description>
          <addressOffset>0x3bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_METRIC_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x3c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_METRIC_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x3c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_METRIC_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x3c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_METRIC_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x3cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_METRIC_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x3d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_METRIC_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x3d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_METRIC_RANGE6</name>
          <description>reserved</description>
          <addressOffset>0x3d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_METRIC_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x3dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_METRIC_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x3e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_METRIC_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x3e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_METRIC_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x3e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_METRIC_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x3ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_METRIC_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x3f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_METRIC_RANGE7</name>
          <description>reserved</description>
          <addressOffset>0x3f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_HIGH</name>
              <description>The x Upper limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_LOW</name>
              <description>The x Lower limit of interval statistics for sel metric in sel agent</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RD_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x3f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_ADDR_MASK0</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RD_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_ADDR_MASK0</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RD_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_ADDR_MASK0</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RD_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_ADDR_MASK0</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RD_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_ADDR_MASK0</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RD_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x40c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_ADDR_MASK0</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RD_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_ADDR_MASK0</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RD_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_ADDR_MASK1</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
