esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG1_RD_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_ADDR_MASK1</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RD_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_ADDR_MASK1</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RD_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_ADDR_MASK1</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RD_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_ADDR_MASK1</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RD_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x428</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_ADDR_MASK1</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RD_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x42c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_ADDR_MASK1</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RD_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_ADDR_MASK2</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RD_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_ADDR_MASK2</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RD_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_ADDR_MASK2</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RD_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x43c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_ADDR_MASK2</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RD_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_ADDR_MASK2</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RD_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_ADDR_MASK2</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RD_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_ADDR_MASK2</name>
              <description>Read addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_WR_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x44c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_WR_ADDR_MASK0</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_WR_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x450</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_WR_ADDR_MASK0</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_WR_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x454</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_WR_ADDR_MASK0</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_WR_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x458</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_WR_ADDR_MASK0</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_WR_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x45c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_WR_ADDR_MASK0</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_WR_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x460</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_WR_ADDR_MASK0</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_WR_ADDR_MASK0</name>
          <description>reserved</description>
          <addressOffset>0x464</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_WR_ADDR_MASK0</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_WR_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x468</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_WR_ADDR_MASK1</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_WR_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x46c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_WR_ADDR_MASK1</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_WR_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x470</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_WR_ADDR_MASK1</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_WR_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x474</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_WR_ADDR_MASK1</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_WR_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x478</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_WR_ADDR_MASK1</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_WR_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x47c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_WR_ADDR_MASK1</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_WR_ADDR_MASK1</name>
          <description>reserved</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_WR_ADDR_MASK1</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_WR_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x484</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_WR_ADDR_MASK2</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_WR_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x488</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_WR_ADDR_MASK2</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_WR_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x48c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_WR_ADDR_MASK2</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_WR_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x490</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_WR_ADDR_MASK2</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_WR_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x494</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_WR_ADDR_MASK2</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_WR_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x498</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_WR_ADDR_MASK2</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_WR_ADDR_MASK2</name>
          <description>reserved</description>
          <addressOffset>0x49c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_WR_ADDR_MASK2</name>
              <description>Write addr mask of addr filter function for sel agent, mask bit will not compare with addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RD_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x4a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RD_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x4a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RD_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x4a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RD_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x4ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RD_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x4b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RD_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x4b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
