esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG6_RD_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x4b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RD_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x4bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RD_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x4c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RD_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x4c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RD_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x4c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RD_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x4cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RD_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x4d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RD_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x4d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RD_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x4d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RD_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x4dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RD_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x4e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RD_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x4e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RD_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x4e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RD_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x4ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RD_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x4f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_WR_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x4f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_WR_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_WR_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x4f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_WR_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_WR_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x4fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_WR_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_WR_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_WR_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_WR_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_WR_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_WR_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_WR_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_WR_ADDR_FILTER0</name>
          <description>reserved</description>
          <addressOffset>0x50c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_WR_ADDR_FILTER0</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_WR_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_WR_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_WR_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_WR_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_WR_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_WR_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_WR_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x51c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_WR_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_WR_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_WR_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_WR_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_WR_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_WR_ADDR_FILTER1</name>
          <description>reserved</description>
          <addressOffset>0x528</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_WR_ADDR_FILTER1</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_WR_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x52c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_WR_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_WR_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_WR_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_WR_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_WR_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_WR_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_WR_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_WR_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x53c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_WR_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_WR_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_WR_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_WR_ADDR_FILTER2</name>
          <description>reserved</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_WR_ADDR_FILTER2</name>
              <description>Read addr filter of addr filter function for sel agent, no mask bit in addr will compare with addr filter, if compare result same will pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_METRIC_SELECT1</name>
          <description>reserved</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_METRIC_SELECT1</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
