esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG1_METRIC_SELECT1</name>
          <description>reserved</description>
          <addressOffset>0x54c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_METRIC_SELECT1</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_METRIC_SELECT1</name>
          <description>reserved</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_METRIC_SELECT1</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_METRIC_SELECT1</name>
          <description>reserved</description>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_METRIC_SELECT1</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_METRIC_SELECT1</name>
          <description>reserved</description>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_METRIC_SELECT1</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_METRIC_SELECT1</name>
          <description>reserved</description>
          <addressOffset>0x55c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_METRIC_SELECT1</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_METRIC_SELECT1</name>
          <description>reserved</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_METRIC_SELECT1</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_METRIC_SELECT2</name>
          <description>reserved</description>
          <addressOffset>0x564</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_METRIC_SELECT2</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_METRIC_SELECT2</name>
          <description>reserved</description>
          <addressOffset>0x568</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_METRIC_SELECT2</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_METRIC_SELECT2</name>
          <description>reserved</description>
          <addressOffset>0x56c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_METRIC_SELECT2</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_METRIC_SELECT2</name>
          <description>reserved</description>
          <addressOffset>0x570</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_METRIC_SELECT2</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_METRIC_SELECT2</name>
          <description>reserved</description>
          <addressOffset>0x574</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_METRIC_SELECT2</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_METRIC_SELECT2</name>
          <description>reserved</description>
          <addressOffset>0x578</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_METRIC_SELECT2</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_METRIC_SELECT2</name>
          <description>reserved</description>
          <addressOffset>0x57c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_METRIC_SELECT2</name>
              <description>Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which metric is selected for current counter, high 3 bits means range metric this counter measured, a counter can use metric and range measure at the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG_RD_ADDR_REGION_SEL</name>
          <description>reserved</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_ADDR_REGION_SEL</name>
              <description>SW config Read region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_RD_ADDR_REGION_SEL</name>
              <description>SW config Read region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_RD_ADDR_REGION_SEL</name>
              <description>SW config Read region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_RD_ADDR_REGION_SEL</name>
              <description>SW config Read region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_RD_ADDR_REGION_SEL</name>
              <description>SW config Read region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_RD_ADDR_REGION_SEL</name>
              <description>SW config Read region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_RD_ADDR_REGION_SEL</name>
              <description>SW config Read region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG_WR_ADDR_REGION_SEL</name>
          <description>reserved</description>
          <addressOffset>0x584</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_WR_ADDR_REGION_SEL</name>
              <description>SW config Write region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_WR_ADDR_REGION_SEL</name>
              <description>SW config Write region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_WR_ADDR_REGION_SEL</name>
              <description>SW config Write region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_WR_ADDR_REGION_SEL</name>
              <description>SW config Write region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_WR_ADDR_REGION_SEL</name>
              <description>SW config Write region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_WR_ADDR_REGION_SEL</name>
              <description>SW config Write region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_WR_ADDR_REGION_SEL</name>
              <description>SW config Write region select, use with mask and filter, only when addr in one region and this region has been sel, will measure the transaction data num</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG_ADDR_FILTER_EN</name>
          <description>reserved</description>
          <addressOffset>0x588</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_ADDR_FILTER_EN</name>
              <description>Enable read addr filter function, if 0, all address access will be record</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_RD_ADDR_FILTER_EN</name>
              <description>Enable read addr filter function, if 0, all address access will be record</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_RD_ADDR_FILTER_EN</name>
              <description>Enable read addr filter function, if 0, all address access will be record</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_RD_ADDR_FILTER_EN</name>
              <description>Enable read addr filter function, if 0, all address access will be record</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_RD_ADDR_FILTER_EN</name>
              <description>Enable read addr filter function, if 0, all address access will be record</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_RD_ADDR_FILTER_EN</name>
              <description>Enable read addr filter function, if 0, all address access will be record</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_RD_ADDR_FILTER_EN</name>
              <description>Enable read addr filter function, if 0, all address access will be record</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_WR_ADDR_FILTER_EN</name>
              <description>Enable write addr filter function, if 0, all address access will be record</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_WR_ADDR_FILTER_EN</name>
              <description>Enable write addr filter function, if 0, all address access will be record</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_WR_ADDR_FILTER_EN</name>
              <description>Enable write addr filter function, if 0, all address access will be record</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_WR_ADDR_FILTER_EN</name>
              <description>Enable write addr filter function, if 0, all address access will be record</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_WR_ADDR_FILTER_EN</name>
              <description>Enable write addr filter function, if 0, all address access will be record</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_WR_ADDR_FILTER_EN</name>
              <description>Enable write addr filter function, if 0, all address access will be record</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_WR_ADDR_FILTER_EN</name>
              <description>Enable write addr filter function, if 0, all address access will be record</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG_SW_RECORD_STOP_EN</name>
          <description>reserved</description>
          <addressOffset>0x58c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_SW_RECORD_STOP_EN</name>
              <description>SW use to stop event log function, record information will keep</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG1_SW_RECORD_STOP_EN</name>
              <description>SW use to stop event log function, record information will keep</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG2_SW_RECORD_STOP_EN</name>
              <description>SW use to stop event log function, record information will keep</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG3_SW_RECORD_STOP_EN</name>
              <description>SW use to stop event log function, record information will keep</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG4_SW_RECORD_STOP_EN</name>
              <description>SW use to stop event log function, record information will keep</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG5_SW_RECORD_STOP_EN</name>
              <description>SW use to stop event log function, record information will keep</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG6_SW_RECORD_STOP_EN</name>
              <description>SW use to stop event log function, record information will keep</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
