esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG_SW_RECORD_STOP_CLR</name>
          <description>reserved</description>
          <addressOffset>0x590</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_SW_RECORD_STOP_CLR</name>
              <description>SW use to clear event log function stop, record new transaction from now</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG1_SW_RECORD_STOP_CLR</name>
              <description>SW use to clear event log function stop, record new transaction from now</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG2_SW_RECORD_STOP_CLR</name>
              <description>SW use to clear event log function stop, record new transaction from now</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG3_SW_RECORD_STOP_CLR</name>
              <description>SW use to clear event log function stop, record new transaction from now</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG4_SW_RECORD_STOP_CLR</name>
              <description>SW use to clear event log function stop, record new transaction from now</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG5_SW_RECORD_STOP_CLR</name>
              <description>SW use to clear event log function stop, record new transaction from now</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG6_SW_RECORD_STOP_CLR</name>
              <description>SW use to clear event log function stop, record new transaction from now</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG_INS_BANDW_TEST_EN</name>
          <description>reserved</description>
          <addressOffset>0x594</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_WR_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_RD_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_WR_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_RD_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_WR_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_RD_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_WR_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_RD_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_WR_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_RD_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_WR_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_RD_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_WR_INS_BANDW_TEST_EN</name>
              <description>Enable Read instantaneous bandwidth test for all select agent in the same time</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_SW_RECORD_STOP_DATA_LIMIT</name>
          <description>reserved</description>
          <addressOffset>0x598</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_SW_RECORD_STOP_RD_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_SW_RECORD_STOP_WR_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_SW_RECORD_STOP_DATA_LIMIT</name>
          <description>reserved</description>
          <addressOffset>0x59c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_SW_RECORD_STOP_RD_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_SW_RECORD_STOP_WR_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_SW_RECORD_STOP_DATA_LIMIT</name>
          <description>reserved</description>
          <addressOffset>0x5a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_SW_RECORD_STOP_RD_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_SW_RECORD_STOP_WR_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_SW_RECORD_STOP_DATA_LIMIT</name>
          <description>reserved</description>
          <addressOffset>0x5a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_SW_RECORD_STOP_RD_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_SW_RECORD_STOP_WR_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_SW_RECORD_STOP_DATA_LIMIT</name>
          <description>reserved</description>
          <addressOffset>0x5a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_SW_RECORD_STOP_RD_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_SW_RECORD_STOP_WR_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_SW_RECORD_STOP_DATA_LIMIT</name>
          <description>reserved</description>
          <addressOffset>0x5ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_SW_RECORD_STOP_RD_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_SW_RECORD_STOP_WR_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_SW_RECORD_STOP_DATA_LIMIT</name>
          <description>reserved</description>
          <addressOffset>0x5b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_SW_RECORD_STOP_RD_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_SW_RECORD_STOP_WR_DATA_LIMIT</name>
              <description>Read instantaneous bandwidth test data lower limit, when touch this limit, intr enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_ID_MASK</name>
          <description>reserved</description>
          <addressOffset>0x5b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_ID_MASK</name>
              <description>Read id mask, ignore mask id bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_WR_ID_MASK</name>
              <description>Write id mask, ignore mask id bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_ID_MASK</name>
          <description>reserved</description>
          <addressOffset>0x5b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_ID_MASK</name>
              <description>Read id mask, ignore mask id bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_WR_ID_MASK</name>
              <description>Write id mask, ignore mask id bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_ID_MASK</name>
          <description>reserved</description>
          <addressOffset>0x5bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_ID_MASK</name>
              <description>Read id mask, ignore mask id bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_WR_ID_MASK</name>
              <description>Write id mask, ignore mask id bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_ID_MASK</name>
          <description>reserved</description>
          <addressOffset>0x5c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_ID_MASK</name>
              <description>Read id mask, ignore mask id bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_WR_ID_MASK</name>
              <description>Write id mask, ignore mask id bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_ID_MASK</name>
          <description>reserved</description>
          <addressOffset>0x5c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_ID_MASK</name>
              <description>Read id mask, ignore mask id bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_WR_ID_MASK</name>
              <description>Write id mask, ignore mask id bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_ID_MASK</name>
          <description>reserved</description>
          <addressOffset>0x5c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_ID_MASK</name>
              <description>Read id mask, ignore mask id bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_WR_ID_MASK</name>
              <description>Write id mask, ignore mask id bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_ID_MASK</name>
          <description>reserved</description>
          <addressOffset>0x5cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_ID_MASK</name>
              <description>Read id mask, ignore mask id bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_WR_ID_MASK</name>
              <description>Write id mask, ignore mask id bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_ID_FILTER</name>
          <description>reserved</description>
          <addressOffset>0x5d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_WR_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_ID_FILTER</name>
          <description>reserved</description>
          <addressOffset>0x5d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_WR_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_ID_FILTER</name>
          <description>reserved</description>
          <addressOffset>0x5d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_WR_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_ID_FILTER</name>
          <description>reserved</description>
          <addressOffset>0x5dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_WR_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
