esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG4_ID_FILTER</name>
          <description>reserved</description>
          <addressOffset>0x5e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_WR_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_ID_FILTER</name>
          <description>reserved</description>
          <addressOffset>0x5e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_WR_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_ID_FILTER</name>
          <description>reserved</description>
          <addressOffset>0x5e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_WR_ID_FILTER</name>
              <description>Use with mask, no mask bits must same as filter bits, the pass filter</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG_BANDW_TEST_EN</name>
          <description>reserved</description>
          <addressOffset>0x5ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_BANDW_TEST_EN</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_WR_BANDW_TEST_EN</name>
              <description>Enable Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_RD_BANDW_TEST_EN</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_WR_BANDW_TEST_EN</name>
              <description>Enable Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_RD_BANDW_TEST_EN</name>
              <description>reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_WR_BANDW_TEST_EN</name>
              <description>Enable Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_RD_BANDW_TEST_EN</name>
              <description>reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_WR_BANDW_TEST_EN</name>
              <description>Enable Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_RD_BANDW_TEST_EN</name>
              <description>reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_WR_BANDW_TEST_EN</name>
              <description>Enable Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_RD_BANDW_TEST_EN</name>
              <description>reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_WR_BANDW_TEST_EN</name>
              <description>Enable Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_RD_BANDW_TEST_EN</name>
              <description>reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_WR_BANDW_TEST_EN</name>
              <description>Enable Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG_BANDW_TEST_STOP</name>
          <description>reserved</description>
          <addressOffset>0x5f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_BANDW_TEST_STOP</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_WR_BANDW_TEST_STOP</name>
              <description>Stop Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_RD_BANDW_TEST_STOP</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_WR_BANDW_TEST_STOP</name>
              <description>Stop Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_RD_BANDW_TEST_STOP</name>
              <description>reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_WR_BANDW_TEST_STOP</name>
              <description>Stop Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_RD_BANDW_TEST_STOP</name>
              <description>reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_WR_BANDW_TEST_STOP</name>
              <description>Stop Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_RD_BANDW_TEST_STOP</name>
              <description>reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_WR_BANDW_TEST_STOP</name>
              <description>Stop Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_RD_BANDW_TEST_STOP</name>
              <description>reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_WR_BANDW_TEST_STOP</name>
              <description>Stop Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_RD_BANDW_TEST_STOP</name>
              <description>reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_WR_BANDW_TEST_STOP</name>
              <description>Stop Read average bandwidth test for all select agent in the same time</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_BANDW_TRIGGER_IN_SEL</name>
          <description>reserved</description>
          <addressOffset>0x5f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_BANDW_TRIGGER_EN_SEL</name>
              <description>Read average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_RD_BANDW_TRIGGER_STOP_SEL</name>
              <description>Read average bandwidth test, trigger by soc, sel source, SW register config is one source</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_WR_BANDW_TRIGGER_EN_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_WR_BANDW_TRIGGER_STOP_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_BANDW_TRIGGER_IN_SEL</name>
          <description>reserved</description>
          <addressOffset>0x5f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_BANDW_TRIGGER_EN_SEL</name>
              <description>Read average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_RD_BANDW_TRIGGER_STOP_SEL</name>
              <description>Read average bandwidth test, trigger by soc, sel source, SW register config is one source</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_WR_BANDW_TRIGGER_EN_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_WR_BANDW_TRIGGER_STOP_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_BANDW_TRIGGER_IN_SEL</name>
          <description>reserved</description>
          <addressOffset>0x5fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_BANDW_TRIGGER_EN_SEL</name>
              <description>Read average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_RD_BANDW_TRIGGER_STOP_SEL</name>
              <description>Read average bandwidth test, trigger by soc, sel source, SW register config is one source</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_WR_BANDW_TRIGGER_EN_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_WR_BANDW_TRIGGER_STOP_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_BANDW_TRIGGER_IN_SEL</name>
          <description>reserved</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_BANDW_TRIGGER_EN_SEL</name>
              <description>Read average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_RD_BANDW_TRIGGER_STOP_SEL</name>
              <description>Read average bandwidth test, trigger by soc, sel source, SW register config is one source</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_WR_BANDW_TRIGGER_EN_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_WR_BANDW_TRIGGER_STOP_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_BANDW_TRIGGER_IN_SEL</name>
          <description>reserved</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_BANDW_TRIGGER_EN_SEL</name>
              <description>Read average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_RD_BANDW_TRIGGER_STOP_SEL</name>
              <description>Read average bandwidth test, trigger by soc, sel source, SW register config is one source</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_WR_BANDW_TRIGGER_EN_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_WR_BANDW_TRIGGER_STOP_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_BANDW_TRIGGER_IN_SEL</name>
          <description>reserved</description>
          <addressOffset>0x608</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_BANDW_TRIGGER_EN_SEL</name>
              <description>Read average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_RD_BANDW_TRIGGER_STOP_SEL</name>
              <description>Read average bandwidth test, trigger by soc, sel source, SW register config is one source</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_WR_BANDW_TRIGGER_EN_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_WR_BANDW_TRIGGER_STOP_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_BANDW_TRIGGER_IN_SEL</name>
          <description>reserved</description>
          <addressOffset>0x60c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_BANDW_TRIGGER_EN_SEL</name>
              <description>Read average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_RD_BANDW_TRIGGER_STOP_SEL</name>
              <description>Read average bandwidth test, trigger by soc, sel source, SW register config is one source</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_WR_BANDW_TRIGGER_EN_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_WR_BANDW_TRIGGER_STOP_SEL</name>
              <description>Write average bandwidth test, trigger enable by soc, sel source, SW register config is one source</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_WR_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_WR_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_WR_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
