esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG1_WR_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x614</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_WR_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_WR_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_WR_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x618</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_WR_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_WR_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_WR_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x61c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_WR_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_WR_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_WR_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_WR_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_WR_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_WR_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_WR_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_WR_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_WR_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x628</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_WR_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_WR_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_RD_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x62c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_RD_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_RD_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_RD_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_RD_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_RD_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_RD_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_RD_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_RD_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x63c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_RD_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_RD_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_RD_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_RD_BANDW_CNT_VALID_STROBE_NUM</name>
          <description>reserved</description>
          <addressOffset>0x644</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_BANDW_TIME_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the time valid scaling multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_RD_BANDW_DATA_CNT_VALID_STROBE_NUM</name>
              <description>Set this register to configure the data valid scaling multiplier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG0_INS_BANDW_TIME_THR</name>
          <description>reserved</description>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RD_INS_BANDW_TIME_THR</name>
              <description>Read instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG0_WR_INS_BANDW_TIME_THR</name>
              <description>Wirte instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG1_INS_BANDW_TIME_THR</name>
          <description>reserved</description>
          <addressOffset>0x64c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG1_RD_INS_BANDW_TIME_THR</name>
              <description>Read instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_WR_INS_BANDW_TIME_THR</name>
              <description>Wirte instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG2_INS_BANDW_TIME_THR</name>
          <description>reserved</description>
          <addressOffset>0x650</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG2_RD_INS_BANDW_TIME_THR</name>
              <description>Read instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_WR_INS_BANDW_TIME_THR</name>
              <description>Wirte instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG3_INS_BANDW_TIME_THR</name>
          <description>reserved</description>
          <addressOffset>0x654</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG3_RD_INS_BANDW_TIME_THR</name>
              <description>Read instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_WR_INS_BANDW_TIME_THR</name>
              <description>Wirte instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG4_INS_BANDW_TIME_THR</name>
          <description>reserved</description>
          <addressOffset>0x658</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG4_RD_INS_BANDW_TIME_THR</name>
              <description>Read instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_WR_INS_BANDW_TIME_THR</name>
              <description>Wirte instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG5_INS_BANDW_TIME_THR</name>
          <description>reserved</description>
          <addressOffset>0x65c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG5_RD_INS_BANDW_TIME_THR</name>
              <description>Read instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_WR_INS_BANDW_TIME_THR</name>
              <description>Wirte instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG6_INS_BANDW_TIME_THR</name>
          <description>reserved</description>
          <addressOffset>0x660</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG6_RD_INS_BANDW_TIME_THR</name>
              <description>Read instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_WR_INS_BANDW_TIME_THR</name>
              <description>Wirte instantaneous bandwidth test time limit, counter data num in this time unit, and will fresh counter to count again</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG_INT_RAW</name>
          <description>reserved</description>
          <addressOffset>0x664</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_RAW</name>
              <description>The raw interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_RAW</name>
              <description>The raw interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_RAW</name>
              <description>The raw interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_RAW</name>
              <description>The raw interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_RAW</name>
              <description>The raw interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_RAW</name>
              <description>The raw interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_RAW</name>
              <description>The raw interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
