esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SEL_AG_INT_ST</name>
          <description>reserved</description>
          <addressOffset>0x668</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ST</name>
              <description>The masked interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ST</name>
              <description>The masked interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ST</name>
              <description>The masked interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ST</name>
              <description>The masked interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ST</name>
              <description>The masked interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ST</name>
              <description>The masked interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ST</name>
              <description>The masked interrupt status of instantaneous bandwidth test data under limit int</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG_INT_ENA</name>
          <description>reserved</description>
          <addressOffset>0x66c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ENA</name>
              <description>Write 1 to enable instantaneous bandwidth test data under limit int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ENA</name>
              <description>Write 1 to enable instantaneous bandwidth test data under limit int</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ENA</name>
              <description>Write 1 to enable instantaneous bandwidth test data under limit int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ENA</name>
              <description>Write 1 to enable instantaneous bandwidth test data under limit int</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ENA</name>
              <description>Write 1 to enable instantaneous bandwidth test data under limit int</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ENA</name>
              <description>Write 1 to enable instantaneous bandwidth test data under limit int</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ENA</name>
              <description>Write 1 to enable instantaneous bandwidth test data under limit int</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL_AG_INT_CLR</name>
          <description>reserved</description>
          <addressOffset>0x670</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_CLR</name>
              <description>Write 1 to clear instantaneous bandwidth test data under limit int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_CLR</name>
              <description>Write 1 to clear instantaneous bandwidth test data under limit int</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_CLR</name>
              <description>Write 1 to clear instantaneous bandwidth test data under limit int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_CLR</name>
              <description>Write 1 to clear instantaneous bandwidth test data under limit int</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_CLR</name>
              <description>Write 1 to clear instantaneous bandwidth test data under limit int</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_CLR</name>
              <description>Write 1 to clear instantaneous bandwidth test data under limit int</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_CLR</name>
              <description>Write 1 to clear instantaneous bandwidth test data under limit int</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>reserved</description>
          <addressOffset>0x674</addressOffset>
          <size>32</size>
          <resetValue>0x263d2e</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
