esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>L1_ICACHE2_PRELOAD_CTRL</name>
          <description>L1 instruction Cache 2 preload-operation control register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE2_PRELOAD_ENA</name>
              <description>Configures preload operation on L1-ICache2. It will be cleared by hardware automatically after preload operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE2_PRELOAD_DONE</name>
              <description>The bit is used to indicate whether preload operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_PRELOAD_ORDER</name>
              <description>Configures the direction of preload operation. 0: ascending, 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_PRELOAD_RGID</name>
              <description>Configures the gid of l1 icache2 preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_PRELOAD_MODE</name>
              <description>Configures the mode of l1 icache2 preload, 0: load data from next level memory, 1: not load data from next level memory.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_PRELOAD_ADDR</name>
          <description>L1 instruction Cache 2 preload address configure register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE2_PRELOAD_ADDR</name>
              <description>Configures the start address of preload on L1-ICache2, which should be used together with L1_ICACHE2_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_PRELOAD_SIZE</name>
          <description>L1 instruction Cache 2 preload size configure register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE2_PRELOAD_SIZE</name>
              <description>Configures the size of the first section of prelock on L1-ICache2, which should be used together with L1_ICACHE2_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_PRELOAD_CTRL</name>
          <description>L1 instruction Cache 3 preload-operation control register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE3_PRELOAD_ENA</name>
              <description>Configures preload operation on L1-ICache3. It will be cleared by hardware automatically after preload operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE3_PRELOAD_DONE</name>
              <description>The bit is used to indicate whether preload operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PRELOAD_ORDER</name>
              <description>Configures the direction of preload operation. 0: ascending, 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PRELOAD_RGID</name>
              <description>Configures the gid of l1 icache3 preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PRELOAD_MODE</name>
              <description>Configures the mode of l1 icache3 preload, 0: load data from next level memory, 1: not load data from next level memory.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_PRELOAD_ADDR</name>
          <description>L1 instruction Cache 3 preload address configure register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_PRELOAD_ADDR</name>
              <description>Configures the start address of preload on L1-ICache3, which should be used together with L1_ICACHE3_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_PRELOAD_SIZE</name>
          <description>L1 instruction Cache 3 preload size configure register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_PRELOAD_SIZE</name>
              <description>Configures the size of the first section of prelock on L1-ICache3, which should be used together with L1_ICACHE3_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_PRELOAD_CTRL</name>
          <description>L1 data Cache  preload-operation control register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_DCACHE_PRELOAD_ENA</name>
              <description>Configures whether to enable the preloading operation in dcache. Hardware will clear it once the operation has finished.\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_PRELOAD_DONE</name>
              <description>Represents whether the preloading operation has finished.\\1: Finished\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_DCACHE_PRELOAD_ORDER</name>
              <description>Configures the direction of the preloading operation.\\1: Descending\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_PRELOAD_RGID</name>
              <description>Configures the gid of l1 dcache preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_PRELOAD_MODE</name>
              <description>Configures the mode of l1 dcache preload, 0: load data from next level memory, 1: not load data from next level memory.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_PRELOAD_ADDR</name>
          <description>dcache preload address configuration register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_PRELOAD_ADDR</name>
              <description>Configures the start address of preload on L1-DCache, which should be used together with L1_DCACHE_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_PRELOAD_SIZE</name>
          <description>L1 data Cache  preload size configure register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_PRELOAD_SIZE</name>
              <description>Configures the size of the first section of prelock on L1-DCache, which should be used together with L1_DCACHE_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_AUTOLOAD_CTRL</name>
          <description>L1 instruction Cache 0 autoload-operation control register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_ENA</name>
              <description>Configures whether to enable the autoloading operation in icache0.\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_DONE</name>
              <description>Indicates whether the autoloading operation in icache0 has finished.\\1: Finished\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_ORDER</name>
              <description>Configures the direction of the autoloading operation in icache0.\\1: Descending\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_TRIGGER_MODE</name>
              <description>Configures the trigger mode of the autoloading operation in icache0.\\2: Triggered by cache miss or hit\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_SCT0_ENA</name>
              <description>Configures whether to enable Section 0 for the autoloading operation in icache0.\\1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_SCT1_ENA</name>
              <description>Configures whether to enable Section 1 for the autoloading operation in icache0.\\1: Enable\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_RGID</name>
              <description>Configures the gid of l1 icache0 autoload.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_AUTOLOAD_SCT0_ADDR</name>
          <description>L1 instruction Cache 0 autoload section 0 address configure register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_SCT0_ADDR</name>
              <description>Configures the start address of the first section for autoload operation on L1-ICache0. Note that it should be used together with L1_ICACHE0_AUTOLOAD_SCT0_SIZE and L1_ICACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_AUTOLOAD_SCT0_SIZE</name>
          <description>L1 instruction Cache 0 autoload section 0 size configure register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_SCT0_SIZE</name>
              <description>Configures the size of the first section for autoload operation on L1-ICache0. Note that it should be used together with L1_ICACHE0_AUTOLOAD_SCT0_ADDR and L1_ICACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_AUTOLOAD_SCT1_ADDR</name>
          <description>L1 instruction Cache 0 autoload section 1 address configure register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_SCT1_ADDR</name>
              <description>Configures the start address of the second section for autoload operation on L1-ICache0. Note that it should be used together with L1_ICACHE0_AUTOLOAD_SCT1_SIZE and L1_ICACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_AUTOLOAD_SCT1_SIZE</name>
          <description>L1 instruction Cache 0 autoload section 1 size configure register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_SCT1_SIZE</name>
              <description>Configures the size of the second section for autoload operation on L1-ICache0. Note that it should be used together with L1_ICACHE0_AUTOLOAD_SCT1_ADDR and L1_ICACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_AUTOLOAD_CTRL</name>
          <description>L1 instruction Cache 1 autoload-operation control register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE1_AUTOLOAD_ENA</name>
              <description>Configures whether to enable the autoloading operation in icache1.\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_AUTOLOAD_DONE</name>
              <description>Indicates whether the autoloading operation in icache1 has finished.\\1: Finished\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_AUTOLOAD_ORDER</name>
              <description>Configures the direction of the autoloading operation in icache1.\\1: Descending\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_AUTOLOAD_TRIGGER_MODE</name>
              <description>Configures the trigger mode of the autoloading operation in icache1.\\2: Triggered by cache miss or hit\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_AUTOLOAD_SCT0_ENA</name>
              <description>Configures whether to enable Section 0 for the autoloading operation in icache1.\\1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_AUTOLOAD_SCT1_ENA</name>
              <description>Configures whether to enable Section 1 for the autoloading operation in icache1.\\1: Enable\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_AUTOLOAD_RGID</name>
              <description>Configures the gid of l1 icache1 autoload.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_AUTOLOAD_SCT0_ADDR</name>
          <description>L1 instruction Cache 1 autoload section 0 address configure register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE1_AUTOLOAD_SCT0_ADDR</name>
              <description>Configures the start address of the first section for autoload operation on L1-ICache1. Note that it should be used together with L1_ICACHE1_AUTOLOAD_SCT0_SIZE and L1_ICACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_AUTOLOAD_SCT0_SIZE</name>
          <description>L1 instruction Cache 1 autoload section 0 size configure register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE1_AUTOLOAD_SCT0_SIZE</name>
              <description>Configures the size of the first section for autoload operation on L1-ICache1. Note that it should be used together with L1_ICACHE1_AUTOLOAD_SCT0_ADDR and L1_ICACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_AUTOLOAD_SCT1_ADDR</name>
          <description>L1 instruction Cache 1 autoload section 1 address configure register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE1_AUTOLOAD_SCT1_ADDR</name>
              <description>Configures the start address of the second section for autoload operation on L1-ICache1. Note that it should be used together with L1_ICACHE1_AUTOLOAD_SCT1_SIZE and L1_ICACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_AUTOLOAD_SCT1_SIZE</name>
          <description>L1 instruction Cache 1 autoload section 1 size configure register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE1_AUTOLOAD_SCT1_SIZE</name>
              <description>Configures the size of the second section for autoload operation on L1-ICache1. Note that it should be used together with L1_ICACHE1_AUTOLOAD_SCT1_ADDR and L1_ICACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
