esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>L1_ICACHE2_AUTOLOAD_CTRL</name>
          <description>L1 instruction Cache 2 autoload-operation control register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE2_AUTOLOAD_ENA</name>
              <description>Configures and disable autoload operation on L1-ICache2.  1: enable, 0: disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_AUTOLOAD_DONE</name>
              <description>The bit is used to indicate whether autoload operation on L1-ICache2 is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_AUTOLOAD_ORDER</name>
              <description>Configures the direction of autoload operation on L1-ICache2. 0: ascending. 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_AUTOLOAD_TRIGGER_MODE</name>
              <description>The field is used to configure trigger mode of autoload operation on L1-ICache2. 0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_AUTOLOAD_SCT0_ENA</name>
              <description>Configures the first section for autoload operation on L1-ICache2.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_AUTOLOAD_SCT1_ENA</name>
              <description>Configures the second section for autoload operation on L1-ICache2.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_AUTOLOAD_RGID</name>
              <description>Configures the gid of l1 icache2 autoload.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_AUTOLOAD_SCT0_ADDR</name>
          <description>L1 instruction Cache 2 autoload section 0 address configure register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE2_AUTOLOAD_SCT0_ADDR</name>
              <description>Configures the start address of the first section for autoload operation on L1-ICache2. Note that it should be used together with L1_ICACHE2_AUTOLOAD_SCT0_SIZE and L1_ICACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_AUTOLOAD_SCT0_SIZE</name>
          <description>L1 instruction Cache 2 autoload section 0 size configure register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE2_AUTOLOAD_SCT0_SIZE</name>
              <description>Configures the size of the first section for autoload operation on L1-ICache2. Note that it should be used together with L1_ICACHE2_AUTOLOAD_SCT0_ADDR and L1_ICACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_AUTOLOAD_SCT1_ADDR</name>
          <description>L1 instruction Cache 2 autoload section 1 address configure register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE2_AUTOLOAD_SCT1_ADDR</name>
              <description>Configures the start address of the second section for autoload operation on L1-ICache2. Note that it should be used together with L1_ICACHE2_AUTOLOAD_SCT1_SIZE and L1_ICACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_AUTOLOAD_SCT1_SIZE</name>
          <description>L1 instruction Cache 2 autoload section 1 size configure register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE2_AUTOLOAD_SCT1_SIZE</name>
              <description>Configures the size of the second section for autoload operation on L1-ICache2. Note that it should be used together with L1_ICACHE2_AUTOLOAD_SCT1_ADDR and L1_ICACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_AUTOLOAD_CTRL</name>
          <description>L1 instruction Cache 3 autoload-operation control register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE3_AUTOLOAD_ENA</name>
              <description>Configures and disable autoload operation on L1-ICache3.  1: enable, 0: disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_AUTOLOAD_DONE</name>
              <description>The bit is used to indicate whether autoload operation on L1-ICache3 is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_AUTOLOAD_ORDER</name>
              <description>Configures the direction of autoload operation on L1-ICache3. 0: ascending. 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_AUTOLOAD_TRIGGER_MODE</name>
              <description>The field is used to configure trigger mode of autoload operation on L1-ICache3. 0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_AUTOLOAD_SCT0_ENA</name>
              <description>Configures the first section for autoload operation on L1-ICache3.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_AUTOLOAD_SCT1_ENA</name>
              <description>Configures the second section for autoload operation on L1-ICache3.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_AUTOLOAD_RGID</name>
              <description>Configures the gid of l1 icache3 autoload.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_AUTOLOAD_SCT0_ADDR</name>
          <description>L1 instruction Cache 3 autoload section 0 address configure register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_AUTOLOAD_SCT0_ADDR</name>
              <description>Configures the start address of the first section for autoload operation on L1-ICache3. Note that it should be used together with L1_ICACHE3_AUTOLOAD_SCT0_SIZE and L1_ICACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_AUTOLOAD_SCT0_SIZE</name>
          <description>L1 instruction Cache 3 autoload section 0 size configure register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_AUTOLOAD_SCT0_SIZE</name>
              <description>Configures the size of the first section for autoload operation on L1-ICache3. Note that it should be used together with L1_ICACHE3_AUTOLOAD_SCT0_ADDR and L1_ICACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_AUTOLOAD_SCT1_ADDR</name>
          <description>L1 instruction Cache 3 autoload section 1 address configure register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_AUTOLOAD_SCT1_ADDR</name>
              <description>Configures the start address of the second section for autoload operation on L1-ICache3. Note that it should be used together with L1_ICACHE3_AUTOLOAD_SCT1_SIZE and L1_ICACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_AUTOLOAD_SCT1_SIZE</name>
          <description>L1 instruction Cache 3 autoload section 1 size configure register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_AUTOLOAD_SCT1_SIZE</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_AUTOLOAD_CTRL</name>
          <description>L1 data Cache autoload-operation control register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_DCACHE_AUTOLOAD_ENA</name>
              <description>Configures whether to enable the autoloading operation in dcache.\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_AUTOLOAD_DONE</name>
              <description>Indicates whether the autoloading operation in dcache has finished.\\1: Finished\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_DCACHE_AUTOLOAD_ORDER</name>
              <description>Configures the direction of the autoloading operation in dcache.\\1: Descending\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_AUTOLOAD_TRIGGER_MODE</name>
              <description>Configures the trigger mode of the autoloading operation in dcache.\\2: Triggered by cache miss or hit\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_AUTOLOAD_SCT0_ENA</name>
              <description>Configures whether to enable Section 0 for the autoloading operation in dcache.\\1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_AUTOLOAD_SCT1_ENA</name>
              <description>Configures whether to enable Section 1 for the autoloading operation in dcache.\\1: Enable\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_AUTOLOAD_SCT2_ENA</name>
              <description>Configures whether to enable Section 2 for the autoloading operation in dcache.\\1: Enable\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_AUTOLOAD_SCT3_ENA</name>
              <description>Configures whether to enable Section 3 for the autoloading operation in dcache.\\1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_AUTOLOAD_RGID</name>
              <description>Configures the gid of l1 dcache autoload.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_AUTOLOAD_SCT0_ADDR</name>
          <description>L1 data Cache autoload section 0 address configure register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_AUTOLOAD_SCT0_ADDR</name>
              <description>Configures the start address of the first section for autoload operation on L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT0_SIZE and L1_DCACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_AUTOLOAD_SCT0_SIZE</name>
          <description>L1 data Cache autoload section 0 size configure register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_AUTOLOAD_SCT0_SIZE</name>
              <description>Configures the size of the first section for autoload operation on L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT0_ADDR and L1_DCACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_AUTOLOAD_SCT1_ADDR</name>
          <description>L1 data Cache autoload section 1 address configure register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_AUTOLOAD_SCT1_ADDR</name>
              <description>Configures the start address of the second section for autoload operation on L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT1_SIZE and L1_DCACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_AUTOLOAD_SCT1_SIZE</name>
          <description>L1 data Cache autoload section 1 size configure register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_AUTOLOAD_SCT1_SIZE</name>
              <description>Configures the size of the second section for autoload operation on L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT1_ADDR and L1_DCACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_AUTOLOAD_SCT2_ADDR</name>
          <description>L1 data Cache autoload section 2 address configure register</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_AUTOLOAD_SCT2_ADDR</name>
              <description>Configures the start address of the third section for autoload operation on L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT2_SIZE and L1_DCACHE_AUTOLOAD_SCT2_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_AUTOLOAD_SCT2_SIZE</name>
          <description>L1 data Cache autoload section 2 size configure register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_AUTOLOAD_SCT2_SIZE</name>
              <description>Configures the size of the third section for autoload operation on L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT2_ADDR and L1_DCACHE_AUTOLOAD_SCT2_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_AUTOLOAD_SCT3_ADDR</name>
          <description>L1 data Cache autoload section 1 address configure register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_AUTOLOAD_SCT3_ADDR</name>
              <description>Configures the start address of the fourth section for autoload operation on L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT3_SIZE and L1_DCACHE_AUTOLOAD_SCT3_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_AUTOLOAD_SCT3_SIZE</name>
          <description>L1 data Cache autoload section 1 size configure register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_AUTOLOAD_SCT3_SIZE</name>
              <description>Configures the size of the fourth section for autoload operation on L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT3_ADDR and L1_DCACHE_AUTOLOAD_SCT3_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_CNT_INT_ENA</name>
          <description>Cache Access Counter Interrupt enable register</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS0_OVF_INT_ENA</name>
              <description>Configures interrupt of one of counters overflow that occurs in L1-ICache0 due to bus0 accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS1_OVF_INT_ENA</name>
              <description>Configures interrupt of one of counters overflow that occurs in L1-ICache1 due to bus1 accesses L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS2_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS3_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS0_OVF_INT_ENA</name>
              <description>Configures interrupt of one of counters overflow that occurs in L1-DCache due to bus0 accesses L1-DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS1_OVF_INT_ENA</name>
              <description>Configures interrupt of one of counters overflow that occurs in L1-DCache due to bus1 accesses L1-DCache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS2_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS3_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
