esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>L1_CACHE_ACS_CNT_INT_CLR</name>
          <description>Cache Access Counter Interrupt clear register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS0_OVF_INT_CLR</name>
              <description>The bit is used to clear counters overflow interrupt and counters in L1-ICache0 due to bus0 accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_IBUS1_OVF_INT_CLR</name>
              <description>The bit is used to clear counters overflow interrupt and counters in L1-ICache1 due to bus1 accesses L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_IBUS2_OVF_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_IBUS3_OVF_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DBUS0_OVF_INT_CLR</name>
              <description>The bit is used to clear counters overflow interrupt and counters in L1-DCache due to bus0 accesses L1-DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DBUS1_OVF_INT_CLR</name>
              <description>The bit is used to clear counters overflow interrupt and counters in L1-DCache due to bus1 accesses L1-DCache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DBUS2_OVF_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DBUS3_OVF_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_CNT_INT_RAW</name>
          <description>Cache Access Counter Interrupt raw register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS0_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache0 due to bus0 accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS1_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache1 due to bus1 accesses L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS2_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache2 due to bus2 accesses L1-ICache2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS3_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache3 due to bus3 accesses L1-ICache3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS0_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache due to bus0 accesses L1-DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS1_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache due to bus1 accesses L1-DCache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS2_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache due to bus2 accesses L1-DCache.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS3_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache due to bus3 accesses L1-DCache.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_CNT_INT_ST</name>
          <description>Cache Access Counter Interrupt status register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS0_OVF_INT_ST</name>
              <description>The bit indicates the interrupt status of one of counters overflow that occurs in L1-ICache0 due to bus0 accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_IBUS1_OVF_INT_ST</name>
              <description>The bit indicates the interrupt status of one of counters overflow that occurs in L1-ICache1 due to bus1 accesses L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_IBUS2_OVF_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_IBUS3_OVF_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_DBUS0_OVF_INT_ST</name>
              <description>The bit indicates the interrupt status of one of counters overflow that occurs in L1-DCache due to bus0 accesses L1-DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_DBUS1_OVF_INT_ST</name>
              <description>The bit indicates the interrupt status of one of counters overflow that occurs in L1-DCache due to bus1 accesses L1-DCache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_DBUS2_OVF_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_DBUS3_OVF_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_FAIL_CTRL</name>
          <description>Cache Access Fail Configuration register</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_ACS_FAIL_CHECK_MODE</name>
              <description>Configures l1 icache0 access fail check mode. 0: the access fail is not propagated to the request, 1: the access fail is propagated to the request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_ACS_FAIL_CHECK_MODE</name>
              <description>Configures l1 icache1 access fail check mode. 0: the access fail is not propagated to the request, 1: the access fail is propagated to the request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE2_ACS_FAIL_CHECK_MODE</name>
              <description>Configures l1 icache2 access fail check mode. 0: the access fail is not propagated to the request, 1: the access fail is propagated to the request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE3_ACS_FAIL_CHECK_MODE</name>
              <description>Configures l1 icache3 access fail check mode. 0: the access fail is not propagated to the request, 1: the access fail is propagated to the request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_ACS_FAIL_CHECK_MODE</name>
              <description>Configures l1 dcache access fail check mode. 0: the access fail is not propagated to the request, 1: the access fail is propagated to the request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_FAIL_INT_ENA</name>
          <description>Cache Access Fail Interrupt enable register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_FAIL_INT_ENA</name>
              <description>Configures interrupt of access fail that occurs in L1-ICache0 due to cpu accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_FAIL_INT_ENA</name>
              <description>Configures interrupt of access fail that occurs in L1-ICache1 due to cpu accesses L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE2_FAIL_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE3_FAIL_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_FAIL_INT_ENA</name>
              <description>Configures interrupt of access fail that occurs in L1-DCache due to cpu accesses L1-DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_FAIL_INT_CLR</name>
          <description>L1-Cache Access Fail Interrupt clear register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_FAIL_INT_CLR</name>
              <description>The bit is used to clear interrupt of access fail that occurs in L1-ICache0 due to cpu accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_FAIL_INT_CLR</name>
              <description>The bit is used to clear interrupt of access fail that occurs in L1-ICache1 due to cpu accesses L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_FAIL_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_FAIL_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DCACHE_FAIL_INT_CLR</name>
              <description>The bit is used to clear interrupt of access fail that occurs in L1-DCache due to cpu accesses L1-DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_FAIL_INT_RAW</name>
          <description>Cache Access Fail Interrupt raw register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_FAIL_INT_RAW</name>
              <description>The raw bit of the interrupt of access fail that occurs in L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_FAIL_INT_RAW</name>
              <description>The raw bit of the interrupt of access fail that occurs in L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE2_FAIL_INT_RAW</name>
              <description>The raw bit of the interrupt of access fail that occurs in L1-ICache2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE3_FAIL_INT_RAW</name>
              <description>The raw bit of the interrupt of access fail that occurs in L1-ICache3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_FAIL_INT_RAW</name>
              <description>The raw bit of the interrupt of access fail that occurs in L1-DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_FAIL_INT_ST</name>
          <description>Cache Access Fail Interrupt status register</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_FAIL_INT_ST</name>
              <description>The bit indicates the interrupt status of access fail that occurs in L1-ICache0 due to cpu accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_FAIL_INT_ST</name>
              <description>The bit indicates the interrupt status of access fail that occurs in L1-ICache1 due to cpu accesses L1-ICache.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_FAIL_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_FAIL_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_DCACHE_FAIL_INT_ST</name>
              <description>The bit indicates the interrupt status of access fail that occurs in L1-DCache due to cpu accesses L1-DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_CNT_CTRL</name>
          <description>Cache Access Counter enable and clear register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS0_CNT_ENA</name>
              <description>Configures whether to enable IBUS0 counter.\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS1_CNT_ENA</name>
              <description>Configures whether to enable IBUS1 counter.\\1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS2_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS3_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS0_CNT_ENA</name>
              <description>Configures whether to enable DBUS0 counter.\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS1_CNT_ENA</name>
              <description>Configures whether to enable DBUS1 counter.\\1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS2_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS3_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS0_CNT_CLR</name>
              <description>Configures whether to clear IBUS0 counter.\\1: Clear\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_IBUS1_CNT_CLR</name>
              <description>Configures whether to clear IBUS1 counter.\\1: Clear\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_IBUS2_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_IBUS3_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DBUS0_CNT_CLR</name>
              <description>Configures whether to clear DBUS0 counter.\\1: Clear\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DBUS1_CNT_CLR</name>
              <description>Configures whether to clear DBUS1 counter.\\1: Clear\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DBUS2_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DBUS3_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS0_ACS_HIT_CNT</name>
          <description>L1-ICache bus0 Hit-Access Counter register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS0_HIT_CNT</name>
              <description>The register records the number of hits when bus0 accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
