esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>L2_CACHE_AUTOLOAD_BUF_CLR_CTRL</name>
          <description>Cache Autoload buffer clear control register</description>
          <addressOffset>0x3b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L2_CACHE_ALD_BUF_CLR</name>
              <description>Configures clear autoload-buffer inside L2-Cache. If this bit is active, autoload will not work in L2-Cache. This bit should not be active when autoload works in L2-Cache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_UNALLOCATE_BUFFER_CLEAR</name>
          <description>Unallocate request buffer clear registers</description>
          <addressOffset>0x3b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L2_CACHE_UNALLOC_CLR</name>
              <description>The bit is used to clear the unallocate request buffer of l2 icache where the unallocate request is responsed but not completed.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ACCESS_ATTR_CTRL</name>
          <description>L2 cache access attribute control register</description>
          <addressOffset>0x3bc</addressOffset>
          <size>32</size>
          <resetValue>0xf</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_ACCESS_FORCE_CC</name>
              <description>Configures force the request to l2 cache with cacheable attribute, otherwise, the attribute is propagated from L1 cache or CPU, it could be one of cacheable and non-cacheable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_ACCESS_FORCE_WB</name>
              <description>Configures force the request to l2 cache with write-back attribute, otherwise, the attribute is propagated from L1 cache or CPU, it could be one of write-back and write-through.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_ACCESS_FORCE_WMA</name>
              <description>Configures force the request to l2 cache with write-miss-allocate attribute, otherwise, the attribute is propagated from L1 cache or CPU, it could be one of write-miss-allocate and write-miss-no-allocate.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_ACCESS_FORCE_RMA</name>
              <description>Configures force the request to l2 cache with read-miss-allocate attribute, otherwise, the attribute is propagated from L1 cache or CPU, it could be one of read-miss-allocate and read-miss-no-allocate.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_OBJECT_CTRL</name>
          <description>Cache Tag and Data memory Object control register</description>
          <addressOffset>0x3c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L2_CACHE_TAG_OBJECT</name>
              <description>Configures set L2-Cache tag memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_MEM_OBJECT</name>
              <description>Configures set L2-Cache data memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_WAY_OBJECT</name>
          <description>Cache Tag and Data memory way register</description>
          <addressOffset>0x3c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L2_CACHE_WAY_OBJECT</name>
              <description>Configures way of the tag-object will be accessed. \\7: way7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ADDR</name>
          <description>Cache address register</description>
          <addressOffset>0x3c8</addressOffset>
          <size>32</size>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_ADDR</name>
              <description>Those bits stores the address which will decide where inside the specified tag memory object will be accessed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_DEBUG_BUS</name>
          <description>Cache Tag/data memory content register</description>
          <addressOffset>0x3cc</addressOffset>
          <size>32</size>
          <resetValue>0x3cc</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_DEBUG_BUS</name>
              <description>This is a constant place where we can write data to or read data from the tag/data memory on the specified cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEVEL_SPLIT1</name>
          <description>USED TO SPLIT L1 CACHE AND L2 CACHE</description>
          <addressOffset>0x3d0</addressOffset>
          <size>32</size>
          <resetValue>0x3d0</resetValue>
          <fields>
            <field>
              <name>LEVEL_SPLIT1</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gate control register</description>
          <addressOffset>0x3d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures clock gate when access all registers in this module.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRACE_ENA</name>
          <description>Clock gate control register</description>
          <addressOffset>0x3d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_CACHE_TRACE_ENA</name>
              <description>Configures L1-Cache trace for the performance counter and fail tracer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L2_CACHE_TRACE_ENA</name>
              <description>Configures L2-Cache trace for the performance counter and fail tracer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REDUNDANCY_SIG0</name>
          <description>Cache redundancy signal 0 register</description>
          <addressOffset>0x3dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REDCY_SIG0</name>
              <description>Those bits are prepared for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REDUNDANCY_SIG1</name>
          <description>Cache redundancy signal 1 register</description>
          <addressOffset>0x3e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REDCY_SIG1</name>
              <description>Those bits are prepared for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REDUNDANCY_SIG2</name>
          <description>Cache redundancy signal 2 register</description>
          <addressOffset>0x3e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REDCY_SIG2</name>
              <description>Those bits are prepared for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REDUNDANCY_SIG3</name>
          <description>Cache redundancy signal 3 register</description>
          <addressOffset>0x3e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REDCY_SIG3</name>
              <description>Those bits are prepared for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REDUNDANCY_SIG4</name>
          <description>Cache redundancy signal 0 register</description>
          <addressOffset>0x3ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REDCY_SIG4</name>
              <description>Those bits are prepared for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2503310</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>version control register. Note that this default value stored is the latest date when the hardware logic was updated.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
