esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CNNT_IO_MUX</name>
      <description>CNNT_IO_MUX Peripheral</description>
      <groupName>CNNT_IO_MUX</groupName>
      <baseAddress>0x20588000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GMAC_RMII_CLK</name>
          <description>GMAC IO MUX configuration register for GMAC_RMII_CLK</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x528</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for GMAC_RMII_CLK.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of GMAC_RMII_CLK in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of GMAC_RMII_CLK during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of GMAC_RMII_CLK during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of GMAC_RMII_CLK during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of GMAC_RMII_CLK.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of GMAC_RMII_CLK.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of GMAC_RMII_CLK.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of GMAC_RMII_CLK. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_GMAC_RMII_CLK_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for GMAC_RMII_CLK. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_GMAC_RMII_CLK_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC_RX_CLK</name>
          <description>GMAC IO MUX configuration register for GMAC_RX_CLK</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x528</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for GMAC_RX_CLK.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of GMAC_RX_CLK in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of GMAC_RX_CLK during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of GMAC_RX_CLK during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of GMAC_RX_CLK during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of GMAC_RX_CLK.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of GMAC_RX_CLK.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of GMAC_RX_CLK.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of GMAC_RX_CLK. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_GMAC_RX_CLK_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for GMAC_RX_CLK. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_GMAC_RX_CLK_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC_PHY_RXDV</name>
          <description>GMAC IO MUX configuration register for GMAC_PHY_RXDV</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x528</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for GMAC_PHY_RXDV.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of GMAC_PHY_RXDV in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of GMAC_PHY_RXDV during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of GMAC_PHY_RXDV during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of GMAC_PHY_RXDV during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of GMAC_PHY_RXDV.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of GMAC_PHY_RXDV.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of GMAC_PHY_RXDV.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of GMAC_PHY_RXDV. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_GMAC_PHY_RXDV_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for GMAC_PHY_RXDV. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_GMAC_PHY_RXDV_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC_PHY_RXD3</name>
          <description>GMAC IO MUX configuration register for GMAC_PHY_RXD3</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x528</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for GMAC_PHY_RXD3.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of GMAC_PHY_RXD3 in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of GMAC_PHY_RXD3 during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of GMAC_PHY_RXD3 during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of GMAC_PHY_RXD3 during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of GMAC_PHY_RXD3.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of GMAC_PHY_RXD3.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of GMAC_PHY_RXD3.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of GMAC_PHY_RXD3. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_GMAC_PHY_RXD3_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for GMAC_PHY_RXD3. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_GMAC_PHY_RXD3_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC_PHY_RXD2</name>
          <description>GMAC IO MUX configuration register for GMAC_PHY_RXD2</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x528</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for GMAC_PHY_RXD2.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of GMAC_PHY_RXD2 in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of GMAC_PHY_RXD2 during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of GMAC_PHY_RXD2 during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of GMAC_PHY_RXD2 during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of GMAC_PHY_RXD2.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of GMAC_PHY_RXD2.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of GMAC_PHY_RXD2.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of GMAC_PHY_RXD2. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for GMAC_PHY_RXD2. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
