esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>GMAC_PHY_RXD1</name>
          <description>GMAC IO MUX configuration register for GMAC_PHY_RXD1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x528</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for GMAC_PHY_RXD1.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of GMAC_PHY_RXD1 in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of GMAC_PHY_RXD1 during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of GMAC_PHY_RXD1 during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of GMAC_PHY_RXD1 during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of GMAC_PHY_RXD1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of GMAC_PHY_RXD1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of GMAC_PHY_RXD1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of GMAC_PHY_RXD1. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for GMAC_PHY_RXD1. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC_PHY_RXD0</name>
          <description>GMAC IO MUX configuration register for GMAC_PHY_RXD0</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x528</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for GMAC_PHY_RXD0.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of GMAC_PHY_RXD0 in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of GMAC_PHY_RXD0 during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of GMAC_PHY_RXD0 during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of GMAC_PHY_RXD0 during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of GMAC_PHY_RXD0.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of GMAC_PHY_RXD0.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of GMAC_PHY_RXD0.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of GMAC_PHY_RXD0. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for GMAC_PHY_RXD0. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_DATA0</name>
          <description>SDIO IO MUX configuration register for SDIO_DATA0</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x5ac</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for SDIO_DATA0.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of SDIO_DATA0 in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of SDIO_DATA0 during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of SDIO_DATA0 during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of SDIO_DATA0 during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of SDIO_DATA0\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of SDIO_DATA0.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of SDIO_DATA0.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of SDIO_DATA0. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_SDIO_DATA0_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for SDIO_DATA0. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_SDIO_DATA0_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_DATA1</name>
          <description>SDIO IO MUX configuration register for SDIO_DATA1</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x5ac</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for SDIO_DATA1.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of SDIO_DATA1 in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of SDIO_DATA1 during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of SDIO_DATA1 during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of SDIO_DATA1 during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of SDIO_DATA1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of SDIO_DATA1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of SDIO_DATA1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of SDIO_DATA1. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_SDIO_DATA1_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for SDIO_DATA1. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_SDIO_DATA1_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_DATA2</name>
          <description>SDIO IO MUX configuration register for SDIO_DATA2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x5ac</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for SDIO_DATA2.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of SDIO_DATA2 in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of SDIO_DATA2 during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of SDIO_DATA2 during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of SDIO_DATA2 during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of SDIO_DATA2.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of SDIO_DATA2.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of SDIO_DATA2.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of SDIO_DATA2. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_SDIO_DATA2_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for SDIO_DATA2. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_SDIO_DATA2_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
