esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SDIO_DATA3</name>
          <description>SDIO IO MUX configuration register for SDIO_DATA3</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x5ac</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for SDIO_DATA3.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of SDIO_DATA3 in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of SDIO_DATA3 during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of SDIO_DATA3 during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of SDIO_DATA3 during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of SDIO_DATA3.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of SDIO_DATA3.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of SDIO_DATA3.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of SDIO_DATA3. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_SDIO_DATA3_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for SDIO_DATA3. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_SDIO_DATA3_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_CLK</name>
          <description>SDIO IO MUX configuration register for SDIO_CLK</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x528</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for SDIO_CLK.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of SDIO_CLK in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of SDIO_CLK during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of SDIO_CLK during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of SDIO_CLK during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of SDIO_CLK.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of SDIO_CLK.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of SDIO_CLK.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of SDIO_CLK. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_SDIO_CLK_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for SDIO_CLK. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_SDIO_CLK_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_CMD</name>
          <description>SDIO IO MUX configuration register for SDIO_CMD</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x5ac</resetValue>
          <fields>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for SDIO_CMD.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of SDIO_CMD in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of SDIO_CMD during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of SDIO_CMD during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of SDIO_CMD during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of SDIO_CMD.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of SDIO_CMD.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of SDIO_CMD.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of SDIO_CMD. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when CNNT_IO_MUX_SDIO_CMD_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for SDIO_CMD. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of CNNT_IO_MUX_SDIO_CMD_HYS_EN\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>SDIO IO MUX configuration register for ctrl sel</description>
          <addressOffset>0x3f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDIO_PAD_PIN_CTRL_DED_SEL</name>
              <description>Configures whether or not to use dedicated ctrl signals for SDIO PAD.\\
0: Not use dedicated ctrl signals\\
1: Use dedicated ctrl signals\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC_PAD_PIN_CTRL_DED_SEL</name>
              <description>Configures whether or not to use dedicated ctrl signals for GMAC PAD.\\
0: Not use dedicated ctrl signals\\
1: Use dedicated ctrl signals\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>CNNT_IO_MUX clock gate register</description>
          <addressOffset>0x3f8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether or not to enable clock gate.\\
0: Not enable\\
1: Enable, the clock is free running. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2509120</resetValue>
          <fields>
            <field>
              <name>REG_DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
