esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CORDIC</name>
      <description>CORDIC Peripheral</description>
      <groupName>CORDIC</groupName>
      <baseAddress>0x2039b000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CORDIC</name>
        <value>134</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR_CFG</name>
          <description>Cordic model config register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Used to inicate the type of operation currently being performed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRES</name>
              <description>Instruct the cordic calculate cycle number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCALE</name>
              <description>The scaling of Input argument</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WORK_MODE</name>
              <description>Select Cordic Module data transfer Mode,2'd0: reg_in,reg_out, no zero mode, 2'd1: dma_in, reg_out, no zero mode, 2'd2: dma_loop, 2'd3: reg_in, reg_out, zero mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RES_NUM</name>
              <description>Result number</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARG_NUM</name>
              <description>Argument number</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RES_SIZE</name>
              <description>Result Size, 0: q1.15, 1: q1.31</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARG_SIZE</name>
              <description>Argument Size, 0: q1.15, 1: q1.31</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE_FLAG</name>
              <description>Used to synchronize register data to the computing core and start calculate</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RES_ALL_RDY_FLAG</name>
              <description>Used to indicate whether the operation all result has been stored in the result register</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RES_RDY_FLAG</name>
              <description>Used to indicate whether the operation result has been stored in the result register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARG1</name>
          <description>Cordic argument 1 config register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>First argument data for calculate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARG2</name>
          <description>Cordic argument 2 config register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Second argument data for calculate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RES1</name>
          <description>Cordic result 1 receive register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>First result data from calculate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RES2</name>
          <description>Cordic result 2 receive register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Second result data from calculate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_INT_ENA</name>
          <description>Cordic interrupt enable singal configuration register.</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAL_DONE_INT_ENA</name>
              <description>Write 1 to enable CAL_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_ALL_CAL_DONE_INT_ENA</name>
              <description>Write 1 to enable DMA_ALL_CAL_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AFIFO_WOVF_INT_ENA</name>
              <description>Write 1 to enable OUT_AFIFO_WOVF_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AFIFO_RUDF_INT_ENA</name>
              <description>Write 1 to enable IN_AFIFO_RUDF_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARG_NUM_ERR_INT_ENA</name>
              <description>Write 1 to enable ARG_NUM_ERR_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_INT_RAW</name>
          <description>Cordic interrupt raw singal status register.</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAL_DONE_INT_RAW</name>
              <description>The raw interrupt status of CAL_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_ALL_CAL_DONE_INT_RAW</name>
              <description>The raw interrupt status of DMA_ALL_CAL_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_AFIFO_WOVF_INT_RAW</name>
              <description>The raw interrupt status of OUT_AFIFO_WOVF_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_AFIFO_RUDF_INT_RAW</name>
              <description>The raw interrupt status of IN_AFIFO_RUDF_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARG_NUM_ERR_INT_RAW</name>
              <description>The raw interrupt status of ARG_NUM_ERR_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_INT_ST</name>
          <description>Cordic interrupt singal status register.</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAL_DONE_INT_ST</name>
              <description>The masked interrupt status of CAL_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_ALL_CAL_DONE_INT_ST</name>
              <description>The masked interrupt status of DMA_ALL_CAL_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_AFIFO_WOVF_INT_ST</name>
              <description>The masked interrupt status of OUT_AFIFO_WOVF_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_AFIFO_RUDF_INT_ST</name>
              <description>The masked interrupt status of IN_AFIFO_RUDF_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARG_NUM_ERR_INT_ST</name>
              <description>The masked interrupt status of ARG_NUM_ERR_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_INT_CLR</name>
          <description>Cordic interrupt  clear singal configuration register.</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAL_DONE_INT_CLR</name>
              <description>Write 1 to clear CAL_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA_ALL_CAL_DONE_INT_CLR</name>
              <description>Write 1 to clear DMA_ALL_CAL_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_AFIFO_WOVF_INT_CLR</name>
              <description>Write 1 to clear OUT_AFIFO_WOVF_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_AFIFO_RUDF_INT_CLR</name>
              <description>Write 1 to clear IN_AFIFO_RUDF_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ARG_NUM_ERR_INT_CLR</name>
              <description>Write 1 to clear ARG_NUM_ERR_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO_CFG</name>
          <description>Cordic FIFO configuration register.</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INFIFO_RESET</name>
              <description>infifo_reset_register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_RESET</name>
              <description>outfifo_reset_register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK</name>
          <description>Cordic clk configuration register.</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Force clock on for this register file</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Version register.</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x2411250</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version of this register file</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
