esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC</name>
      <description>DAC Peripheral</description>
      <groupName>DAC</groupName>
      <baseAddress>0x2081a000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x44</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_DAC</name>
        <value>145</value>
      </interrupt>
      <registers>
        <register>
          <name>PAD_CFG</name>
          <description>configure dac pad register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>HS_MODE_PAD_0</name>
              <description>1 to let DAC PAD 0 enter High speed mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_PAD_0</name>
              <description>1 to power on DAC PAD 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_ADC_MUX_PAD_0</name>
              <description>1 to enable adc mux for DAC PAD 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSAMP_LS_PAD_0</name>
              <description>1 to start sample and hold mode for DAC PAD 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCAL_LS_PAD_0</name>
              <description>1 to Calibrate the buffer of DAC PAD 0 (DBUF of pad 1 must be 1 during this operation)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF_LS_PAD_0</name>
              <description>1 to turn on the buffer of DAC PAD 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_LS_PAD_0</name>
              <description>1 to turn on the DAC PAD 0 during sample and hold mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_MODE_PAD_1</name>
              <description>1 to let DAC PAD 1 enter High speed mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_PAD_1</name>
              <description>1 to power on DAC PAD 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_ADC_MUX_PAD_1</name>
              <description>1 to enable adc mux for DAC PAD 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSAMP_LS_PAD_1</name>
              <description>1 to start sample and hold mode for DAC PAD 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCAL_LS_PAD_1</name>
              <description>1 to Calibrate the buffer of DAC PAD 1 (DBUF of pad 1 must be 1 during this operation)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF_LS_PAD_1</name>
              <description>1 to turn on the buffer of DAC PAD 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_LS_PAD_1</name>
              <description>1 to turn on the DAC PAD 1 during sample and hold mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV_NUM</name>
              <description>divide number between clk ls and clk hs</description>
              <bitOffset>14</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF_RANGE_LS_PAD_0</name>
              <description>1:when buffer is activated, allow using full code of maximum bitwidth
0:when buffer is not activated, should always be 0</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF_RANGE_LS_PAD_1</name>
              <description>1:when buffer is activated, allow using full code of maximum bitwidth
0:when buffer is not activated, should always be 0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALI_RESULT</name>
          <description>DAC CALI result register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PAD_0</name>
              <description>cali result register for pad 0 output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_1</name>
              <description>cali result register for pad 1 output</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDMA_CFG</name>
          <description>dac cfg register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PDMA_ALTER_MODE</name>
              <description>1:make rotation between two pads when outputting data of ppdma input path requires reg_dac_1/0_data_sel = 1
0:no change</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_RESET_FIFO</name>
              <description>1:reset dac fifo
0:no change</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_TRANS</name>
              <description>1:start transaction for pdma path output
0:stop transaction for pdma path output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDMA_TIMER_CFG</name>
          <description>PDMA path timer register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>PDMA_TIMER_EN</name>
              <description>1:enables using dac timer to reduce output frequency
0:no data output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_TIMER_TARGET</name>
              <description>dac pdma timer wait target</description>
              <bitOffset>1</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_OUTPUT_CFG</name>
          <description>dac DATA OUTPUT cfg register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PAD_0_DATA_SEL</name>
              <description>1:output pdma data
0:output sintx data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_1_DATA_SEL</name>
              <description>1:output pdma data
0:output sintx data</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINTX_CFG</name>
          <description>dac rstn register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>SW_TONE</name>
              <description>1:enable software adjusting current sintx output data
0:disable software adjustment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_FSTEP</name>
              <description>software adjust angle velocity foot step for sintx LUT input</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCALE_1</name>
              <description>right shift scaling config for LUT output of sintx for pad 0</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCALE_2</name>
              <description>software adjust angle velocity foot step for sintx LUT input</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_1</name>
              <description>bit 1: invert the highest bit of output for pad 0
Bit 0: invert the entire output for pad 0</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_2</name>
              <description>bit 1: invert the highest bit of output for pad 1
Bit 0: invert the entire output for pad 1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINTX_TIMER_CFG</name>
          <description>SINTX path timer register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>SINTX_TIMER_EN</name>
              <description>1:enables using dac timer to reduce output frequency
0:no data output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINTX_TIMER_TARGET</name>
              <description>dac sintx timer wait target</description>
              <bitOffset>1</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINTX_DATA</name>
          <description>dac output register for sintx path</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DC_1</name>
              <description>the data output for DAC PAD0 for sintx path</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_2</name>
              <description>the data output for DAC PAD1 for sintx path</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALI</name>
          <description>cali algorithm register for DAC</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_PAD_0</name>
              <description>cali out from DAC PAD 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_PAD_1</name>
              <description>cali out from DAC PAD 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLE_WAIT_CFG</name>
          <description>cali sample phase duration register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x2760276</resetValue>
          <fields>
            <field>
              <name>WAIT_TARGET_SAMPLE_PAD_0</name>
              <description>sample wait target for DAC PAD 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT_TARGET_SAMPLE_PAD_1</name>
              <description>sample wait target for DAC PAD 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HOLD_WAIT_CFG</name>
          <description>cali hold phase duration register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x3d003d</resetValue>
          <fields>
            <field>
              <name>WAIT_TARGET_HOLD_PAD_0</name>
              <description>hold wait target for DAC PAD 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT_TARGET_HOLD_PAD_1</name>
              <description>hold wait target for DAC PAD 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REFRESH_WAIT_CFG</name>
          <description>cali refresh phase duration register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x80008</resetValue>
          <fields>
            <field>
              <name>WAIT_TARGET_REFRESH_PAD_0</name>
              <description>refresh wait target for DAC PAD 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT_TARGET_REFRESH_PAD_1</name>
              <description>refresh wait target for DAC PAD 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDMA_INT_RAW</name>
          <description>need_des</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PDMA_EMPTY_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>need_des</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PDMA_EMPTY_INT_ST</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>need_des</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PDMA_EMPTY_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>need_des</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PDMA_EMPTY_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>need_des</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x250619</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
