esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA2D</name>
      <description>DMA2D Peripheral</description>
      <groupName>DMA2D</groupName>
      <baseAddress>0x20346000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2ec</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA2D_IN_CH0</name>
        <value>105</value>
      </interrupt>
      <interrupt>
        <name>DMA2D_IN_CH1</name>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>DMA2D_IN_CH2</name>
        <value>107</value>
      </interrupt>
      <interrupt>
        <name>DMA2D_OUT_CH0</name>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>DMA2D_OUT_CH1</name>
        <value>109</value>
      </interrupt>
      <interrupt>
        <name>DMA2D_OUT_CH2</name>
        <value>110</value>
      </interrupt>
      <interrupt>
        <name>DMA2D_OUT_CH3</name>
        <value>111</value>
      </interrupt>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_CONF0_CH%s</name>
          <description>Configures the tx direction of channel %s</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>OUT_AUTO_WRBACK_CH</name>
              <description>Set this bit to enable automatic outlink-writeback when all the data pointed by outlink descriptor has been received.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_MODE_CH</name>
              <description>EOF flag generation mode when receiving data. 1: EOF flag for Tx channel 0 is generated when data need to read has been popped from FIFO in DMA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDSCR_BURST_EN_CH</name>
              <description>Set this bit to 1 to enable INCR burst transfer for Tx channel 0 reading link descriptor when accessing internal SRAM.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ECC_AES_EN_CH</name>
              <description>When access address space is ecc/aes area, this bit should be set to 1. In this case, the start address of square should be 16-bit aligned. The width of square multiply byte number of one pixel should be 16-bit aligned.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CHECK_OWNER_CH</name>
              <description>Set this bit to enable checking the owner attribute of the link descriptor.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_LOOP_TEST_CH</name>
              <description>reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_MEM_BURST_LENGTH_CH</name>
              <description>Block size of Tx channel 0. 0: single      1: 16 bytes      2: 32 bytes    3: 64 bytes    4: 128 bytes</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_MACRO_BLOCK_SIZE_CH</name>
              <description>Sel TX macro-block size 0: 8pixel*8pixel     1: 8pixel*16pixel     2: 16pixel*16pixel     3: no macro-block     , only useful in mode 1 of the link descriptor</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_PORT_EN_CH</name>
              <description>Set this bit to 1 to obtain descriptor from IP port</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_PAGE_BOUND_EN_CH</name>
              <description>Set this bit to 1 to make sure AXI read data don't cross the address boundary which define by mem_burst_length</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_REORDER_EN_CH</name>
              <description>Enable TX channel 0 macro block reorder when set to 1, only channel0 have this selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_RST_CH</name>
              <description>Write 1 then write 0 to this bit to reset TX channel</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CMD_DISABLE_CH</name>
              <description>Write 1 before reset and write 0 after reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ARB_WEIGHT_OPT_DIS_CH</name>
              <description>Set this bit to 1 to disable arbiter optimum weight function.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_INT_RAW_CH%s</name>
          <description>Raw interrupt status of TX channel %s</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been transmitted to peripherals for Tx channel 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been read from memory for Tx channel 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when detecting outlink descriptor error, including owner error, the second and third word error of outlink descriptor for Tx channel 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when data corresponding a outlink (includes one link descriptor or few link descriptors) is transmitted out for Tx channel 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L1_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when fifo is overflow.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L1_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when fifo is underflow.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L2_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when fifo is overflow.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L2_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when fifo is underflow.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L3_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when fifo is overflow.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L3_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when fifo is underflow.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_RO_OVF_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when reorder fifo is overflow.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_RO_UDF_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when reorder fifo is underflow.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_TASK_OVF_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when dscr ready task fifo is overflow.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_INT_ENA_CH%s</name>
          <description>Interrupt enable bits of TX channel %s</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUT_DONE_CH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUT_EOF_CH_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L1_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L1_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L2_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUTFIFO_OVF_L2_CH_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L2_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUTFIFO_UDF_L2_CH_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L3_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L3_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_RO_OVF_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUTFIFO_RO_OVF_CH_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_RO_UDF_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUTFIFO_RO_UDF_CH_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_TASK_OVF_CH_INT_ENA</name>
              <description>The interrupt enable bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_INT_ST_CH%s</name>
          <description>Masked interrupt status of TX channel %s</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_EOF_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L1_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L1_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L2_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L2_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L3_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L3_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_RO_OVF_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUTFIFO_RO_OVF_CH_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_RO_UDF_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUTFIFO_RO_UDF_CH_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_TASK_OVF_CH_INT_ST</name>
              <description>The raw interrupt status bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
