esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_INT_CLR_CH%s</name>
          <description>Interrupt clear bits of TX channel %s</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH_INT_CLR</name>
              <description>Set this bit to clear the OUT_DONE_CH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_EOF_CH_INT_CLR</name>
              <description>Set this bit to clear the OUT_EOF_CH_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH_INT_CLR</name>
              <description>Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH_INT_CLR</name>
              <description>Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L1_CH_INT_CLR</name>
              <description>Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L1_CH_INT_CLR</name>
              <description>Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L2_CH_INT_CLR</name>
              <description>Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L2_CH_INT_CLR</name>
              <description>Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L3_CH_INT_CLR</name>
              <description>Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L3_CH_INT_CLR</name>
              <description>Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_RO_OVF_CH_INT_CLR</name>
              <description>Set this bit to clear the OUTFIFO_RO_OVF_CH_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_RO_UDF_CH_INT_CLR</name>
              <description>Set this bit to clear the OUTFIFO_RO_UDF_CH_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_DSCR_TASK_OVF_CH_INT_CLR</name>
              <description>Set this bit to clear the OUT_DSCR_TASK_OVF_CH_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUTFIFO_STATUS_CH%s</name>
          <description>Represents the status of the tx fifo of channel %s</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x817f82</resetValue>
          <fields>
            <field>
              <name>OUTFIFO_FULL_L2_CH</name>
              <description>Tx FIFO full signal for Tx channel 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_EMPTY_L2_CH</name>
              <description>Tx FIFO empty signal for Tx channel 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_CNT_L2_CH</name>
              <description>The register stores the byte number of the data in Tx FIFO for Tx channel 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_1B_CH</name>
              <description>reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_2B_CH</name>
              <description>reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_3B_CH</name>
              <description>reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_4B_CH</name>
              <description>reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_5B_CH</name>
              <description>reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_6B_CH</name>
              <description>reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_7B_CH</name>
              <description>reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_8B_CH</name>
              <description>reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_FULL_L1_CH</name>
              <description>Tx FIFO full signal for Tx channel 0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_EMPTY_L1_CH</name>
              <description>Tx FIFO empty signal for Tx channel 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_CNT_L1_CH</name>
              <description>The register stores the byte number of the data in Tx FIFO for Tx channel 0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_FULL_L3_CH</name>
              <description>Tx FIFO full signal for Tx channel 0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_EMPTY_L3_CH</name>
              <description>Tx FIFO empty signal for Tx channel 0.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_CNT_L3_CH</name>
              <description>The register stores the byte number of the data in Tx FIFO for Tx channel 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_PUSH_CH%s</name>
          <description>Configures the tx fifo of channel %s</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTFIFO_WDATA_CH</name>
              <description>This register stores the data that need to be pushed into DMA Tx FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_PUSH_CH</name>
              <description>Set this bit to push data into DMA Tx FIFO.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_LINK_CONF_CH%s</name>
          <description>Configures the tx descriptor operations of channel %s</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x800000</resetValue>
          <fields>
            <field>
              <name>OUTLINK_STOP_CH</name>
              <description>Set this bit to stop dealing with the outlink descriptors.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTLINK_START_CH</name>
              <description>Set this bit to start dealing with the outlink descriptors.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTLINK_RESTART_CH</name>
              <description>Set this bit to restart a new outlink from the last address.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTLINK_PARK_CH</name>
              <description>1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM is working.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_LINK_ADDR_CH%s</name>
          <description>Configures the tx descriptor address of channel %s</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_ADDR_CH</name>
              <description>This register stores the first outlink descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_STATE_CH%s</name>
          <description>Represents the working status of the tx descriptor of channel %s</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x1000000</resetValue>
          <fields>
            <field>
              <name>OUTLINK_DSCR_ADDR_CH</name>
              <description>This register stores the current outlink descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_STATE_CH</name>
              <description>This register stores the current descriptor state machine state.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_STATE_CH</name>
              <description>This register stores the current control module state machine state.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_RESET_AVAIL_CH</name>
              <description>This register indicate that if the channel reset is safety.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_EOF_DES_ADDR_CH%s</name>
          <description>Represents the address associated with the outlink descriptor of channel %s</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_EOF_DES_ADDR_CH</name>
              <description>This register stores the address of the outlink descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_DSCR_CH%s</name>
          <description>Represents the address associated with the outlink descriptor of channel %s</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_CH</name>
              <description>The address of the next outlink descriptor address y.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_DSCR_BF0_CH%s</name>
          <description>Represents the address associated with the outlink descriptor of channel %s</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF0_CH</name>
              <description>The address of the last outlink descriptor's next address y-1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_DSCR_BF1_CH%s</name>
          <description>Represents the address associated with the outlink descriptor of channel %s</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF1_CH</name>
              <description>The address of the second-to-last outlink descriptor's next address y-2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_PERI_SEL_CH%s</name>
          <description>Configures the tx peripheral of channel %s</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x7</resetValue>
          <fields>
            <field>
              <name>OUT_PERI_SEL_CH</name>
              <description>This register is used to select peripheral for Tx channel   0:  jpeg     1: display-1     2: display-2     3: display-3      7: no choose</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_ARB_CH%s</name>
          <description>Configures the tx arbiter of channel %s</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_ARB_TOKEN_NUM_CH</name>
              <description>Set the max number of token count of arbiter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ARB_PRIORITY_CH</name>
              <description>Set the priority of channel</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_RO_STATUS_CH%s</name>
          <description>Represents the status of the tx reorder module of channel %s</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTFIFO_RO_CNT_CH</name>
              <description>The register stores the byte number of the data in color convert Tx FIFO for channel 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_RO_WR_STATE_CH</name>
              <description>The register stores the state of read ram of reorder</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_RO_RD_STATE_CH</name>
              <description>The register stores the state of write ram of reorder</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_PIXEL_BYTE_CH</name>
              <description>the number of bytes contained in a pixel at TX channel     0: 1byte     1: 1.5bytes     2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_BURST_BLOCK_NUM_CH</name>
              <description>the number of macro blocks contained in a burst of data at TX channel</description>
              <bitOffset>14</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_RO_PD_CONF_CH0</name>
          <description>Configures the tx reorder memory of channel 0</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x10</resetValue>
          <fields>
            <field>
              <name>OUT_RO_RAM_FORCE_PD_CH</name>
              <description>unused! dma reorder ram power down</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_RO_RAM_FORCE_PU_CH</name>
              <description>unused! dma reorder ram power up</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_RO_RAM_CLK_FO_CH</name>
              <description>1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA. 0: A gate-clock will be used when accessing the RAM in DMA.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_COLOR_CONVERT_CH%s</name>
          <description>Configures the tx color convert of channel %s</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x38</resetValue>
          <fields>
            <field>
              <name>OUT_COLOR_OUTPUT_SEL_CH</name>
              <description>Set final color convert process and output type    0: RGB888 to RGB565     1: YUV444 to YUV422     2: output directly</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_COLOR_3B_PROC_EN_CH</name>
              <description>Enable generic color convert modlue between color input &amp; color output, need to configure parameter.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_COLOR_INPUT_SEL_CH</name>
              <description>Set first color convert process and input color type    0: RGB565 to RGB888     1: YUV422 to YUV444      2: Other 2byte/pixel type    3: Other 3byte/pixel type    7: disable color space convert</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
