esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_SCRAMBLE_CH%s</name>
          <description>Configures the tx scramble of channel %s</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_SCRAMBLE_SEL_PRE_CH</name>
              <description>Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 : BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_COLOR_PARAM0_CH%s</name>
          <description>Configures the tx color convert parameter of channel %s</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x12a</resetValue>
          <fields>
            <field>
              <name>OUT_COLOR_PARAM_H0_CH</name>
              <description>Set first 2 parameter of most significant byte of pending 3 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_COLOR_PARAM1_CH%s</name>
          <description>Configures the tx color convert parameter of channel %s</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0xc86d999</resetValue>
          <fields>
            <field>
              <name>OUT_COLOR_PARAM_H1_CH</name>
              <description>Set last 2 parameter of most significant byte of pending 3 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_COLOR_PARAM2_CH%s</name>
          <description>Configures the tx color convert parameter of channel %s</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0x1e712a</resetValue>
          <fields>
            <field>
              <name>OUT_COLOR_PARAM_M0_CH</name>
              <description>Set first 2 parameter of midium significant byte of pending 3 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_COLOR_PARAM3_CH%s</name>
          <description>Configures the tx color convert parameter of channel %s</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0x21e4f30</resetValue>
          <fields>
            <field>
              <name>OUT_COLOR_PARAM_M1_CH</name>
              <description>Set last 2 parameter of midium significant byte of pending 3 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_COLOR_PARAM4_CH%s</name>
          <description>Configures the tx color convert parameter of channel %s</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0x8112a</resetValue>
          <fields>
            <field>
              <name>OUT_COLOR_PARAM_L0_CH</name>
              <description>Set first 2 parameter of least significant byte of pending 3 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_COLOR_PARAM5_CH%s</name>
          <description>Configures the tx color convert parameter of channel %s</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0xbad3000</resetValue>
          <fields>
            <field>
              <name>OUT_COLOR_PARAM_L1_CH</name>
              <description>Set last 2 parameter of least significant byte of pending 3 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_ETM_CONF_CH%s</name>
          <description>Configures the tx etm of channel %s</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>OUT_ETM_EN_CH</name>
              <description>Configures the enable of the etm function, 1 is enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ETM_LOOP_EN_CH</name>
              <description>Configures the enable of the descriptors loop etm function, 1 is enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_TASK_MAK_CH</name>
              <description>Configures the maximum number of cacheable descriptors.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_DSCR_PORT_BLK_CH%s</name>
          <description>Configures the tx block size in dscr port mode</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x48012</resetValue>
          <fields>
            <field>
              <name>OUT_DSCR_PORT_BLK_H_CH</name>
              <description>Set the vertical height of tx block size in dscr port mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_PORT_BLK_V_CH</name>
              <description>Set the horizontal width of tx block size in dscr port mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_CONF0_CH%s</name>
          <description>Configures the rx direction of channel %s</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_MEM_TRANS_EN_CH</name>
              <description>enable memory trans of the same channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDSCR_BURST_EN_CH</name>
              <description>Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor when accessing SRAM.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ECC_AES_EN_CH</name>
              <description>When access address space is ecc/aes area, this bit should be set to 1. In this case, the start address of square should be 16-bit aligned. The width of square multiply byte number of one pixel should be 16-bit aligned.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CHECK_OWNER_CH</name>
              <description>Set this bit to enable checking the owner attribute of the link descriptor.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_LOOP_TEST_CH</name>
              <description>reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_MEM_BURST_LENGTH_CH</name>
              <description>Block size of Rx channel 0. 0: single      1: 16 bytes      2: 32 bytes    3: 64 bytes    4: 128 bytes</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_MACRO_BLOCK_SIZE_CH</name>
              <description>Sel RX macro-block size 0: 8pixel*8pixel     1: 8pixel*16pixel     2: 16pixel*16pixel     3: no macro-block     , only useful in mode 1 of the link descriptor</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_PORT_EN_CH</name>
              <description>Set this bit to 1 to obtain descriptor from IP port</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_PAGE_BOUND_EN_CH</name>
              <description>Set this bit to 1 to make sure AXI write data don't cross the address boundary which define by mem_burst_length</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_REORDER_EN_CH</name>
              <description>Enable RX channel 0 macro block reorder when set to 1, only channel0 have this selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_RST_CH</name>
              <description>Write 1 then write 0 to this bit to reset Rx channel</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CMD_DISABLE_CH</name>
              <description>Write 1 before reset and write 0 after reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ARB_WEIGHT_OPT_DIS_CH</name>
              <description>Set this bit to 1 to disable arbiter optimum weight function.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_INT_RAW_CH%s</name>
          <description>Raw interrupt status of RX channel %s</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been transmitted to peripherals for Rx channel 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and no data error is detected for Rx channel 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and data error is detected</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when detecting inlink descriptor error, including owner error, the second and third word error of inlink descriptor for Rx channel 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_L1_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when fifo of Rx channel is overflow.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_L1_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when fifo of Rx channel is underflow.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_L2_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when fifo of Rx channel is overflow.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_L2_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when fifo of Rx channel is underflow.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_L3_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when fifo of Rx channel is overflow.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_L3_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when fifo of Rx channel is underflow.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the last descriptor is done but fifo also remain data.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_RO_OVF_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when reorder fifo is overflow.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_RO_UDF_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when reorder fifo is underflow.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_TASK_OVF_CH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when dscr ready task fifo is overflow.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_INT_ENA_CH%s</name>
          <description>Interrupt enable bits of RX channel %s</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH_INT_ENA</name>
              <description>The interrupt enable bit for the IN_DONE_CH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH_INT_ENA</name>
              <description>The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH_INT_ENA</name>
              <description>The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH_INT_ENA</name>
              <description>The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_L1_CH_INT_ENA</name>
              <description>The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_L1_CH_INT_ENA</name>
              <description>The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_L2_CH_INT_ENA</name>
              <description>The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_L2_CH_INT_ENA</name>
              <description>The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_L3_CH_INT_ENA</name>
              <description>The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_L3_CH_INT_ENA</name>
              <description>The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH_INT_ENA</name>
              <description>The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_RO_OVF_CH_INT_ENA</name>
              <description>The interrupt enable bit for the INFIFO_RO_OVF_CH_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_RO_UDF_CH_INT_ENA</name>
              <description>The interrupt enable bit for the INFIFO_RO_UDF_CH_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_TASK_OVF_CH_INT_ENA</name>
              <description>The interrupt enable bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
