esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_INT_ST_CH%s</name>
          <description>Masked interrupt status of RX channel %s</description>
          <addressOffset>0x50c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH_INT_ST</name>
              <description>The raw interrupt status bit for the IN_DONE_CH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH_INT_ST</name>
              <description>The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH_INT_ST</name>
              <description>The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH_INT_ST</name>
              <description>The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_L1_CH_INT_ST</name>
              <description>The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_L1_CH_INT_ST</name>
              <description>The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_L2_CH_INT_ST</name>
              <description>The raw interrupt status bit for the INFIFO_OVF_L2_CH_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_L2_CH_INT_ST</name>
              <description>The raw interrupt status bit for the INFIFO_UDF_L2_CH_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_L3_CH_INT_ST</name>
              <description>The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_L3_CH_INT_ST</name>
              <description>The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH_INT_ST</name>
              <description>The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_RO_OVF_CH_INT_ST</name>
              <description>The raw interrupt status bit for the INFIFO_RO_OVF_CH_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_RO_UDF_CH_INT_ST</name>
              <description>The raw interrupt status bit for the INFIFO_RO_UDF_CH_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_TASK_OVF_CH_INT_ST</name>
              <description>The raw interrupt status bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_INT_CLR_CH%s</name>
          <description>Interrupt clear bits of RX channel %s</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH_INT_CLR</name>
              <description>Set this bit to clear the IN_DONE_CH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH_INT_CLR</name>
              <description>Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH_INT_CLR</name>
              <description>Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH_INT_CLR</name>
              <description>Set this bit to clear the INDSCR_ERR_CH_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_L1_CH_INT_CLR</name>
              <description>Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_L1_CH_INT_CLR</name>
              <description>Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_L2_CH_INT_CLR</name>
              <description>Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_L2_CH_INT_CLR</name>
              <description>Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_L3_CH_INT_CLR</name>
              <description>Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_L3_CH_INT_CLR</name>
              <description>Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH_INT_CLR</name>
              <description>Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_RO_OVF_CH_INT_CLR</name>
              <description>Set this bit to clear the INFIFO_RO_OVF_CH_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_RO_UDF_CH_INT_CLR</name>
              <description>Set this bit to clear the INFIFO_RO_UDF_CH_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_TASK_OVF_CH_INT_CLR</name>
              <description>Set this bit to clear the IN_DSCR_TASK_OVF_CH_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>INFIFO_STATUS_CH%s</name>
          <description>Represents the status of the rx fifo of channel %s</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <resetValue>0x810002</resetValue>
          <fields>
            <field>
              <name>INFIFO_FULL_L2_CH</name>
              <description>Rx FIFO full signal for Rx channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_EMPTY_L2_CH</name>
              <description>Rx FIFO empty signal for Rx channel.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_CNT_L2_CH</name>
              <description>The register stores the byte number of the data in Rx FIFO for Rx channel.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_REMAIN_UNDER_1B_CH</name>
              <description>reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_REMAIN_UNDER_2B_CH</name>
              <description>reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_REMAIN_UNDER_3B_CH</name>
              <description>reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_REMAIN_UNDER_4B_CH</name>
              <description>reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_REMAIN_UNDER_5B_CH</name>
              <description>reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_REMAIN_UNDER_6B_CH</name>
              <description>reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_REMAIN_UNDER_7B_CH</name>
              <description>reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_REMAIN_UNDER_8B_CH</name>
              <description>reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_FULL_L1_CH</name>
              <description>Rx FIFO full signal for Rx channel 0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_EMPTY_L1_CH</name>
              <description>Rx FIFO empty signal for Rx channel 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_CNT_L1_CH</name>
              <description>The register stores the byte number of the data in Rx FIFO for Rx channel 0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_FULL_L3_CH</name>
              <description>Rx FIFO full signal for Rx channel 0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_EMPTY_L3_CH</name>
              <description>Rx FIFO empty signal for Rx channel 0.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_CNT_L3_CH</name>
              <description>The register stores the byte number of the data in Rx FIFO for Rx channel 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_POP_CH%s</name>
          <description>Configures the rx fifo of channel %s</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <resetValue>0x400</resetValue>
          <fields>
            <field>
              <name>INFIFO_RDATA_CH</name>
              <description>This register stores the data popping from DMA Rx FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_POP_CH</name>
              <description>Set this bit to pop data from DMA Rx FIFO.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_LINK_CONF_CH%s</name>
          <description>Configures the rx descriptor operations of channel %s</description>
          <addressOffset>0x51c</addressOffset>
          <size>32</size>
          <resetValue>0x1100000</resetValue>
          <fields>
            <field>
              <name>INLINK_AUTO_RET_CH</name>
              <description>Set this bit to return to current inlink descriptor's address, when there are some errors in current receiving data.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INLINK_STOP_CH</name>
              <description>Set this bit to stop dealing with the inlink descriptors.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INLINK_START_CH</name>
              <description>Set this bit to start dealing with the inlink descriptors.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INLINK_RESTART_CH</name>
              <description>Set this bit to mount a new inlink descriptor.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INLINK_PARK_CH</name>
              <description>1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is working.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_LINK_ADDR_CH%s</name>
          <description>Configures the rx descriptor address of channel %s</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_ADDR_CH</name>
              <description>This register stores the first inlink descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_STATE_CH%s</name>
          <description>Represents the working status of the rx descriptor of channel %s</description>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <resetValue>0x800000</resetValue>
          <fields>
            <field>
              <name>INLINK_DSCR_ADDR_CH</name>
              <description>This register stores the current inlink descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_STATE_CH</name>
              <description>reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_STATE_CH</name>
              <description>reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_RESET_AVAIL_CH</name>
              <description>This register indicate that if the channel reset is safety.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_SUC_EOF_DES_ADDR_CH%s</name>
          <description>Represents the address associated with the inlink descriptor of channel %s</description>
          <addressOffset>0x528</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_SUC_EOF_DES_ADDR_CH</name>
              <description>This register stores the address of the inlink descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_ERR_EOF_DES_ADDR_CH%s</name>
          <description>Represents the address associated with the inlink descriptor of channel %s</description>
          <addressOffset>0x52c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_ERR_EOF_DES_ADDR_CH</name>
              <description>This register stores the address of the inlink descriptor when there are some errors in current receiving data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_DSCR_CH%s</name>
          <description>Represents the address associated with the inlink descriptor of channel %s</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_DSCR_CH</name>
              <description>The address of the next inlink descriptor address x.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_DSCR_BF0_CH%s</name>
          <description>Represents the address associated with the inlink descriptor of channel %s</description>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_DSCR_BF0_CH</name>
              <description>The address of the last inlink descriptor's next address x-1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_DSCR_BF1_CH%s</name>
          <description>Represents the address associated with the inlink descriptor of channel %s</description>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_DSCR_BF1_CH</name>
              <description>The address of the second-to-last inlink descriptor's next address x-2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_PERI_SEL_CH%s</name>
          <description>Configures the rx peripheral of channel %s</description>
          <addressOffset>0x53c</addressOffset>
          <size>32</size>
          <resetValue>0x7</resetValue>
          <fields>
            <field>
              <name>IN_PERI_SEL_CH</name>
              <description>This register is used to select peripheral for Rx channel   0:  jpeg     1: display-1     2: display-2        7: no choose</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
