esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_ARB_CH%s</name>
          <description>Configures the rx arbiter of channel %s</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_ARB_TOKEN_NUM_CH</name>
              <description>Set the max number of token count of arbiter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ARB_PRIORITY_CH</name>
              <description>Set the priority of channel</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_RO_STATUS_CH%s</name>
          <description>Represents the status of the rx reorder module of channel %s</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INFIFO_RO_CNT_CH</name>
              <description>The register stores the byte number of the data in color convert Rx FIFO for channel 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_RO_WR_STATE_CH</name>
              <description>The register stores the state of read ram of reorder</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_RO_RD_STATE_CH</name>
              <description>The register stores the state of write ram of reorder</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_PIXEL_BYTE_CH</name>
              <description>the number of bytes contained in a pixel at RX channel     0: 1byte     1: 1.5bytes     2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_BURST_BLOCK_NUM_CH</name>
              <description>the number of macro blocks contained in a burst of data at RX channel</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_RO_PD_CONF_CH0</name>
          <description>Configures the rx reorder memory of channel 0</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <resetValue>0x10</resetValue>
          <fields>
            <field>
              <name>IN_RO_RAM_FORCE_PD_CH</name>
              <description>unused! dma reorder ram power down</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_RO_RAM_FORCE_PU_CH</name>
              <description>unused! dma reorder ram power up</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_RO_RAM_CLK_FO_CH</name>
              <description>1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA. 0: A gate-clock will be used when accessing the RAM in DMA.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_COLOR_CONVERT_CH0</name>
          <description>Configures the Rx color convert of channel 0</description>
          <addressOffset>0x54c</addressOffset>
          <size>32</size>
          <resetValue>0x38</resetValue>
          <fields>
            <field>
              <name>IN_COLOR_OUTPUT_SEL_CH</name>
              <description>Set final color convert process and output type    0: RGB888 to RGB565     1: output directly     2: YUV444 to YUV422    3: YUV444 to YUV420</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_COLOR_3B_PROC_EN_CH</name>
              <description>Enable generic color convert modlue between color input &amp; color output, need to configure parameter.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_COLOR_INPUT_SEL_CH</name>
              <description>Set first color convert process and input color type    0: YUV422/420 to YUV444     1: YUV422      2: YUV444/420      7: disable color space convert</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_SCRAMBLE_CH0</name>
          <description>Configures the rx scramble of channel 0</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_SCRAMBLE_SEL_PRE_CH</name>
              <description>Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 : BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SCRAMBLE_SEL_POST_CH</name>
              <description>Scramble data after color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 : BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_COLOR_PARAM0_CH0</name>
          <description>Configures the rx color convert parameter of channel 0</description>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <resetValue>0x12a</resetValue>
          <fields>
            <field>
              <name>IN_COLOR_PARAM_H0_CH</name>
              <description>Set first 2 parameter of most significant byte of pending 3 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_COLOR_PARAM1_CH0</name>
          <description>Configures the rx color convert parameter of channel 0</description>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <resetValue>0xc86d999</resetValue>
          <fields>
            <field>
              <name>IN_COLOR_PARAM_H1_CH</name>
              <description>Set last 2 parameter of most significant byte of pending 3 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_COLOR_PARAM2_CH0</name>
          <description>Configures the rx color convert parameter of channel 0</description>
          <addressOffset>0x55c</addressOffset>
          <size>32</size>
          <resetValue>0x1e712a</resetValue>
          <fields>
            <field>
              <name>IN_COLOR_PARAM_M0_CH</name>
              <description>Set first 2 parameter of midium significant byte of pending 3 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_COLOR_PARAM3_CH0</name>
          <description>Configures the rx color convert parameter of channel 0</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <resetValue>0x21e4f30</resetValue>
          <fields>
            <field>
              <name>IN_COLOR_PARAM_M1_CH</name>
              <description>Set last 2 parameter of midium significant byte of pending 3 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_COLOR_PARAM4_CH0</name>
          <description>Configures the rx color convert parameter of channel 0</description>
          <addressOffset>0x564</addressOffset>
          <size>32</size>
          <resetValue>0x8112a</resetValue>
          <fields>
            <field>
              <name>IN_COLOR_PARAM_L0_CH</name>
              <description>Set first 2 parameter of least significant byte of pending 3 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_COLOR_PARAM5_CH0</name>
          <description>Configures the rx color convert parameter of channel 0</description>
          <addressOffset>0x568</addressOffset>
          <size>32</size>
          <resetValue>0xbad3000</resetValue>
          <fields>
            <field>
              <name>IN_COLOR_PARAM_L1_CH</name>
              <description>Set last 2 parameter of least significant byte of pending 3 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_ETM_CONF_CH%s</name>
          <description>Configures the rx etm of channel %s</description>
          <addressOffset>0x56c</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>IN_ETM_EN_CH</name>
              <description>Configures the enable of the etm function, 1 is enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ETM_LOOP_EN_CH</name>
              <description>Configures the enable of the descriptors loop etm function, 1 is enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_TASK_MAK_CH</name>
              <description>Configures the maximum number of cacheable descriptors.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_ERR</name>
          <description>Represents the status of th axi bus</description>
          <addressOffset>0xa00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RID_ERR_CNT</name>
              <description>AXI read id err cnt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RRESP_ERR_CNT</name>
              <description>AXI read resp err cnt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRESP_ERR_CNT</name>
              <description>AXI write resp err cnt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_FIFO_CNT</name>
              <description>AXI read cmd fifo remain cmd count</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_BAK_FIFO_CNT</name>
              <description>AXI read backup cmd fifo remain cmd count</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_FIFO_CNT</name>
              <description>AXI write cmd fifo remain cmd count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_BAK_FIFO_CNT</name>
              <description>AXI write backup cmd fifo remain cmd count</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RST_CONF</name>
          <description>Configures the reset of axi</description>
          <addressOffset>0xa04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AXIM_RD_RST</name>
              <description>Write 1 then write 0  to this bit to reset axi master read data FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIM_WR_RST</name>
              <description>Write 1 then write 0  to this bit to reset axi master write data FIFO.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>1'h1: Force clock on for register. 1'h0: Support clock only when application writes registers.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_START_ADDR</name>
          <description>The start address of accessible address space.</description>
          <addressOffset>0xa08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_START_ADDR</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_END_ADDR</name>
          <description>The end address of accessible address space.</description>
          <addressOffset>0xa0c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_END_ADDR</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTR_MEM_START_ADDR</name>
          <description>The start address of accessible address space.</description>
          <addressOffset>0xa10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACCESS_EXTR_MEM_START_ADDR</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTR_MEM_END_ADDR</name>
          <description>The end address of accessible address space.</description>
          <addressOffset>0xa14</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ACCESS_EXTR_MEM_END_ADDR</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_ARB_CONFIG</name>
          <description>Configures the tx arbiter</description>
          <addressOffset>0xa18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_ARB_TIMEOUT_NUM</name>
              <description>Set the max number of timeout count of arbiter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_WEIGHT_EN</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_ARB_CONFIG</name>
          <description>Configures the rx arbiter</description>
          <addressOffset>0xa1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_ARB_TIMEOUT_NUM</name>
              <description>Set the max number of timeout count of arbiter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_WEIGHT_EN</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_RESULT</name>
          <description>reserved</description>
          <addressOffset>0xa20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_ENA</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDN_RESULT</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_HIGH</name>
          <description>reserved</description>
          <addressOffset>0xa24</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>RDN_ECO_HIGH</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_LOW</name>
          <description>reserved</description>
          <addressOffset>0xa28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_ECO_LOW</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>register version.</description>
          <addressOffset>0xa2c</addressOffset>
          <size>32</size>
          <resetValue>0x2306190</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
