esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DS</name>
      <description>Digital Signature</description>
      <groupName>DS</groupName>
      <baseAddress>0x2050c000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xa64</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>512</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>Y_MEM[%s]</name>
          <description>memory that stores Y</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>512</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>M_MEM[%s]</name>
          <description>memory that stores M</description>
          <addressOffset>0x200</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>512</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>RB_MEM[%s]</name>
          <description>memory that stores Rb</description>
          <addressOffset>0x400</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>BOX_MEM[%s]</name>
          <description>memory that stores BOX</description>
          <addressOffset>0x600</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>IV_MEM[%s]</name>
          <description>memory that stores IV</description>
          <addressOffset>0x630</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>512</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>X_MEM[%s]</name>
          <description>memory that stores X</description>
          <addressOffset>0x800</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>512</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>Z_MEM[%s]</name>
          <description>memory that stores Z</description>
          <addressOffset>0xa00</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>SET_START</name>
          <description>Activates the DS module</description>
          <addressOffset>0xe00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_START</name>
              <description>Configures whether or not to activate the DS peripheral.\\
0: Invalid\\
1: Activate the DS peripheral\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_CONTINUE</name>
          <description>DS continue control register</description>
          <addressOffset>0xe04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_CONTINUE</name>
              <description>set this bit to continue DS operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_FINISH</name>
          <description>Ends DS operation</description>
          <addressOffset>0xe08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_FINISH</name>
              <description>Configures whether or not to end DS operation. \\
0: Invalid\\
1: End DS operation\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_BUSY</name>
          <description>Status of the DS module</description>
          <addressOffset>0xe0c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QUERY_BUSY</name>
              <description>Represents whether or not the DS module is idle.\\
0: The DS module is idle\\
1: The DS module is busy\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_KEY_WRONG</name>
          <description>Checks the reason why \begin{math}DS_KEY\end{math} is not ready</description>
          <addressOffset>0xe10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QUERY_KEY_WRONG</name>
              <description>Represents the specific problem with HMAC initialization.\\
0: HMAC is not called\\
1-15: HMAC was activated, but the DS peripheral did not successfully receive the \begin{math}DS_KEY\end{math} from the HMAC peripheral. (The biggest value is 15)\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_CHECK</name>
          <description>Queries DS check result</description>
          <addressOffset>0xe14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MD_ERROR</name>
              <description>Represents whether or not the MD check passes.\\
0: The MD check passes\\
1: The MD check fails\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PADDING_BAD</name>
              <description>Represents whether or not the padding check passes.\\
0: The padding check passes\\
1: The padding check fails\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATIC</name>
          <description>DS configure key source register</description>
          <addressOffset>0xe18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_SOURCE</name>
              <description>digital signature key source bit. \\
1'b0: key is from hmac.\\
1'b1: key is from key manager. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKIP_PADDING_CHECK</name>
              <description>digital signature padding check bypass bit. \\
1'b0: padding check enabled.\\
1'b1: padding check skipped. \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>DS version control register</description>
          <addressOffset>0xe20</addressOffset>
          <size>32</size>
          <resetValue>0x20250819</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>ds version information</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_LIMIT</name>
          <description>DS timeout limit configurate register</description>
          <addressOffset>0xe24</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>TIMEOUT_LIMIT</name>
              <description>The timeout limitation for waiting sub-IP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
