esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ECDSA</name>
      <description>ECDSA (Elliptic Curve Digital Signature Algorithm) Accelerator</description>
      <groupName>ECDSA</groupName>
      <baseAddress>0x2050e000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1a0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ECDSA</name>
        <value>58</value>
      </interrupt>
      <registers>
        <register>
          <name>CONF</name>
          <description>ECDSA configure register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WORK_MODE</name>
              <description>The work mode bits of ECDSA Accelerator. 0: Signature Verify Mode. 1: Signature Generate Mode. 2: Export Public Key Mode. 3: invalid.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_CURVE</name>
              <description>The ecc curve select bit of ECDSA Accelerator.  0: P-192. 1: P-256. 2: P-384 3: SM2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTWARE_SET_K</name>
              <description>The source of k select bit. 0: k is automatically generated by hardware. 1: k is written by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTWARE_SET_Z</name>
              <description>The source of z select bit. 0: z is generated from SHA result. 1: z is written by software.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DETERMINISTIC_K</name>
              <description>The source of hardware generated k. 0: k is generated by TRNG. 1: k is generated by deterministic derivation algorithm.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USE_HARDWARE_KEY</name>
              <description>Configures the ECDSA use software key or hardware key.\\ 0: Software key. \\ 1: Hardware key. \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK</name>
          <description>ECDSA clock gate register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GATE_FORCE_ON</name>
              <description>Write 1 to force on register clock gate.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>ECDSA interrupt raw register, valid in level.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the ecdsa_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the ecdsa_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POST_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the ecdsa_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHA_RELEASE_INT_RAW</name>
              <description>The raw interrupt status bit  for the ecdsa_sha_release_int interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>ECDSA interrupt status register.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the ecdsa_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the ecdsa_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POST_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the ecdsa_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHA_RELEASE_INT_ST</name>
              <description>The masked interrupt status bit  for the ecdsa_sha_release_int interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>ECDSA interrupt enable register.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the ecdsa_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the ecdsa_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POST_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the ecdsa_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_RELEASE_INT_ENA</name>
              <description>The interrupt enable bit  for the ecdsa_sha_release_int interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>ECDSA interrupt clear register.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_CLR</name>
              <description>Set this bit to clear the ecdsa_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PROC_DONE_INT_CLR</name>
              <description>Set this bit to clear the ecdsa_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>POST_DONE_INT_CLR</name>
              <description>Set this bit to clear the ecdsa_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SHA_RELEASE_INT_CLR</name>
              <description>Set this bit to clear the ecdsa_sha_release_int interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>START</name>
          <description>ECDSA start register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>START</name>
              <description>Write 1 to start caculation of ECDSA Accelerator. This bit will be self-cleared after configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOAD_DONE</name>
              <description>Write 1 to input load done signal of ECDSA Accelerator. This bit will be self-cleared after configuration.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GET_DONE</name>
              <description>Write 1 to input get done signal of ECDSA Accelerator. This bit will be self-cleared after configuration.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>ECDSA status register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUSY</name>
              <description>The status bits of ECDSA Accelerator. ECDSA is at 0: IDLE, 1: LOAD, 2: GET, 3: BUSY state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>ECDSA result register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OPERATION_RESULT</name>
              <description>The operation result bit of ECDSA Accelerator, only valid when ECDSA calculation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_LIMIT</name>
          <description>ECDSA timeout limit configurate register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>TIMEOUT_LIMIT</name>
              <description>The timeout limitation for waiting sub-IP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FREE</name>
          <description>ECDSA free state</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>FREE</name>
              <description>Represents if ECDSA Accelerator is free or not. \\
0: non-free\\
1: free\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_0</name>
          <description>ECDSA key data register 0</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_0</name>
              <description>These bits stores key_0 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_1</name>
          <description>ECDSA key data register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_1</name>
              <description>These bits stores key_1 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_2</name>
          <description>ECDSA key data register 2</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_2</name>
              <description>These bits stores key_2 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_3</name>
          <description>ECDSA key data register 3</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_3</name>
              <description>These bits stores key_3 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_4</name>
          <description>ECDSA key data register 4</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_4</name>
              <description>These bits stores key_4 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_5</name>
          <description>ECDSA key data register 5</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_5</name>
              <description>These bits stores key_5 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_6</name>
          <description>ECDSA key data register 6</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_6</name>
              <description>These bits stores key_6 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_7</name>
          <description>ECDSA key data register 7</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_7</name>
              <description>These bits stores key_7 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_8</name>
          <description>ECDSA key data register 8</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_8</name>
              <description>These bits stores key_8 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_9</name>
          <description>ECDSA key data register 9</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_9</name>
              <description>These bits stores key_9 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_10</name>
          <description>ECDSA key data register 10</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_10</name>
              <description>These bits stores key_10 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_11</name>
          <description>ECDSA key data register 11</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_11</name>
              <description>These bits stores key_11 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2508190</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>ECDSA version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_MODE</name>
          <description>ECDSA control SHA register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SHA_MODE</name>
              <description>The work mode bits of SHA Calculator in ECDSA Accelerator. 0: SHA1. 1: SHA-224. 2: SHA-256. 3: SHA-384 4: SHA-512. 5: SHA-512224. 6: SHA-512256. 14:SM3. Others: invalid.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_START</name>
          <description>ECDSA control SHA register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SHA_START</name>
              <description>Write 1 to start the first caculation of SHA Calculator in ECDSA Accelerator. This bit will be self-cleared after configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_CONTINUE</name>
          <description>ECDSA control SHA register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SHA_CONTINUE</name>
              <description>Write 1 to start the latter caculation of SHA Calculator in ECDSA Accelerator. This bit will be self-cleared after configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_BUSY</name>
          <description>ECDSA status register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SHA_BUSY</name>
              <description>The busy status bit of SHA Calculator in ECDSA Accelerator. 1:SHA is in calculation. 0: SHA is idle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>MESSAGE_MEM[%s]</name>
          <description>The memory that stores message.</description>
          <addressOffset>0x280</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>R_MEM[%s]</name>
          <description>The memory that stores r.</description>
          <addressOffset>0x3e0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>S_MEM[%s]</name>
          <description>The memory that stores s.</description>
          <addressOffset>0x410</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>Z_MEM[%s]</name>
          <description>The memory that stores software written z.</description>
          <addressOffset>0x440</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>QAX_MEM[%s]</name>
          <description>The memory that stores x coordinates of QA or software written k.</description>
          <addressOffset>0x470</addressOffset>
          <size>8</size>
        </register>
