esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <dim>48</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>QAY_MEM[%s]</name>
          <description>The memory that stores y coordinates of QA.</description>
          <addressOffset>0x4a0</addressOffset>
          <size>8</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EFUSE</name>
      <description>eFuse Controller</description>
      <groupName>EFUSE</groupName>
      <baseAddress>0x20715000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3d8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PGM_DATA%s</name>
          <description>Represents pgm_data%s</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PGM_DATA</name>
              <description>Configures the %sth 32-bit data to be programmed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PGM_CHECK_VALUE%s</name>
          <description>Represents pgm_check_value%s</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PGM_RS_DATA</name>
              <description>Configures the %sth RS code to be programmed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_WR_DIS</name>
          <description>Represents rd_wr_dis</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WR_DIS</name>
              <description>Represents whether programming of individual eFuse memory bit is disabled.  For mapping between the bits of this field and the eFuse memory bits, please refer to Table \ref{tab:efuse-block0-para} and Table \ref{tab:efuse-block-1-10-para}.\\1: Disabled\\0: Enabled\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA0</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RD_DIS</name>
              <description>Represents whether reading of individual eFuse block(block4~block9) is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_JTAG</name>
              <description>Represents whether the function of usb switch to jtag is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG</name>
              <description>Represents whether USB-Serial-JTAG is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_FORCE_DOWNLOAD</name>
              <description>Represents whether the function that forces chip into download mode is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DOWNLOAD_MSPI_DIS</name>
              <description>Represents whether SPI0 controller during boot_mode_download is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_TWAI</name>
              <description>Represents whether TWAI function is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JTAG_SEL_ENABLE</name>
              <description>Represents whether the selection between usb_to_jtag and pad_to_jtag through strapping gpio15 when both EFUSE_DIS_PAD_JTAG and EFUSE_DIS_USB_JTAG are equal to 0 is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOFT_DIS_JTAG</name>
              <description>Represents whether JTAG is disabled in soft way.\\ Odd number: disabled\\ Even number: enabled\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_PAD_JTAG</name>
              <description>Represents whether JTAG is disabled in the hard way(permanently).\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DOWNLOAD_MANUAL_ENCRYPT</name>
              <description>Represents whether flash encrypt function is disabled or enabled(except in SPI boot mode).\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_WIFI6</name>
              <description>Represents thether the WIFI6 feature is enable or disabled. 1: WIFI6 is disable, 0: WIFI6 is enabled.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HUK_GEN_STATE</name>
              <description>Represents the control of validation of HUK generate mode. Odd of 1 is invalid, even of 1 is valid.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA1</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KM_RND_SWITCH_CYCLE</name>
              <description>Represents the control of key manager random number switch cycle. 0: control by register. 1: 8 km clk cycles. 2: 16 km cycles. 3: 32 km cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KM_DISABLE_DEPLOY_MODE</name>
              <description>Represents whether the deploy mode of key manager is disable or not. \\ 1: disabled \\ 0: enabled.\\ bit 0: ecsda, bit 1: flash &amp; spi boot srambler, bit2: hmac &amp; aes, bit3: ds &amp; rma nonce, bit4: psram</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KM_DEPLOY_ONLY_ONCE</name>
              <description>Represents whether corresponding key can only be deployed once. 1 is true, 0 is false. \\ 0: ecsda\\ 1: flash &amp; spi boot srambler\\ 2: hmac &amp; aes\\ 3: ds &amp; rma nonce\\ 4: psram\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_USE_KEY_MANAGER_KEY</name>
              <description>Represents whether corresponding key must come from key manager. 1 is true, 0 is false.\\ 0: ecsda\\ 1: flash\\ 2: reserved\\ 3: reserved\\ 4: psram\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_DISABLE_SW_INIT_KEY</name>
              <description>Represents whether to disable software written init key, and force use efuse_init_key.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KM_XTS_KEY_LENGTH_256</name>
              <description>Represents whether to configure flash encryption use xts-128 key. else use xts-256 key. \\ 0: 128-bit key \\ 1: 256-bit key\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_DELAY_SEL</name>
              <description>Represents the threshold level of the RTC watchdog STG0 timeout.\\0: Original threshold configuration value of STG0 *2 \\1: Original threshold configuration value of STG0 *4 \\2: Original threshold configuration value of STG0 *8 \\3: Original threshold configuration value of STG0 *16 \\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_SM_CRYPT</name>
              <description>Represents whether to disable all the SM crypto functions, including SM2, SM3.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_BOOT_CRYPT_CNT</name>
              <description>Represents whether SPI boot encrypt/decrypt is disabled or enabled.\\ Odd number of 1: enabled\\ Even number of 1: disabled\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE0</name>
              <description>Represents whether revoking first secure boot key is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE1</name>
              <description>Represents whether revoking second secure boot key is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE2</name>
              <description>Represents whether revoking third secure boot key is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA2</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_PURPOSE_0</name>
              <description>Represents the purpose of Key0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_1</name>
              <description>Represents the purpose of Key1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_2</name>
              <description>Represents the purpose of Key2.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_3</name>
              <description>Represents the purpose of Key3.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_4</name>
              <description>Represents the purpose of Key4.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECC_FORCE_CONST_TIME</name>
              <description>Represents whether permanently turn on ECC const-time mode. \\ 1: turn on\\ 0: turn off\\</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECDSA_DISABLE_SOFT_K</name>
              <description>Represents whether permanently turn off ECDSA software set KEY.\\ 1: turn off\\ 0: turn on\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEC_DPA_LEVEL</name>
              <description>Represents the spa secure level by configuring the clock random divide mode.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XTS_DPA_CLK_ENABLE</name>
              <description>Represents whether to enable xts clock anti-dpa attack function.\\0: Disabled. \\1: Enabled\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA3</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XTS_DPA_PSEUDO_LEVEL</name>
              <description>Represents the control of the xts pseudo-round anti-dpa attack function.\\ 0: controlled by register.\\ 1-3: the higer the value is, the more pseudo-rounds are inserted to the xts-aes calculation\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_EN</name>
              <description>Represents whether secure boot is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_AGGRESSIVE_REVOKE</name>
              <description>Represents whether revoking aggressive secure boot is enabled or disabled.\\ 1: enabled.\\ 0: disabled\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_TYPE</name>
              <description>flash type: 0: nor flash, 1: nand flash</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_OTG_DOWNLOAD_MODE</name>
              <description>Set this bit to disable download via USB-OTG.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_TPUW</name>
              <description>Represents the flash waiting time after power-up, in unit of ms. When the value less than 15, the waiting time is the programmed value. Otherwise, the waiting time is 2 times the programmed value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DOWNLOAD_MODE</name>
              <description>Represents whether Download mode is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DIRECT_BOOT</name>
              <description>Represents whether direct boot mode is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG_ROM_PRINT</name>
              <description>Represents whether print from USB-Serial-JTAG is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK_KM_KEY</name>
              <description>Represetns whether to lock the efuse xts key.\\ 1. Lock\\ 0: Unlock\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE</name>
              <description>Represents whether the USB-Serial-JTAG download function is disabled or enabled.\\ 1: Disable\\ 0: Enable\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_SECURITY_DOWNLOAD</name>
              <description>Represents whether security download is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_PRINT_CONTROL</name>
              <description>Represents the type of UART printing.\\ 00: force enable printing\\ 01: enable printing when GPIO8 is reset at low level\\ 10: enable printing when GPIO8 is reset at high level\\ 11: force disable printing\\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_SEND_RESUME</name>
              <description>Represents whether ROM code is forced to send a resume command during SPI boot.\\ 1: forced\\ 0:not forced\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA4</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SECURE_VERSION</name>
              <description>Represents the version used by ESP-IDF anti-rollback feature.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_DISABLE_FAST_WAKE</name>
              <description>Represents whether FAST VERIFY ON WAKE is disabled or enabled when Secure Boot is enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HYS_EN_PAD</name>
              <description>Represents whether the hysteresis function of corresponding PAD is enabled.\\ 1: enabled\\ 0:disabled\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
