esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>RD_REPEAT_DATA5</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DCDC_VSET_EN</name>
              <description>Select dcdc vset use efuse_dcdc_vset.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_WDT</name>
              <description>Set this bit to disable watch dog.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_SWD</name>
              <description>Set this bit to disable super-watchdog.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_SHA384_EN</name>
              <description>Represents whether secure boot using SHA-384 is enabled. 0: Disable 1: Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOTLOADER_ANTI_ROLLBACK_SECURE_VERSION</name>
              <description>Represents the anti-rollback secure version of the 2nd stage bootloader used by the ROM bootloader.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOTLOADER_ANTI_ROLLBACK_EN</name>
              <description>Represents whether the ani-rollback check for the 2nd stage bootloader is enabled.\\1: Enabled\\0: Disabled\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOTLOADER_ANTI_ROLLBACK_UPDATE_IN_ROM</name>
              <description>Represents whether the ani-rollback SECURE_VERSION will be updated from the ROM bootloader.\\1: Enable\\0: Disable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECOVERY_BOOTLOADER_FLASH_SECTOR</name>
              <description>Represents the starting flash sector (flash sector size is 0x1000) of the recovery bootloader used by the ROM bootloader If the primary bootloader fails. 0 and 0xFFF - this feature is disabled.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RMA_ENA</name>
              <description>Represents whether rma function is supported in download mode.\\ 2'b01/2'b10: enabled\\2'b00/2'b11: disabled\\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA6</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RMA_SESSION_COUNTER</name>
              <description>Represents the number of times the RMA session has been entered.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RMA_NONCE_ENA</name>
              <description>Represents whether random number NONCE is used in RMA and whether the KM module is used to generate the NONCE\\. 2'bx0: No NONCE\\ 2'b1x: Use KM generate NONCE.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RMA_CHIP_INFO_SOURCE</name>
              <description>Represents whether HUK_info is selected as the source for calculating CHIP_info in RMA.\\1: use HUK_info\\ 0: use UNIQ_id\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RMA_DISABLE_FAST_VEF</name>
              <description>Represents whether disable FAST_VEF in RMA session.\\1: disable\\0: enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVT_0_GLITCH_EN</name>
              <description>Represents whether to enable PVT power glitch monitor function.\\1:Enable. \\0:Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVT_0_GLITCH_MODE</name>
              <description>Use to configure glitch mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVT_1_GLITCH_EN</name>
              <description>Represents whether to enable PVT power glitch monitor function.\\1:Enable. \\0:Disable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVT_1_GLITCH_MODE</name>
              <description>Use to configure glitch mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_FLASH_POWER_SEL</name>
              <description>FLASH power select.\\ 1'b1: use 3.3V\\1'b0: use 1.8V</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_FLASH_POWER_SEL_EN</name>
              <description>FLASH power select enable signal. 1'b1 : validates EFUSE_PMU_FLASH_POWER_SEL 1'b0: invalidates EFUSE_PMU_FLASH_POWER_SEL</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POWER_GLITCH_EN</name>
              <description>set these bit enable power glitch enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENA_XTS_SHADOW</name>
              <description>Represents whether to enable XTS-AES shadow core countermeasure against fault injection attacks. \\ 0: Disabled\\ 1: Enabled\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENA_SPI_BOOT_CRYPT_SCRAMBLER</name>
              <description>Represents whether to enable ciphertext scrambler for external memory . \\ 0: Disabled\\ 1: Enabled\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RE_ENABLE_JTAG_SOURCE</name>
              <description>Represents which Crypto peripheral is selected for renabling JTAG. \\ 0: RMA\\ 1: HMAC\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA7</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REPEAT7_RSVD</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS0</name>
          <description>Represents rd_mac_sys</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAC_0</name>
              <description>Represents MAC address. Low 32-bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS1</name>
          <description>Represents rd_mac_sys</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAC_1</name>
              <description>Represents MAC address. High 16-bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAC_EXT</name>
              <description>Represents the extended bits of MAC address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS2</name>
          <description>Represents rd_mac_sys</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAC_RESERVED_0</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAC_RESERVED_1</name>
              <description>Reserved.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS3</name>
          <description>Represents rd_mac_sys</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAC_RESERVED_2</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_DATA_PART0_0</name>
              <description>Represents the first 14-bit of zeroth part of system data.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS4</name>
          <description>Represents rd_mac_sys</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYS_DATA_PART0_1</name>
              <description>Represents the second 32-bit of zeroth part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS5</name>
          <description>Represents rd_mac_sys</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYS_DATA_PART0_2</name>
              <description>Represents the third 32-bit of zeroth part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RD_SYS_PART1_DATA%s</name>
          <description>Represents rd_sys_part1_data%s</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYS_DATA_PART1</name>
              <description>Represents the zeroth 32-bit of first part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RD_USR_DATA%s</name>
          <description>Represents rd_usr_data%s</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USR_DATA</name>
              <description>Represents the zeroth 32-bit of block3 (user).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RD_KEY0_DATA%s</name>
          <description>Represents rd_key0_data%s</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY0_DATA</name>
              <description>Represents the zeroth 32-bit of key0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RD_KEY1_DATA%s</name>
          <description>Represents rd_key1_data%s</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY1_DATA</name>
              <description>Represents the zeroth 32-bit of key1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RD_KEY2_DATA%s</name>
          <description>Represents rd_key2_data%s</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY2_DATA</name>
              <description>Represents the zeroth 32-bit of key2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RD_KEY3_DATA%s</name>
          <description>Represents rd_key3_data%s</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY3_DATA</name>
              <description>Represents the zeroth 32-bit of key3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RD_KEY4_DATA%s</name>
          <description>Represents rd_key4_data%s</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY4_DATA</name>
              <description>Represents the zeroth 32-bit of key4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA0</name>
          <description>Represents rd_sys_part2_data</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_0</name>
              <description>Represents the zeroth 32-bit of second part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA1</name>
          <description>Represents rd_sys_part2_data</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_1</name>
              <description>Represents the first 32-bit of second part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA2</name>
          <description>Represents rd_sys_part2_data</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_2</name>
              <description>Represents the second 32-bit of second part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA3</name>
          <description>Represents rd_sys_part2_data</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_3</name>
              <description>Represents the third 32-bit of second part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA4</name>
          <description>Represents rd_sys_part2_data</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_4</name>
              <description>Represents the fourth 32-bit of second part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA5</name>
          <description>Represents rd_sys_part2_data</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_5</name>
              <description>Represents the fifth 32-bit of second part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA6</name>
          <description>Represents rd_sys_part2_data</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DEVICE_EXCHG_PINS</name>
              <description>Represents whether enable usb device exchange pins of D+ and D- or not. \\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_DEVICE_DREFH</name>
              <description>Represents the single-end input threhold vrefh, 1.76 V to 2 V with step of 80 mV.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_DEVICE_DREFL</name>
              <description>Represents the usb device single-end input low threhold, 0.8 V to 1.04 V with step of 80 mV.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVT_0_CELL_SELECT</name>
              <description>Power glitch monitor PVT cell select.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVT_1_CELL_SELECT</name>
              <description>Power glitch monitor PVT cell select.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA7</name>
          <description>Represents rd_sys_part2_data</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PVT_0_LIMIT</name>
              <description>Power glitch monitor threthold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVT_1_LIMIT</name>
              <description>Power glitch monitor threthold.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
