esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>INT_ST</name>
          <description>eFuse interrupt status register.</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_DONE_INT_ST</name>
              <description>The masked interrupt status of EFUSE_READ_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_DONE_INT_ST</name>
              <description>The masked interrupt status of EFUSE_PGM_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>eFuse interrupt enable register.</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_DONE_INT_ENA</name>
              <description>Write 1 to enable EFUSE_READ_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGM_DONE_INT_ENA</name>
              <description>Write 1 to enable EFUSE_PGM_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>eFuse interrupt clear register.</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_DONE_INT_CLR</name>
              <description>Write 1 to clear EFUSE_READ_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PGM_DONE_INT_CLR</name>
              <description>Write 1 to clear EFUSE_PGM_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_CONF</name>
          <description>Controls the eFuse programming voltage.</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <resetValue>0x1fe18</resetValue>
          <fields>
            <field>
              <name>DAC_CLK_DIV</name>
              <description>Configures the division factor of the rising clock of the programming voltage (ramp-up slew rate be slower than 2.5V/250us, and ramp-up 10mV for one-cycle, so reg_dac_clk_div &gt; fclk).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_CLK_PAD_SEL</name>
              <description>Don't care.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_NUM</name>
              <description>Configures clock cycles for programming voltage to rise (VDDQ 2.5V, ramp-up 10mV for one-cycle). Measurement unit: a clock cycle divided by EFUSE_DAC_CLK_DIV.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OE_CLR</name>
              <description>Configures whether to reduce the power supply of programming voltage.\\ 0: Not reduce\\ 1: Reduce\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_TIM_CONF</name>
          <description>Configures read timing parameters.</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <resetValue>0x1b010201</resetValue>
          <fields>
            <field>
              <name>THR_A</name>
              <description>Configures the read hold time (&gt;=14ns). Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRD</name>
              <description>Configures the read time (&gt;=52ns). Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSUR_A</name>
              <description>Configures the read setup time (&gt;=14ns). Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_INIT_NUM</name>
              <description>Configures the waiting time of reading eFuse memory. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_TIM_CONF1</name>
          <description>Configurarion register 1 of eFuse programming timing parameters.</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <resetValue>0x1399a01</resetValue>
          <fields>
            <field>
              <name>TSUP_A</name>
              <description>Configures the programming setup time (&gt;14ns). Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWR_ON_NUM</name>
              <description>Configures the power up time for VDDQ (&gt;reg_dac_clk_div*reg_dac_clk_div). Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THP_A</name>
              <description>Configures the programming hold time (&gt;=11ns). Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_TIM_CONF2</name>
          <description>Configurarion register 2 of eFuse programming timing parameters.</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <resetValue>0xf001e0</resetValue>
          <fields>
            <field>
              <name>PWR_OFF_NUM</name>
              <description>Configures the power outage time for VDDQ. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPGM</name>
              <description>Configures the active programming time (&gt;10us). Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_TIM_CONF0_RS_BYPASS</name>
          <description>Configurarion register0 of eFuse programming time parameters and rs bypass operation.</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <resetValue>0x2000</resetValue>
          <fields>
            <field>
              <name>BYPASS_RS_CORRECTION</name>
              <description>Configures whether to bypass the Reed-Solomon (RS) correction step.\\ 0: Not bypass\\ 1: Bypass\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_RS_BLK_NUM</name>
              <description>Configures which block number to bypass the Reed-Solomon (RS) correction step.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE</name>
              <description>Configures whether to update multi-bit register signals.\\ 1: Update\\ 0: No effect\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TPGM_INACTIVE</name>
              <description>Configures the inactive programming time. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_WR_DIS</name>
          <description>eFuse apb2otp block0 data register1.</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_WR_DIS</name>
              <description>OTP block0 write disable data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W1</name>
          <description>eFuse apb2otp block0 data register2.</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W1</name>
              <description>OTP block0 backup1 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W2</name>
          <description>eFuse apb2otp block0 data register3.</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W2</name>
              <description>OTP block0 backup1 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W3</name>
          <description>eFuse apb2otp block0 data register4.</description>
          <addressOffset>0x50c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W3</name>
              <description>OTP block0 backup1 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W4</name>
          <description>eFuse apb2otp block0 data register5.</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W4</name>
              <description>OTP block0 backup1 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W5</name>
          <description>eFuse apb2otp block0 data register6.</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W5</name>
              <description>OTP block0 backup1 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W6</name>
          <description>eFuse apb2otp block0 data register7.</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W6</name>
              <description>OTP block0 backup1 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W7</name>
          <description>eFuse apb2otp block0 data register8.</description>
          <addressOffset>0x51c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W7</name>
              <description>OTP block0 backup1 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W8</name>
          <description>eFuse apb2otp block0 data register9.</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W8</name>
              <description>OTP block0 backup1 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W1</name>
          <description>eFuse apb2otp block0 data register10.</description>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W1</name>
              <description>OTP block0 backup2 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W2</name>
          <description>eFuse apb2otp block0 data register11.</description>
          <addressOffset>0x528</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W2</name>
              <description>OTP block0 backup2 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W3</name>
          <description>eFuse apb2otp block0 data register12.</description>
          <addressOffset>0x52c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W3</name>
              <description>OTP block0 backup2 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W4</name>
          <description>eFuse apb2otp block0 data register13.</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W4</name>
              <description>OTP block0 backup2 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W5</name>
          <description>eFuse apb2otp block0 data register14.</description>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W5</name>
              <description>OTP block0 backup2 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W6</name>
          <description>eFuse apb2otp block0 data register15.</description>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W6</name>
              <description>OTP block0 backup2 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W7</name>
          <description>eFuse apb2otp block0 data register16.</description>
          <addressOffset>0x53c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W7</name>
              <description>OTP block0 backup2 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W8</name>
          <description>eFuse apb2otp block0 data register17.</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W8</name>
              <description>OTP block0 backup2 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W1</name>
          <description>eFuse apb2otp block0 data register18.</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W1</name>
              <description>OTP block0 backup3 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W2</name>
          <description>eFuse apb2otp block0 data register19.</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W2</name>
              <description>OTP block0 backup3 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W3</name>
          <description>eFuse apb2otp block0 data register20.</description>
          <addressOffset>0x54c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W3</name>
              <description>OTP block0 backup3 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W4</name>
          <description>eFuse apb2otp block0 data register21.</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W4</name>
              <description>OTP block0 backup3 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W5</name>
          <description>eFuse apb2otp block0 data register22.</description>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W5</name>
              <description>OTP block0 backup3 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W6</name>
          <description>eFuse apb2otp block0 data register23.</description>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W6</name>
              <description>OTP block0 backup3 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W7</name>
          <description>eFuse apb2otp block0 data register24.</description>
          <addressOffset>0x55c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W7</name>
              <description>OTP block0 backup3 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W8</name>
          <description>eFuse apb2otp block0 data register25.</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W8</name>
              <description>OTP block0 backup3 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
