esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>APB2OTP_BLK8_W6</name>
          <description>eFuse apb2otp block8 data register6.</description>
          <addressOffset>0x6c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W6</name>
              <description>OTP block8 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W7</name>
          <description>eFuse apb2otp block8 data register7.</description>
          <addressOffset>0x6c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W7</name>
              <description>OTP block8 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W8</name>
          <description>eFuse apb2otp block8 data register8.</description>
          <addressOffset>0x6cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W8</name>
              <description>OTP block8 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W9</name>
          <description>eFuse apb2otp block8 data register9.</description>
          <addressOffset>0x6d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W9</name>
              <description>OTP block8 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W10</name>
          <description>eFuse apb2otp block8 data register10.</description>
          <addressOffset>0x6d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W10</name>
              <description>OTP block8 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W11</name>
          <description>eFuse apb2otp block8 data register11.</description>
          <addressOffset>0x6d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W11</name>
              <description>OTP block8 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W1</name>
          <description>eFuse apb2otp block9 data register1.</description>
          <addressOffset>0x6dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W1</name>
              <description>OTP block9 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W2</name>
          <description>eFuse apb2otp block9 data register2.</description>
          <addressOffset>0x6e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W2</name>
              <description>OTP block9 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W3</name>
          <description>eFuse apb2otp block9 data register3.</description>
          <addressOffset>0x6e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W3</name>
              <description>OTP block9 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W4</name>
          <description>eFuse apb2otp block9 data register4.</description>
          <addressOffset>0x6e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W4</name>
              <description>OTP block9 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W5</name>
          <description>eFuse apb2otp block9 data register5.</description>
          <addressOffset>0x6ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W5</name>
              <description>OTP block9 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W6</name>
          <description>eFuse apb2otp block9 data register6.</description>
          <addressOffset>0x6f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W6</name>
              <description>OTP block9 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W7</name>
          <description>eFuse apb2otp block9 data register7.</description>
          <addressOffset>0x6f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W7</name>
              <description>OTP block9 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W8</name>
          <description>eFuse apb2otp block9 data register8.</description>
          <addressOffset>0x6f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W8</name>
              <description>OTP block9 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W9</name>
          <description>eFuse apb2otp block9 data register9.</description>
          <addressOffset>0x6fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W9</name>
              <description>OTP block9 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W10</name>
          <description>eFuse apb2otp block9 data register10.</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W10</name>
              <description>OTP block9 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W11</name>
          <description>eFuse apb2otp block9 data register11.</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W11</name>
              <description>OTP block9 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_EN</name>
          <description>eFuse apb2otp enable configuration register.</description>
          <addressOffset>0x70c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_APB2OTP_EN</name>
              <description>Apb2otp mode enable signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
