esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>REGISTER1_MACFRAMEFILTER</name>
          <description>Contains the frame filtering controls</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROMISCUOUS_MODE</name>
              <description>Promiscuous Mode When this bit is set, the Address Filter module passes all incoming frames irrespective of the destination or source address The SA or DA Filter Fails status bits of the Receive Status Word are always cleared when PR is set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUC</name>
              <description>Hash Unicast When set, the MAC performs destination address filtering of unicast frames according to the hash table When reset, the MAC performs a perfect destination address filtering for unicast frames, that is, it compares the DA field with the values programmed in DA registers If Hash Filter is not selected during core configuration, this bit is reserved _and RO_</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HMC</name>
              <description>Hash Multicast When set, the MAC performs destination address filtering of received multicast frames according to the hash table When reset, the MAC performs a perfect destination address filtering for multicast frames, that is, it compares the DA field with the values programmed in DA registers If Hash Filter is not selected during core configuration, this bit is reserved _and RO_</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAIF</name>
              <description>DA Inverse Filtering When this bit is set, the Address Check block operates in inverse filtering mode for the DA address comparison for both unicast and multicast frames When reset, normal filtering of frames is performed</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PM</name>
              <description>Pass All Multicast When set, this bit indicates that all received frames with a multicast destination address _first bit in the destination address field is '1'_ are passed When reset, filtering of multicast frame depends on HMC bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBF</name>
              <description>Disable Broadcast Frames When this bit is set, the AFM module blocks all incoming broadcast frames In addition, it overrides all other filter settings When this bit is reset, the AFM module passes all received broadcast frames</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCF</name>
              <description>Pass Control Frames These bits control the forwarding of all control frames _including unicast and multicast Pause frames_ 00: MAC filters all control frames from reaching the application 01: MAC forwards all control frames except Pause frames to application even if they fail the Address filter 10: MAC forwards all control frames to application even if they fail the Address Filter 11: MAC forwards control frames that pass the Address Filter The following conditions should be true for the Pause frames processing: Condition 1 : The MAC is in the fullduplex mode and flow control is enabled by setting Bit 2 _RFE_ of Register 6 _Flow Control Register_ to 1 Condition 2 : The destination address _DA_ of the received frame matches the special multicast address or the MAC Address 0 when Bit 3 _UP_ of the Register 6 _Flow Control Register_ is set Condition 3: The Type field of the received frame is 0x8808 and the OPCODE field is 0x0001 Note: This field should be set to 01 only when the Condition 1 is true, that is, the MAC is programmed to operate in the fullduplex mode and the RFE bit is enabled Otherwise, the Pause frame filtering may be inconsistent When Condition 1 is false, the Pause frames are considered as generic control frames Therefore, to pass all control frames _including Pause frames_ when the fullduplex mode and flow control is not enabled, you should set the PCF field to 10 or 11 _as required by the application_</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAIF</name>
              <description>SA Inverse Filtering When this bit is set, the Address Check block operates in inverse filtering mode for the SA address comparison The frames whose SA matches the SA registers are marked as failing the SA Address filter When this bit is reset, frames whose SA does not match the SA registers are marked as failing the SA Address filter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAF</name>
              <description>Source Address Filter Enable When this bit is set, the MAC compares the SA field of the received frames with the values programmed in the enabled SA registers If the comparison fails, the MAC drops the frame When this bit is reset, the MAC forwards the received frame to the application with updated SAF bit of the Rx Status depending on the SA address comparison Note: According to the IEEE specification, Bit 47 of the SA is reserved and set to 0 However, in DWC_gmac, the MAC compares all 48 bits The software driver should take this into consideration while programming the MAC address registers for SA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPF</name>
              <description>Hash or Perfect Filter When this bit is set, it configures the address filter to pass a frame if it matches either the perfect filtering or the hash filtering as set by the HMC or HUC bits When this bit is low and the HUC or HMC bit is set, the frame is passed only if it matches the Hash filter This bit is reserved _and RO_ if the Hash filter is not selected during core configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VTFE</name>
              <description>VLAN Tag Filter Enable When set, this bit enables the MAC to drop VLAN tagged frames that do not match the VLAN Tag comparison When reset, the MAC forwards all frames irrespective of the match status of the VLAN Tag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPFE</name>
              <description>Layer 3 and Layer 4 Filter Enable When set, this bit enables the MAC to drop frames that do not match the enabled Layer 3 and Layer 4 filters If Layer 3 or Layer 4 filters are not enabled for matching, this bit does not have any effect When reset, the MAC forwards all frames irrespective of the match status of the Layer 3 and Layer 4 fields If the Layer 3 and Layer 4 Filtering feature is not selected during core configuration, this bit is reserved _RO with default value_</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DNTU</name>
              <description>Drop nonTCP/UDP over IP Frames When set, this bit enables the MAC to drop the nonTCP or UDP over IP frames The MAC forward only those frames that are processed by the Layer 4 filter When reset, this bit enables the MAC to forward all nonTCP or UDP over IP frames If the Layer 3 and Layer 4 Filtering feature is not selected during core configuration, this bit is reserved _RO with default value_</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RA</name>
              <description>Receive All When this bit is set, the MAC Receiver module passes all received frames, irrespective of whether they pass the address filter or not, to the Application The result of the SA or DA filtering is updated _pass or fail_ in the corresponding bits in the Receive Status Word When this bit is reset, the Receiver module passes only those frames to the Application that pass the SA or DA address filter</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER2_HASHTABLEHIGHREGISTER</name>
          <description>Contains the higher 32 bits of the Multicast Hash table This register is present only when you select the 64bit Hash filter function in coreConsultant _See Table 79_</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HTH</name>
              <description>Hash Table High This field contains the upper 32 bits of the Hash table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER3_HASHTABLELOWREGISTER</name>
          <description>Contains the lower 32 bits of the Multicast Hash table This register is present only when you select the Hash filter function in coreConsultant _See Table 79_</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HTL</name>
              <description>Hash Table Low This field contains the lower 32 bits of the Hash table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER4_GMIIADDRESSREGISTER</name>
          <description>Controls the management cycles to an external PHY This register is present only when you select the Station Management _MDIO_ feature in coreConsultant _See Table 726_</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GB</name>
              <description>GMII Busy This bit should read logic 0 before writing to Register 4 and Register 5 During a PHY or RevMII register access, the software sets this bit to 1’b1 to indicate that a Read or Write access is in progress Register 5 is invalid until this bit is cleared by the MAC Therefore, Register 5 _GMII Data_ should be kept valid until the MAC clears this bit during a PHY Write operation Similarly for a read operation, the contents of Register 5 are not valid until this bit is cleared The subsequent read or write operation should happen only after the previous operation is complete Because there is no acknowledgment from the PHY to MAC after a read or write operation is completed, there is no change in the functionality of this bit even when the PHY is not present</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GW</name>
              <description>GMII Write When set, this bit indicates to the PHY or RevMII that this is a Write operation using the GMII Data register If this bit is not set, it indicates that this is a Read operation, that is, placing the data in the GMII Data register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CR</name>
              <description>CSR Clock Range The CSR Clock Range selection determines the frequency of the MDC clock according to the CSR clock frequency used in your design The CSR clock corresponding to different GMAC configurations is given in Table 92 on page 564 The suggested range of CSR clock frequency applicable for each value _when Bit[5] = 0_ ensures that the MDC clock is approximately between the frequency range 10 MHz25 MHz 0000: The CSR clock frequency is 60100 MHz and the MDC clock frequency is CSR clock/42 0001: The CSR clock frequency is 100150 MHz and the MDC clock frequency is CSR clock/62 0010: The CSR clock frequency is 2035 MHz and the MDC clock frequency is CSR clock/16 0011: The CSR clock frequency is 3560 MHz and the MDC clock frequency is CSR clock/26 0100: The CSR clock frequency is 150250 MHz and the MDC clock frequency is CSR clock/102 0101: The CSR clock frequency is 250300 MHz and the MDC clock is CSR clock/124 0110, 0111: Reserved When Bit 5 is set, you can achieve higher frequency of the MDC clock than the frequency limit of 25 MHz _specified in the IEEE Std 8023_ and program a clock divider of lower value For example, when CSR clock is of 100 MHz frequency and you program these bits as 1010, then the resultant MDC clock is of 125 MHz which is outside the limit of IEEE 8023 specified range Program the following values only if the interfacing chips support faster MDC clocks 1000: CSR clock/4 1001: CSR clock/6 1010: CSR clock/8 1011: CSR clock/10 1100: CSR clock/12 1101: CSR clock/14 1110: CSR clock/16 1111: CSR clock/18 These bits are not used for accessing RevMII These bits are readonly if the RevMII interface is selected as single PHY interface</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GR</name>
              <description>GMII Register These bits select the desired GMII register in the selected PHY device For RevMII, these bits select the desired CSR register in the RevMII Registers set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA</name>
              <description>Physical Layer Address This field indicates which of the 32 possible PHY devices are being accessed For RevMII, this field gives the PHY Address of the RevMII module</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER5_GMIIDATAREGISTER</name>
          <description>Contains the data to be written to or read from the PHY register This register is present only when you select the Station Management _MDIO_ feature in coreConsultant _See Table 726_</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GD</name>
              <description>GMII Data This field contains the 16bit data value read from the PHY or RevMII after a Management Read operation or the 16bit data value to be written to the PHY or RevMII before a Management Write operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER6_FLOWCONTROLREGISTER</name>
          <description>Controls the generation of control frames</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FCB_BPA</name>
              <description>Flow Control Busy or Backpressure Activate This bit initiates a Pause frame in the fullduplex mode and activates the backpressure function in the halfduplex mode if the TFE bit is set In the fullduplex mode, this bit should be read as 1'b0 before writing to the Flow Control register To initiate a Pause frame, the Application must set this bit to 1'b1 During a transfer of the Control Frame, this bit continues to be set to signify that a frame transmission is in progress After the completion of Pause frame transmission, the MAC resets this bit to 1'b0 The Flow Control register should not be written to until this bit is cleared In the halfduplex mode, when this bit is set _and TFE is set_, then backpressure is asserted by the MAC During backpressure, when the MAC receives a new frame, the transmitter starts sending a JAM pattern resulting in a collision This control register bit is logically ORed with the mti_flowctrl_i input signal for the backpressure function When the MAC is configured for the fullduplex mode, the BPA is automatically disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TFE</name>
              <description>Transmit Flow Control Enable In the fullduplex mode, when this bit is set, the MAC enables the flow control operation to transmit Pause frames When this bit is reset, the flow control operation in the MAC is disabled, and the MAC does not transmit any Pause frames In the halfduplex mode, when this bit is set, the MAC enables the backpressure operation When this bit is reset, the backpressure feature is disabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECEIVE_FLOW_CTRL_E</name>
              <description>Receive Flow Control Enable When this bit is set, the MAC decodes the received Pause frame and disables its transmitter for a specified _Pause_ time When this bit is reset, the decode function of the Pause frame is disabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UP</name>
              <description>Unicast Pause Frame Detect A pause frame is processed when it has the unique multicast address specified in the IEEE Std 8023 When this bit is set, the MAC can also detect Pause frames with unicast address of the station This unicast address should be as specified in the MAC Address0 High Register and MAC Address0 Low Register When this bit is reset, the MAC only detects Pause frames with unique multicast address Note: The MAC does not process a Pause frame if the multicast address of received frame is different from the unique multicast address</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLT</name>
              <description>Pause Low Threshold This field configures the threshold of the Pause timer at which the input flow control signal mti_flowctrl_i _or sbd_flowctrl_i_ is checked for automatic retransmission of the Pause frame The threshold values should be always less than the Pause Time configured in Bits[31:16] For example, if PT = 100H _256 slottimes_, and PLT = 01, then a second Pause frame is automatically transmitted if the mti_flowctrl_i signal is asserted at 228 _256  28_ slot times after the first Pause frame is transmitted The following list provides the threshold values for different values: 00: The threshold is Pause time minus 4 slot times _PT  4 slot times_ 01: The threshold is Pause time minus 28 slot times _PT  28 slot times_ 10: The threshold is Pause time minus 144 slot times _PT  144 slot times_ 11: The threshold is Pause time minus 256 slot times _PT  256 slot times_ The slot time is defined as the time taken to transmit 512 bits _64 bytes_ on the GMII or MII interface</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DZPQ</name>
              <description>Disable ZeroQuanta Pause When this bit is set, it disables the automatic generation of the ZeroQuanta Pause frames on the deassertion of the flowcontrol signal from the FIFO layer _MTL or external sideband flow control signal sbd_flowctrl_i/mti_flowctrl_i_ When this bit is reset, normal operation with automatic ZeroQuanta Pause frame generation is enabled</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PT</name>
              <description>Pause Time This field holds the value to be used in the Pause Time field in the transmit control frame If the Pause Time bits is configured to be doublesynchronized to the _G_MII clock domain, then consecutive writes to this register should be performed only after at least four clock cycles in the destination clock domain</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
