esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>REGISTER7_VLANTAGREGISTER</name>
          <description>Identifies IEEE 8021Q VLAN type frames</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VL</name>
              <description>VLAN Tag Identifier for Receive Frames This field contains the 8021Q VLAN tag to identify the VLAN frames and is compared to the 15th and 16th bytes of the frames being received for VLAN frames The following list describes the bits of this field: Bits [15:13]: User Priority Bit 12: Canonical Format Indicator _CFI_ or Drop Eligible Indicator _DEI_ Bits[11:0]: VLAN tag’s VLAN Identifier _VID_ field When the ETV bit is set, only the VID _Bits[11:0]_ is used for comparison If VL _VL[11:0] if ETV is set_ is all zeros, the MAC does not check the fifteenth and 16th bytes for VLAN tag comparison, and declares all frames with a Type field value of 0x8100 or 0x88a8 as VLAN frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETV</name>
              <description>Enable 12-Bit VLAN Tag Comparison</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VTIM</name>
              <description>VLAN Tag Inverse Match Enable When set, this bit enables the VLAN Tag inverse matching The frames that do not have matching VLAN Tag are marked as matched When reset, this bit enables the VLAN Tag perfect matching The frames with matched VLAN Tag are marked as matched</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESVL</name>
              <description>Enable SVLAN When this bit is set, the MAC transmitter and receiver also consider the SVLAN _Type = 0x88A8_ frames as valid VLAN tagged frames</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VTHM</name>
              <description>VLAN Tag Hash Table Match Enable When set, the most significant four bits of the VLAN tag’s CRC are used to index the content of Register 354 _VLAN Hash Table Register_ A value of 1 in the VLAN Hash Table register, corresponding to the index, indicates that the frame matched the VLAN hash table When Bit 16 _ETV_ is set, the CRC of the 12bit VLAN Identifier _VID_ is used for comparison whereas when ETV is reset, the CRC of the 16bit VLAN tag is used for comparison When reset, the VLAN Hash Match operation is not performed If the VLAN Hash feature is not enabled during core configuration, this bit is reserved _RO with default value_</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER8_VERSIONREGISTER</name>
          <description>Identifies the version of the Core</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x37</resetValue>
          <fields>
            <field>
              <name>SNPSVER</name>
              <description>Synopsysdefined Version _37_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USERVER</name>
              <description>Userdefined Version _configured with coreConsultant_</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER9_DEBUGREGISTER</name>
          <description>Gives the status of various internal blocks for debugging</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RPESTS</name>
              <description>MAC GMII or MII Receive Protocol Engine Status When high, this bit indicates that the MAC GMII or MII receive protocol engine is actively receiving data and not in IDLE state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFCFCSTS</name>
              <description>MAC Receive Frame FIFO Controller Status When high, this field indicates the active state of the small FIFO Read and Write controllers of the MAC Receive Frame Controller Module RFCFCSTS[1] represents the status of small FIFO Read controller RFCFCSTS[0] represents the status of small FIFO Write controller</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RWCSTS</name>
              <description>MTL Rx FIFO Write Controller Active Status When high, this bit indicates that the MTL Rx FIFO Write Controller is active and is transferring a received frame to the FIFO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RRCSTS</name>
              <description>MTL RxFIFO Read Controller State This field gives the state of the Rx FIFO read Controller: 00: IDLE state 01: Reading frame data 10: Reading frame status _or timestamp_ 11: Flushing the frame data and status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFSTS</name>
              <description>MTL RxFIFO FillLevel Status This field gives the status of the filllevel of the Rx FIFO: 00: Rx FIFO Empty 01: Rx FIFO filllevel below flowcontrol deactivate threshold 10: Rx FIFO filllevel above flowcontrol activate threshold 11: Rx FIFO Full</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TPESTS</name>
              <description>MAC GMII or MII Transmit Protocol Engine Status When high, this bit indicates that the MAC GMII or MII transmit protocol engine is actively transmitting data and is not in the IDLE state</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TFCSTS</name>
              <description>MAC Transmit Frame Controller Status This field indicates the state of the MAC Transmit Frame Controller module: 00: IDLE state 01: Waiting for status of previous frame or IFG or backoff period to be over 10: Generating and transmitting a Pause frame _in the fullduplex mode_ 11: Transferring input frame for transmission</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXPAUSED</name>
              <description>MAC Transmitter in Pause When high, this bit indicates that the MAC transmitter is in the Pause condition _in the fullduplexonly mode_ and hence does not schedule any frame for transmission</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRCSTS</name>
              <description>MTL Tx FIFO Read Controller Status This field indicates the state of the Tx FIFO Read Controller: 00: IDLE state 01: READ state _transferring data to the MAC transmitter_ 10: Waiting for TxStatus from the MAC transmitter 11: Writing the received TxStatus or flushing the Tx FIFO</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TWCSTS</name>
              <description>MTL Tx FIFO Write Controller Status When high, this bit indicates that the MTL Tx FIFO Write Controller is active and is transferring data to the Tx FIFO</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFSTS</name>
              <description>MTL Tx FIFO Not Empty Status When high, this bit indicates that the MTL Tx FIFO is not empty and some data is left for transmission</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXSTSFSTS</name>
              <description>MTL TxStatus FIFO Full Status When high, this bit indicates that the MTL TxStatus FIFO is full Therefore, the MTL cannot accept any more frames for transmission This bit is reserved in the GMACAHB and GMACDMA configurations</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER10_REMOTEWAKEUPFRAMEFILTERREGISTER</name>
          <description>Remote Wake-Up Frame Filter Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WKUPFRM_FILTER</name>
              <description>This is the address through which the application writes or reads the remote wake-up frame filter registers.The reg_wkupfrm_filter register is a pointer to eight reg_wkupfrm_filter registers.The reg_wkupfrm_filter register is loaded by sequentially loading the eight register values.Eight sequential writes to this address(0x0028)write all reg_wkupfrm_filter registers.Similarly, eight sequential reads from this address(0x0028) read all reg_wkupfrm_filter registers.
This register is present only when you select the PMT module Remote Wake-Up feature in coreConsultant.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER11_PMTCONTROLANDSTATUSREGISTER</name>
          <description>PMT Control and Status Register. This register is present only when you select the PMT module in coreConsultant.</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWRDWN</name>
              <description>Power Down
When set, the MAC receiver drops all received frames until it receives the expected magic packet or remote wake-up frame. This bit is then self-cleared and the power-down mode is disabled. The Software can also clear this bit before the expected magic packet or remote wake-up frame is received. The frames, received by MAC after this bit is cleared, are forwarded to the application. This bit must only be set when the Magic Packet Enable, Global Unicast, or Remote Wake-Up Frame Enable bit is set high.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MGKPKTEN</name>
              <description>Magic Packet Enable
When set, enables generation of a power management event because of magic packet reception.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RWKPKTEN</name>
              <description>Remote Wake-Up Frame Enable
When set, enables generation of a power management event because of remote wake-up frame reception.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MGKPRCVD</name>
              <description>Magic Packet Received
When set,this bit indicates that the power management event is generated because of the reception of a magic packet. This bit is cleared by Read into this register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RWKPRCVD</name>
              <description>Remote Wake-Up Frame Received
When set, this bit indicates the power management event is generated because of the reception of a remote wake-up frame. This bit is cleared by a Read into this register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLBLUCAST</name>
              <description>Global Unicast.
When set, enables any unicast packet filtered by the MAX(DAF) address recognition to be a remote wake-up frame.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RWKPTR</name>
              <description>Remote Wake-up FIFO Pointer.
This field gives the current value(0 to 31) of the Remote Wake-up Frame filter register pointer. When the value of this pointer is erual to 7, 15, 23 or 31, the contents of the Remote Wake-up Frame Filter Register are transferred to the clk_rx_i domain when a write occurs to that register.
The maximum value of the pointer is 7, 15, 23 and 31 respectively depending on the number of Remote Wakeup Filters selected during configuration.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RWKFILTRST</name>
              <description>Remote Wake-Up Frame Filter Register Pointer Reset.
When this bit is set, it resets the remote wake-up frame filter register pointer to 3'b000. It is automatically cleared after 1 clock cycle.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER12_LPICONTROLANDSTATUSREGISTER</name>
          <description>Controls the Low Power Idle _LPI_ operations and provides the LPI status of the core This register is present only when you select the Energy Efficient Ethernet feature in coreConsultant</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TLPIEN</name>
              <description>Transmit LPI Entry When set, this bit indicates that the MAC Transmitter has entered the LPI state because of the setting of the LPIEN bit This bit is cleared by a read into this register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TLPIEX</name>
              <description>Transmit LPI Exit When set, this bit indicates that the MAC transmitter has exited the LPI state after the user has cleared the LPIEN bit and the LPI TW Timer has expired This bit is cleared by a read into this register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLPIEN</name>
              <description>Receive LPI Entry When set, this bit indicates that the MAC Receiver has received an LPI pattern and entered the LPI state This bit is cleared by a read into this register Note: This bit may not get set if the MAC stops receiving the LPI pattern for a very short duration, such as, less than 3 clock cycles of CSR clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLPIEX</name>
              <description>Receive LPI Exit When set, this bit indicates that the MAC Receiver has stopped receiving the LPI pattern on the GMII or MII interface, exited the LPI state, and resumed the normal reception This bit is cleared by a read into this register Note: This bit may not get set if the MAC stops receiving the LPI pattern for a very short duration, such as, less than 3 clock cycles of CSR clock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TLPIST</name>
              <description>Transmit LPI State When set, this bit indicates that the MAC is transmitting the LPI pattern on the GMII or MII interface</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RLPIST</name>
              <description>Receive LPI State When set, this bit indicates that the MAC is receiving the LPI pattern on the GMII or MII interface</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPIEN</name>
              <description>LPI Enable When set, this bit instructs the MAC Transmitter to enter the LPI state When reset, this bit instructs the MAC to exit the LPI state and resume normal transmission This bit is cleared when the LPITXA bit is set and the MAC exits the LPI state because of the arrival of a new packet for transmission</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLS</name>
              <description>PHY Link Status This bit indicates the link status of the PHY The MAC Transmitter asserts the LPI pattern only when the link status is up _okay_ at least for the time indicated by the LPI LS TIMER When set, the link is considered to be okay _up_ and when reset, the link is considered to be down</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLSEN</name>
              <description>PHY Link Status Enable This bit enables the link status received on the RGMII, SGMII, or SMII receive paths to be used for activating the LPI LS TIMER When set, the MAC uses the linkstatus bits of Register 54 _SGMII/RGMII/SMII Control and Status Register_ and Bit 17 _PLS_ for the LPI LS Timer trigger When cleared, the MAC ignores the linkstatus bits of Register 54 and takes only the PLS bit This bit is RO and reserved if you have not selected the RGMII, SGMII, or SMII PHY interface</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPITXA</name>
              <description>LPI TX Automate This bit controls the behavior of the MAC when it is entering or coming out of the LPI mode on the transmit side This bit is not functional in the GMAC CORE configuration in which the Tx clock gating is done during the LPI mode If the LPITXA and LPIEN bits are set to 1, the MAC enters the LPI mode only after all outstanding frames _in the core_ and pending frames _in the application interface_ have been transmitted The MAC comes out of the LPI mode when the application sends any frame for transmission or the application issues a TX FIFO Flush command In addition, the MAC automatically clears the LPIEN bit when it exits the LPI state If TX FIFO Flush is set in Bit 20 of Register 6 _Operation Mode Register_, when the MAC is in the LPI mode, the MAC exits the LPI mode When this bit is 0, the LPIEN bit directly controls behavior of the MAC when it is entering or coming out of the LPI mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER13_LPITIMERSCONTROLREGISTER</name>
          <description>Controls the timeout values in LPI states This register is present only when you select the Energy Efficient Ethernet feature in coreConsultant</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x3e80000</resetValue>
          <fields>
            <field>
              <name>TWT</name>
              <description>LPI TW TIMER This field specifies the minimum time _in microseconds_ for which the MAC waits after it stops transmitting the LPI pattern to the PHY and before it resumes the normal transmission The TLPIEX status bit is set after the expiry of this timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LST</name>
              <description>LPI LS TIMER This field specifies the minimum time _in milliseconds_ for which the link status from the PHY should be up _OKAY_ before the LPI pattern can be transmitted to the PHY The MAC does not transmit the LPI pattern even when the LPIEN bit is set unless the LPI LS Timer reaches the programmed terminal count The default value of the LPI LS Timer is 1000 _1 sec_ as defined in the IEEE standard</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
