esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>REGISTER14_INTERRUPTSTATUSREGISTER</name>
          <description>Contains the interrupt status</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RGSMIIIS</name>
              <description>RGMII or SMII Interrupt Status This bit is set because of any change in value of the Link Status of RGMII or SMII interface _Bit 3 in Register 54 _SGMII/RGMII/SMII Control and Status Register__ This bit is cleared when you perform a read operation on the SGMII/RGMII/SMII Control and Status Register This bit is valid only when you select the optional RGMII or SMII PHY interface during core configuration and operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCSLCHGIS</name>
              <description>PCS Link Status Changed This bit is set because of any change in Link Status in the TBI, RTBI, or SGMII PHY interface _Bit 2 in Register 49 _AN Status Register__ This bit is cleared when you perform a read operation on the AN Status register This bit is valid only when you select the optional TBI, RTBI, or SGMII PHY interface during core configuration and operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCSANCIS</name>
              <description>PCS AutoNegotiation Complete This bit is set when the Autonegotiation is completed in the TBI, RTBI, or SGMII PHY interface _Bit 5 in Register 49 _AN Status Register__ This bit is cleared when you perform a read operation to the AN Status register This bit is valid only when you select the optional TBI, RTBI, or SGMII PHY interface during core configuration and operation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMTIS</name>
              <description>PMT Interrupt Status This bit is set when a magic packet or remote wakeup frame is received in the powerdown mode _see Bits 5 and 6 in the PMT Control and Status Register_ This bit is cleared when both Bits[6:5] are cleared because of a read operation to the PMT Control and Status register This bit is valid only when you select the optional PMT module during core configuration</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMCIS</name>
              <description>MMC Interrupt Status This bit is set high when any of the Bits [7:5] is set high and cleared only when all of these bits are low This bit is valid only when you select the optional MMC module during core configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMCRXIS</name>
              <description>MMC Receive Interrupt Status This bit is set high when an interrupt is generated in the MMC Receive Interrupt Register This bit is cleared when all the bits in this interrupt register are cleared This bit is valid only when you select the optional MMC module during core configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMCTXIS</name>
              <description>MMC Transmit Interrupt Status This bit is set high when an interrupt is generated in the MMC Transmit Interrupt Register This bit is cleared when all the bits in this interrupt register are cleared This bit is valid only when you select the optional MMC module during core configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMCRXIPIS</name>
              <description>MMC Receive Checksum Offload Interrupt Status This bit is set high when an interrupt is generated in the MMC Receive Checksum Offload Interrupt Register This bit is cleared when all the bits in this interrupt register are cleared This bit is valid only when you select the optional MMC module and Checksum Offload Engine _Type 2_ during core configuration</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSIS</name>
              <description>Timestamp Interrupt Status When the Advanced Timestamp feature is enabled, this bit is set when R_SS_RC any of the following conditions is true: The system time value equals or exceeds the value specified in the Target Time High and Low registers There is an overflow in the seconds register The Auxiliary snapshot trigger is asserted This bit is cleared on reading Bit 0 of Register 458 _Timestamp Status Register_ If default Timestamping is enabled, when set, this bit indicates that the system time value is equal to or exceeds the value specified in the Target Time registers In this mode, this bit is cleared after the completion of the read of this bit In all other modes, this bit is reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPIIS</name>
              <description>LPI Interrupt Status When the Energy Efficient Ethernet feature is enabled, this bit is set for any LPI state entry or exit in the MAC Transmitter or Receiver This bit is cleared on reading Bit 0 of Register 12 _LPI Control and Status Register_ In all other modes, this bit is reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIIS</name>
              <description>GPI Interrupt Status When the GPIO feature is enabled, this bit is set when any active event _LL or LH_ occurs on the GPIS field _Bits [3:0]_ of Register 56 _General Purpose IO Register_ and the corresponding GPIE bit is enabled This bit is cleared on reading lane 0 _GPIS_ of Register 56 _General Purpose IO Register_ When the GPIO feature is not enabled, this bit is reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER15_INTERRUPTMASKREGISTER</name>
          <description>Contains the masks for generating the interrupts</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RGSMIIIM</name>
              <description>RGMII or SMII Interrupt Mask When set, this bit disables the assertion of the interrupt signal because of the setting of the RGMII or SMII Interrupt Status bit in Register 14 _Interrupt Status Register_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCSLCHGIM</name>
              <description>PCS Link Status Interrupt Mask When set, this bit disables the assertion of the interrupt signal because of the setting of the PCS Linkstatus changed bit in Register 14 _Interrupt Status Register_</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCSANCIM</name>
              <description>PCS AN Completion Interrupt Mask When set, this bit disables the assertion of the interrupt signal because of the setting of PCS Autonegotiation complete bit in Register 14 _Interrupt Status Register_</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMTIM</name>
              <description>PMT Interrupt Mask When set, this bit disables the assertion of the interrupt signal because of the setting of PMT Interrupt Status bit in Register 14 _Interrupt Status Register_</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSIM</name>
              <description>Timestamp Interrupt Mask When set, this bit disables the assertion of the interrupt signal because of the setting of Timestamp Interrupt Status bit in Register 14 _Interrupt Status Register_ This bit is valid only when IEEE1588 timestamping is enabled In all other modes, this bit is reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPIIM</name>
              <description>LPI Interrupt Mask When set, this bit disables the assertion of the interrupt signal because of the setting of the LPI Interrupt Status bit in Register 14 _Interrupt Status Register_ This bit is valid only when you select the Energy Efficient Ethernet feature during core configuration In all other modes, this bit is reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER16_MACADDRESS0HIGHREGISTER</name>
          <description>Contains the higher 16 bits of the first MAC address</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x8000ffff</resetValue>
          <fields>
            <field>
              <name>ADDRHI_0</name>
              <description>MAC Address0 [47:32] This field contains the upper 16 bits _47:32_ of the first 6byte MAC address The MAC uses this field for filtering the received frames and inserting the MAC address in the Transmit Flow Control _Pause_ Frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_0</name>
              <description>Address Enable This bit is always set to 1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER17_MACADDRESS0LOWREGISTER</name>
          <description>Contains the lower 32 bits of the first MAC address</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ADDRLO_0</name>
              <description>MAC Address0 [31:0] This field contains the lower 32 bits of the first 6byte MAC address This is used by the MAC for filtering the received frames and inserting the MAC address in the Transmit Flow Control _Pause_ Frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER18_MACADDRESS1HIGHREGISTER</name>
          <description>Contains the higher 16 bits of the second MAC address This register is present only when Enable MAC Address1 is selected in coreConsultant _See Table 78_</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0xffff</resetValue>
          <fields>
            <field>
              <name>ADDRHI_1</name>
              <description>MAC Address1 [47:32] This field contains the upper 16 bits _47:32_ of the second 6byte MAC address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBC_1</name>
              <description>Mask Byte Control These bits are mask control bits for comparison of each of the MAC Address bytes When set high, the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers Each bit controls the masking of the bytes as follows: Bit 29: Register 18[15:8] Bit 28: Register 18[7:0] Bit 27: Register 19[31:24]  Bit 24: Register 19[7:0] You can filter a group of addresses _known as group address filtering_ by masking one or more bytes of the address</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SA_1</name>
              <description>Source Address When this bit is set, the MAC Address1[47:0] is used to compare with the SA fields of the received frame When this bit is reset, the MAC Address1[47:0] is used to compare with the DA fields of the received frame</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_1</name>
              <description>Address Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER19_MACADDRESS1LOWREGISTER</name>
          <description>Contains the lower 32 bits of the second MAC address This register is present only when Enable MAC Address1 is selected in coreConsultant _See Table 78_</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ADDRLO_1</name>
              <description>MAC Address1 [31:0] This field contains the lower 32 bits of the second 6byte MAC address The content of this field is undefined until loaded by the Application after the initialization process</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACADDRESS2HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHETHIRDMACADDRESS</name>
          <description>Reserved</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0xffff</resetValue>
          <fields>
            <field>
              <name>ADDRHI_2</name>
              <description>This register is present only when Enable MAC Address2 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBC_2</name>
              <description>This register is present only when Enable MAC Address2 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SA_2</name>
              <description>This register is present only when Enable MAC Address2 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_2</name>
              <description>This register is present only when Enable MAC Address2 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACADDRESS2LOWREGISTERCONTAINSTHELOWER32BITSOFTHETHIRDMACADDRESS</name>
          <description>Reserved</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ADDRLO_2</name>
              <description>This register is present only when Enable MAC Address2 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACADDRESS3HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHEFOURTHMACADDRESS</name>
          <description>Reserved</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0xffff</resetValue>
          <fields>
            <field>
              <name>ADDRHI_3</name>
              <description>This register is present only when Enable MAC Address3 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBC_3</name>
              <description>This register is present only when Enable MAC Address3 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SA_3</name>
              <description>This register is present only when Enable MAC Address3 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_3</name>
              <description>This register is present only when Enable MAC Address3 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACADDRESS3LOWREGISTERCONTAINSTHELOWER32BITSOFTHEFOURTHMACADDRESS</name>
          <description>Reserved</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ADDRLO_3</name>
              <description>This register is present only when Enable MAC Address3 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACADDRESS4HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHEFIFTHMACADDRESS</name>
          <description>Reserved</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0xffff</resetValue>
          <fields>
            <field>
              <name>ADDRHI_4</name>
              <description>This register is present only when Enable MAC Address4 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBC_4</name>
              <description>This register is present only when Enable MAC Address4 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SA_4</name>
              <description>This register is present only when Enable MAC Address4 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_4</name>
              <description>This register is present only when Enable MAC Address4 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACADDRESS4LOWREGISTERCONTAINSTHELOWER32BITSOFTHEFIFTHMACADDRESS</name>
          <description>Reserved</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ADDRLO_4</name>
              <description>This register is present only when Enable MAC Address4 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACADDRESS5HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHESIXTHMACADDRESS</name>
          <description>Reserved</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0xffff</resetValue>
          <fields>
            <field>
              <name>ADDRHI_5</name>
              <description>This register is present only when Enable MAC Address5 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBC_5</name>
              <description>This register is present only when Enable MAC Address5 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SA_5</name>
              <description>This register is present only when Enable MAC Address5 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_5</name>
              <description>This register is present only when Enable MAC Address5 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
