esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>MACADDRESS5LOWREGISTERCONTAINSTHELOWER32BITSOFTHESIXTHMACADDRESS</name>
          <description>Reserved</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ADDRLO_5</name>
              <description>This register is present only when Enable MAC Address5 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACADDRESS6HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHESEVENTHMACADDRESS</name>
          <description>Reserved</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0xffff</resetValue>
          <fields>
            <field>
              <name>ADDRHI_6</name>
              <description>This register is present only when Enable MAC Address6 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBC_6</name>
              <description>This register is present only when Enable MAC Address6 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SA_6</name>
              <description>This register is present only when Enable MAC Address6 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_6</name>
              <description>This register is present only when Enable MAC Address6 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACADDRESS6LOWREGISTERCONTAINSTHELOWER32BITSOFTHESEVENTHMACADDRESS</name>
          <description>Reserved</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ADDRLO_6</name>
              <description>This register is present only when Enable MAC Address6 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACADDRESS7HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHEEIGHTHMACADDRESS</name>
          <description>Reserved</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0xffff</resetValue>
          <fields>
            <field>
              <name>ADDRHI_7</name>
              <description>This register is present only when Enable MAC Address7 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBC_7</name>
              <description>This register is present only when Enable MAC Address7 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SA_7</name>
              <description>This register is present only when Enable MAC Address7 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_7</name>
              <description>This register is present only when Enable MAC Address7 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACADDRESS7LOWREGISTERCONTAINSTHELOWER32BITSOFTHEEIGHTHMACADDRESS</name>
          <description>Reserved</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ADDRLO_7</name>
              <description>This register is present only when Enable MAC Address7 is selected in coreConsultant _See Table 78_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER48_ANCONTROLREGISTER</name>
          <description>Enables and/or restarts autonegotiation This register also enables the Physical Coding Sublayer _PCS_ loopback This register is present only when you select the TBI, RTBI, or SGMII interface in coreConsultant</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RAN</name>
              <description>Restart AutoNegotiation When set, this bit causes autonegotiation to restart if Bit 12 _ANE_ is set This bit is selfclearing after autonegotiation starts This bit should be cleared for normal operation</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANE</name>
              <description>AutoNegotiation Enable When set, this bit enables the MAC to perform autonegotiation with the link partner Clearing this bit disables the autonegotiation</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELE</name>
              <description>External Loopback Enable When set, this bit causes the PHY to loopback the transmit data into the receive path The pcs_ewrap_o signal is asserted high when this bit is set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECD</name>
              <description>Enable Comma Detect When set, this bit enables the PHY for comma detection and word resynchronization This bit controls the pcs_en_cdet_o signal on the TBI, RTBI, or SGMII interface</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LR</name>
              <description>Lock to Reference When set, this bit enables the PHY to lock its PLL to the 125 MHz reference clock This bit controls the pcs_lck_ref_o signal on the TBI, RTBI, or SGMII interface</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SGMRAL</name>
              <description>SGMII RAL Control When set, this bit forces the SGMII RAL block to operate in the speed configured in the Speed and Port Select bits of the MAC Configuration register This is useful when the SGMII interface is used in a direct MAC to MAC connection _without a PHY_ and any MAC must reconfigure the speed When reset, the SGMII RAL block operates according to the link speed status received on SGMII _from the PHY_ This bit is reserved _and RO_ if the SGMII PHY interface is not selected during core configuration</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER49_ANSTATUSREGISTER</name>
          <description>Indicates the link and autonegotiation status This register is present only when you select the TBI, RTBI, or SGMII interface in coreConsultant</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0x108</resetValue>
          <fields>
            <field>
              <name>LS</name>
              <description>Link Status This bit indicates whether the data channel _link_ is up or down For the TBI, RTBI or SGMII interfaces, if ANEG is going on, data cannot be transferred across the link and hence the link is given as down</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANA</name>
              <description>AutoNegotiation Ability This bit is always high because the MAC supports auto negotiation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANC</name>
              <description>AutoNegotiation Complete When set, this bit indicates that the autonegotiation process is complete This bit is cleared when autonegotiation is reinitiated</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ES</name>
              <description>Extended Status This bit is tied to high if the TBI or RTBI interface is selected during core configuration indicating that the MAC supports extended status information in Register 53 _TBI Extended  Status Register_ This bit is tied to low if the SGMII interface is selected and the TBI or RTBI interface is not selected during core configuration indicating that Register 53 is not present</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER50_AUTONEGOTIATIONADVERTISEMENTREGISTER</name>
          <description>This register is configured before autonegotiation begins It contains the advertised ability of the MAC This register is present only when you select the TBI or RTBI interface in coreConsultant</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0x1e0</resetValue>
          <fields>
            <field>
              <name>FD</name>
              <description>FullDuplex When set high, this bit indicates that the MAC supports the fullduplex mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HD</name>
              <description>HalfDuplex When set high, this bit indicates that the MAC supports the halfduplex mode This bit is always low _and RO_ when the MAC is configured for the fullduplexonly mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSE</name>
              <description>Pause Encoding These bits provide an encoding for the Pause bits, indicating that the MAC is capable of configuring the Pause function as defined in IEEE 8023x The encoding of these bits is defined in IEEE 8023z, Section 37214</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFE</name>
              <description>Remote Fault Encoding These bits provide a remote fault encoding, indicating to a link partner that a fault or error condition has occurred The encoding of these bits is defined in IEEE 8023z, Section 37215</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NP</name>
              <description>Next Page Support This bit is always low because the MAC does not support the next page</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER51_AUTONEGOTIATIONLINKPARTNERABILITYREGISTER</name>
          <description>Contains the advertised ability of the link partner Its value is valid after successful completion of autonegotiation or when a new base page has been received _indicated in the AutoNegotiation Expansion Register_ This register is present only when you select the TBI or RTBI interface in coreConsultant</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FD_ABILITY</name>
              <description>FullDuplex When set, this bit indicates that the link partner has the ability to operate in the full duplex mode When cleared, this bit indicates that the link partner does not have the ability to operate in the fullduplex mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HD_ABILITY</name>
              <description>HalfDuplex When set, this bit indicates that the link partner has the ability to operate in the halfduplex mode When cleared, this bit indicates that the link partner does not have the ability to operate in the halfduplex mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSE_ABILITY</name>
              <description>Pause Encoding These bits provide an encoding for the Pause bits, indicating that the link partner's capability of configuring the Pause function as defined in the IEEE 8023x specification The encoding of these bits is defined in IEEE 8023z, Section 37214</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFE_ABILITY</name>
              <description>Remote Fault Encoding These bits provide a remote fault encoding, indicating a fault or error condition of the link partner The encoding of these bits is defined in IEEE 8023z, Section 37215</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK</name>
              <description>Acknowledge When set, the autonegotiation function uses this bit to indicate that the link partner has successfully received the base page of the MAC When cleared, it indicates that the link partner did not successfully receive the base page of the MAC</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NO</name>
              <description>Next Page Support When set, this bit indicates that more next page information is available When cleared, this bit indicates that next page exchange is not desired</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER52_AUTONEGOTIATIONEXPANSIONREGISTER</name>
          <description>Indicates whether a new base page has been received from the link partner This register is present only when you select the TBI or RTBI interface in coreConsultant</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NPR</name>
              <description>New Page Received When set, this bit indicates that the MAC has received a new page This bit is cleared when read</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPA</name>
              <description>Next Page Ability This bit is always low because the MAC does not support the next page function</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER53_TBIEXTENDEDSTATUSREGISTER</name>
          <description>Indicates all modes of operation of the MAC This register is present only when you select the TBI or RTBI interface in coreConsultant</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0xc000</resetValue>
          <fields>
            <field>
              <name>GHD</name>
              <description>1000BASEX HalfDuplex Capable This bit indicates that the MAC is able to perform the halfduplex and 1000BASEX operations This bit is always low when the MAC is configured for the fullduplexonly operation during core configuration</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GFD</name>
              <description>1000BASEX FullDuplex Capable This bit indicates that the MAC is able to perform the fullduplex and 1000BASEX operations</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER54_SGMII_RGMII_SMIICONTROLANDSTATUSREGISTER</name>
          <description>Indicates the status signals received from the PHY through the SGMII, RGMII, or SMII interface This register is present only when you select the SGMII, RGMII, or SMII interface in coreConsultant</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>LNKMOD</name>
              <description>Link Mode This bit indicates the current mode of operation of the link: 1’b0: Halfduplex mode 1’b1: Fullduplex mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LNKSPEED</name>
              <description>Link Speed</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LNKSTS</name>
              <description>Link Status This bit indicates whether the link between the local PHY and the remote PHY is up or down It gives the status of the link between the SGMII of MAC and the SGMII of the local PHY The status bits are received from the local PHY during ANEG betweent he MAC and PHY on the SGMII link</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JABTO</name>
              <description>Jabber Timeout This bit indicates whether there is jabber timeout error _1'b1_ in the received frame This bit is reserved when the MAC is configured for the SGMII or RGMII PHY interface</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FALSCARDET</name>
              <description>False Carrier Detected This bit indicates whether the SMII PHY detected false carrier _1'b1_ This bit is reserved when the MAC is configured for the SGMII or RGMII PHY interface</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMIDRXS</name>
              <description>Delay SMII RX Data Sampling with respect to the SMII SYNC Signal When set, the first bit of the SMII RX data is sampled one cycle after the SMII SYNC signal When reset, the first bit of the SMII RX data is sampled along with the SMII SYNC signal If the SMII PHY Interface with source synchronous mode is selected during core configuration, this bit is reserved _RO with default value_</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER55_WATCHDOGTIMEOUTREGISTER</name>
          <description>Controls the watchdog timeout for received frames</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WTO</name>
              <description>Watchdog Timeout When Bit 16 _PWE_ is set and Bit 23 _WD_ of Register 0 _MAC Configuration Register_ is reset, this field is used as watchdog timeout for a received frame If the length of a received frame exceeds the value of this field, such frame is terminated and declared as an error frame Note: When Bit 16 _PWE_ is set, the value in this field should be more than 1,522 _0x05F2_ Otherwise, the IEEE Std 8023specified valid tagged frames are declared as error frames and are dropped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWE</name>
              <description>Programmable Watchdog Enable When this bit is set and Bit 23 _WD_ of Register 0 _MAC Configuration Register_ is reset, the WTO field _Bits[13:0]_ is used as watchdog timeout for a received frame When this bit is cleared, the watchdog timeout for a received frame is controlled by the setting of Bit 23 _WD_ and Bit 20 _JE_ in Register 0 _MAC Configuration Register_</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
