esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>REGISTER56_GENERALPURPOSEIOREGISTER</name>
          <description>Provides the control to drive up to 4 bits of output ports _GPO_ and also provides the status of up to 4 input ports _GPIS_</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIS</name>
              <description>General Purpose Input Status This field gives the status of the signals connected to the gpi_i input ports This field is of the following types based on the setting of the corresponding GPIT field of this register: Latchedlow _LL_: This field is cleared when the corresponding gpi_i input becomes low This field remains low until the host reads this field After this, this field reflects the current value of the gpi_i input Latchedhigh _LH_: This field is set when the corresponding gpi_i input becomes high This field remains high until the host reads this field After this, this field reflects the current value of the gpi_i input The number of bits available in this field depend on the GP Input Signal Width option Other bits are not used _reserved and always reset_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPO</name>
              <description>General Purpose Output When this bit is set, it directly drives the gpo_o output ports When this bit is reset, it does not directly drive the gpo_o output ports The number of bits available in this field depend on the GP Output Signal Width option Other bits are not used _reserved and always reset_</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIE</name>
              <description>GPI Interrupt Enable When this bit is set and the programmed event _LL or LH_ occurs on the corresponding GPIS bit, Bit 11 _GPIIS_ of Register 14 _Interrupt Status Register_ is set Accordingly, the interrupt is generated on the mci_intr_o or sbd_intr_o The GPIIS bit is cleared when the host reads the Bits[7:0] of this register When reset, Bit 11 _GPIIS_ of Register 14 _Interrupt Status Register_ is not set when any event occurs on the corresponding GPIS bits The number of bits available in this field depend on the GP Input Signal Width option Other bits are not used _reserved and always reset_</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIT</name>
              <description>GPI Type When set, this bit indicates that the corresponding GPIS is of latchedlow _LL_ type When reset, this bit indicates that the corresponding GPIS is of latchedhigh _LH_ type The number of bits available in this field depend on the GP Input Signal Width option Other bits are not used _reserved and always reset_</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER256_LAYER3ANDLAYER4CONTROLREGISTER0</name>
          <description>Controls the operations of the Layer 3 and Layer 4 frame filtering</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L3PEN0</name>
              <description>Layer 3 Protocol Enable When set, this bit indicates that the Layer 3 IP Source or Destination Address matching is enabled for the IPv6 frames When reset, this bit indicates that the Layer 3 IP Source or Destination Address matching is enabled for the IPv4 frames The Layer 3 matching is done only when either L3SAM0 or L3DAM0 bit is set high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L3SAM0</name>
              <description>Layer 3 IP SA Match Enable When set, this bit indicates that the Layer 3 IP Source Address field is enabled for matching When reset, the MAC ignores the Layer 3 IP Source Address field for matching Note: When Bit 0 _L3PEN0_ is set, you should set either this bit or Bit 4 _L3DAM0_ because either IPv6 SA or DA can be checked for filtering</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L3SAIM0</name>
              <description>Layer 3 IP SA Inverse Match Enable When set, this bit indicates that the Layer 3 IP Source Address field is enabled for inverse matching When reset, this bit indicates that the Layer 3 IP Source Address field is enabled for perfect matching This bit is valid and applicable only when Bit 2 _L3SAM0_ is set high</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L3DAM0</name>
              <description>Layer 3 IP DA Match Enable When set, this bit indicates that Layer 3 IP Destination Address field is enabled for matching When reset, the MAC ignores the Layer 3 IP Destination Address field for matching Note: When Bit 0 _L3PEN0_ is set, you should set either this bit or Bit 2 _L3SAM0_ because either IPv6 DA or SA can be checked for filtering</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L3DAIM0</name>
              <description>Layer 3 IP DA Inverse Match Enable When set, this bit indicates that the Layer 3 IP Destination Address field is enabled for inverse matching When reset, this bit indicates that the Layer 3 IP Destination Address field is enabled for perfect matching This bit is valid and applicable only when Bit 4 _L3DAM0_ is set high</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L3HSBM0</name>
              <description>Layer 3 IP SA Higher Bits Match IPv4 Frames: This field contains the number of lower bits of IP Source Address that are masked for matching in the IPv4 frames The following list describes the values of this field: 0: No bits are masked 1: LSb[0] is masked 2: Two LSbs [1:0] are masked  31: All bits except MSb are masked IPv6 Frames: This field contains Bits [4:0] of the field that indicates the number of higher bits of IP Source or Destination Address matched in the IPv6 frames This field is valid and applicable only if L3DAM0 or L3SAM0 is set high</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L3HDBM0</name>
              <description>Layer 3 IP DA Higher Bits Match IPv4 Frames: This field contains the number of higher bits of IP Destination Address that are matched in the IPv4 frames The following list describes the values of this field: 0: No bits are masked 1: LSb[0] is masked 2: Two LSbs [1:0] are masked  31: All bits except MSb are masked IPv6 Frames: Bits [12:11] of this field correspond to Bits [6:5] of L3HSBM0, which indicate the number of lower bits of IP Source or Destination Address that are masked in the IPv6 frames The following list describes the concatenated values of the L3HDBM0[1:0] and L3HSBM0 bits: 0: No bits are masked 1: LSb[0] is masked 2: Two LSbs [1:0] are masked … 127: All bits except MSb are masked This field is valid and applicable only if L3DAM0 or L3SAM0 is set high</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L4PEN0</name>
              <description>Layer 4 Protocol Enable When set, this bit indicates that the Source and Destination Port number fields for UDP frames are used for matching When reset, this bit indicates that the Source and Destination Port number fields for TCP frames are used for matching The Layer 4 matching is done only when either L4SPM0 or L4DPM0 bit is set high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L4SPM0</name>
              <description>Layer 4 Source Port Match Enable When set, this bit indicates that the Layer 4 Source Port number field is enabled for matching When reset, the MAC ignores the Layer 4 Source Port number field for matching</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L4SPIM0</name>
              <description>Layer 4 Source Port Inverse Match Enable When set, this bit indicates that the Layer 4 Source Port number field is enabled for inverse matching When reset, this bit indicates that the Layer 4 Source Port number field is enabled for perfect matching This bit is valid and applicable only when Bit 18 _L4SPM0_ is set high</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L4DPM0</name>
              <description>Layer 4 Destination Port Match Enable When set, this bit indicates that the Layer 4 Destination Port number field is enabled for matching When reset, the MAC ignores the Layer 4 Destination Port number field for matching</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L4DPIM0</name>
              <description>Layer 4 Destination Port Inverse Match Enable When set, this bit indicates that the Layer 4 Destination Port number field is enabled for inverse matching When reset, this bit indicates that the Layer 4 Destination Port number field is enabled for perfect matching This bit is valid and applicable only when Bit 20 _L4DPM0_ is set high</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER257_LAYER4ADDRESSREGISTER0</name>
          <description>Layer 4 Port number field It contains the 16bit Source and Destination Port numbers of the TCP or UDP frame</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L4SP0</name>
              <description>Layer 4 Source Port Number Field When Bit 16 _L4PEN0_ is reset and Bit 20 _L4DPM0_ is set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with the TCP Source Port Number field in the IPv4 or IPv6 frames When Bit 16 _L4PEN0_ and Bit 20 _L4DPM0_ are set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with the UDP Source Port Number field in the IPv4 or IPv6 frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L4DP0</name>
              <description>Layer 4 Destination Port Number Field When Bit 16 _L4PEN0_ is reset and Bit 20 _L4DPM0_ is set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with the TCP Destination Port Number field in the IPv4 or IPv6 frames When Bit 16 _L4PEN0_ and Bit 20 _L4DPM0_ are set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with the UDP Destination Port Number field in the IPv4 or IPv6 frames</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER260_LAYER3ADDRESS0REGISTER0</name>
          <description>Layer 3 Address field For IPv4 frames, it contains the 32bit IP Source Address field For IPv6 frames, it contains Bits [31:0] of the 128bit IP Source Address or Destination Address field</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L3A00</name>
              <description>Layer 3 Address 0 Field When Bit 0 _L3PEN0_ and Bit 2 _L3SAM0_ are set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with Bits [31:0] of the IP Source Address field in the IPv6 frames When Bit 0 _L3PEN0_ and Bit 4 _L3DAM0_ are set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with Bits [31:0] of the IP Destination Address field in the IPv6 frames When Bit 0 _L3PEN0_ is reset and Bit 2 _L3SAM0_ is set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with the IP Source Address field in the IPv4 frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER261_LAYER3ADDRESS1REGISTER0</name>
          <description>Layer 3 Address 1 field For IPv4 frames, it contains the 32bit IP Destination Address field For IPv6 frames, it contains Bits [63:32] of the 128bit IP Source Address or Destination Address field</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L3A10</name>
              <description>Layer 3 Address 1 Field When Bit 0 _L3PEN0_ and Bit 2 _L3SAM0_ are set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with Bits [63:32] of the IP Source Address field in the IPv6 frames When Bit 0 _L3PEN0_ and Bit 4 _L3DAM0_ are set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with Bits [63:32] of the IP Destination Address field in the IPv6 frames When Bit 0 _L3PEN0_ is reset and Bit 4 _L3DAM0_ is set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with the IP Destination Address field in the IPv4 frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER262_LAYER3ADDRESS2REGISTER0</name>
          <description>Layer 3 Address 2 field This register is reserved for IPv4 frames For IPv6 frames, it contains Bits [95:64] of the 128bit IP Source Address or Destination Address field</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L3A20</name>
              <description>Layer 3 Address 2 Field When Bit 0 _L3PEN0_ and Bit 2 _L3SAM0_ are set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with Bits [95:64] of the IP Source Address field in the IPv6 frames When Bit 0 _L3PEN0_ and Bit 4 _L3DAM0_ are set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains value to be matched with Bits [95:64] of the IP Destination Address field in the IPv6 frames When Bit 0 _L3PEN0_ is reset in Register 256 _Layer 3 and Layer 4 Control Register 0_, this register is not used</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER263_LAYER3ADDRESS3REGISTER0</name>
          <description>Layer 3 Address 3 field This register is reserved for IPv4 frames For IPv6 frames, it contains Bits [127:96] of the 128bit IP Source Address or Destination Address field</description>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L3A30</name>
              <description>Layer 3 Address 3 Field When Bit 0 _L3PEN0_ and Bit 2 _L3SAM0_ are set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with Bits [127:96] of the IP Source Address field in the IPv6 frames When Bit 0 _L3PEN0_ and Bit 4 _L3DAM0_ are set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be matched with Bits [127:96] of the IP Destination Address field in the IPv6 frames When Bit 0 _L3PEN0_ is reset in Register 256 _Layer 3 and Layer 4 Control Register 0_, this register is not used</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER320_HASHTABLEREGISTER0</name>
          <description>This register contains the first 32 bits of the hash table when the width of the Hash table is 128 bits or 256 bits</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HT31T0</name>
              <description>First 32 bits of Hash Table This field contains the first 32 Bits _31:0_ of the Hash table Note Registers 321 through 327 are similar to Register 320 _Hash Table Register 0_ Registers 324 through 327 are present only when you select the 256bit Hash table during core configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER353_VLANTAGINCLUSIONORREPLACEMENTREGISTER</name>
          <description>This register contains the VLAN tag for insertion into or replacement in the transmit frames</description>
          <addressOffset>0x584</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VLT</name>
              <description>VLAN Tag for Transmit Frames This field contains the value of the VLAN tag to be inserted or replaced The value must only be changed when the transmit lines are inactive or during the initialization phase Bits[15:13] are the User Priority, Bit 12 is the CFI/DEI, and Bits[11:0] are the VLAN tag’s VID field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLC</name>
              <description>VLAN Tag Control in Transmit Frames 2’b00: No VLAN tag deletion, insertion, or replacement 2’b01: VLAN tag deletion The MAC removes the VLAN type _bytes 13 and 14_ and VLAN tag _bytes 15 and 16_ of all transmitted frames with VLAN tags 2’b10: VLAN tag insertion The MAC inserts VLT in bytes 15 and 16 of the frame after inserting the Type value _0x8100/0x88a8_ in bytes 13 and 14 This operation is performed on all transmitted frames, irrespective of whether they already have a VLAN tag 2’b11: VLAN tag replacement The MAC replaces VLT in bytes 15 and 16 of all VLANtype transmitted frames _Bytes 13 and 14 are 0x8100/0x88a8_ Note: Changes to this field take effect only on the start of a frame If you write this register field when a frame is being transmitted, only the subsequent frame can use the updated value, that is, the current frame does not use the updated value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLP</name>
              <description>VLAN Priority Control When this bit is set, the control Bits [17:16] are used for VLAN deletion, insertion, or replacement When this bit is reset, the mti_vlan_ctrl_i control input is used, and Bits [17:16] are ignored</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSVL</name>
              <description>CVLAN or SVLAN When this bit is set, SVLAN type _0x88A8_ is inserted or replaced in the 13th and 14th bytes of transmitted frames When this bit is reset, CVLAN type _0x8100_ is inserted or replaced in the transmitted frames</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER354_VLANHASHTABLEREGISTER</name>
          <description>This register contains the VLAN hash table</description>
          <addressOffset>0x588</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VLHT</name>
              <description>VLAN Hash Table This field contains the 16bit VLAN Hash Table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
