esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>REGISTER448_TIMESTAMPCONTROLREGISTER</name>
          <description>Controls the timestamp generation and update logic This register is present only when IEEE1588 timestamping is enabled during coreConsultant configuration</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <resetValue>0x2000</resetValue>
          <fields>
            <field>
              <name>TSENA</name>
              <description>Timestamp Enable When set, the timestamp is added for the transmit and receive frames When disabled, timestamp is not added for the transmit and receive frames and the Timestamp Generator is also suspended You need to initialize the Timestamp _system time_ after enabling this mode On the receive side, the MAC processes the 1588 frames only if this bit is set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFUPDT</name>
              <description>Timestamp Fine or Coarse Update When set, this bit indicates that the system times update should be done using the fine update method When reset, it indicates the system timestamp update should be done using the Coarse method</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSINIT</name>
              <description>Timestamp Initialize When set, the system time is initialized _overwritten_ with the value specified in the Register 452 _System Time  Seconds Update Register_ and Register 453 _System Time  Nanoseconds Update Register_ This bit should be read zero before updating it This bit is reset when the initialization is complete The “Timestamp Higher Word” register _if enabled during core configuration_ can only be initialized</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSUPDT</name>
              <description>Timestamp Update When set, the system time is updated _added or subtracted_ with the value specified in Register 452 _System Time  Seconds Update Register_ and Register 453 _System Time  Nanoseconds Update Register_ This bit should be read zero before updating it This bit is reset when the update is completed in hardware The “Timestamp Higher Word” register _if enabled during core configuration_ is not updated</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTRIG</name>
              <description>Timestamp Interrupt Trigger Enable When set, the timestamp interrupt is generated when the System Time becomes greater than the value written in the Target Time register This bit is reset after the generation of the Timestamp Trigger Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSADDREG</name>
              <description>Addend Reg Update When set, the content of the Timestamp Addend register is updated in the PTP block for fine correction This is cleared when the update is completed This register bit should be zero before setting it</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENALL</name>
              <description>Enable Timestamp for All Frames When set, the timestamp snapshot is enabled for all frames received by the MAC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCTRLSSR</name>
              <description>Timestamp Digital or Binary Rollover Control When set, the Timestamp Low register rolls over after 0x3B9A_C9FF value _that is, 1 nanosecond accuracy_ and increments the timestamp _High_ seconds When reset, the rollover value of subsecond register is 0x7FFF_FFFF The subsecond increment has to be programmed correctly depending on the PTP reference clock frequency and the value of this bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSVER2ENA</name>
              <description>Enable PTP packet Processing for Version 2 Format When set, the PTP packets are processed using the 1588 version 2 format Otherwise, the PTP packets are processed using the version 1 format The IEEE 1588 Version 1 and Version 2 format are described in “PTP Processing and Control” on page 155</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSIPENA</name>
              <description>Enable Processing of PTP over Ethernet Frames When set, the MAC receiver processes the PTP packets encapsulated directly in the Ethernet frames When this bit is clear, the MAC ignores the PTP over Ethernet packets</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSIPV6ENA</name>
              <description>Enable Processing of PTP Frames Sent over IPv6UDP When set, the MAC receiver processes PTP packets encapsulated in UDP over IPv6 packets When this bit is clear, the MAC ignores the PTP transported over UDPIPv6 packets</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSIPV4ENA</name>
              <description>Enable Processing of PTP Frames Sent over IPv4UDP When set, the MAC receiver processes the PTP packets encapsulated in UDP over IPv4 packets When this bit is clear, the MAC ignores the PTP transported over UDPIPv4 packets This bit is set by default</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEVNTENA</name>
              <description>Enable Timestamp Snapshot for Event Messages When set, the timestamp snapshot is taken only for event messages _SYNC, Delay_Req, Pdelay_Req, or Pdelay_Resp_ When reset, the snapshot is taken for all messages except Announce, Management, and Signaling For more information about the timestamp snapshots, see Table 670 on page 462</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSMSTRENA</name>
              <description>Enable Snapshot for Messages Relevant to Master When set, the snapshot is taken only for the messages relevant to the master node Otherwise, the snapshot is taken for the messages relevant to the slave node</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNAPTYPSEL</name>
              <description>Select PTP packets for Taking Snapshots These bits along with Bits 15 and 14 decide the set of PTP packet types for which snapshot needs to be taken The encoding is given in Table 670 on page 462</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENMACADDR</name>
              <description>Enable MAC address for PTP Frame Filtering When set, the DA MAC address _that matches any MAC Address register_ is used to filter the PTP frames when PTP is directly sent over Ethernet</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSFC</name>
              <description>Auxiliary Snapshot FIFO Clear When set, it resets the pointers of the Auxiliary Snapshot FIFO This bit is cleared when the pointers are reset and the FIFO is empty When this bit is high, auxiliary snapshots get stored in the FIFO This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option is not selected during core configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSEN0</name>
              <description>Auxiliary Snapshot 0 Enable This field controls capturing the Auxiliary Snapshot Trigger 0 When this bit is set, the Auxiliary snapshot of event on ptp_aux_trig_i[0] input is enabled When this bit is reset, the events on this input are ignored This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option is not selected during core configuration</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSEN1</name>
              <description>Auxiliary Snapshot 1 Enable This field controls capturing the Auxiliary Snapshot Trigger 1 When this bit is set, the Auxiliary snapshot of event on ptp_aux_trig_i[1] input is enabled When this bit is reset, the events on this input are ignored This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option is not selected during core configuration or the selected number in the Number of IEEE 1588 Auxiliary Snapshot Inputs option is less than two</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSEN2</name>
              <description>Auxiliary Snapshot 2 Enable This field controls capturing the Auxiliary Snapshot Trigger 2 When this bit is set, the Auxiliary snapshot of event on ptp_aux_trig_i[2] input is enabled When this bit is reset, the events on this input are ignored This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option is not selected during core configuration or the selected number in the Number of IEEE 1588 Auxiliary Snapshot Inputs option is less than three</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSEN3</name>
              <description>Auxiliary Snapshot 3 Enable This field controls capturing the Auxiliary Snapshot Trigger 3 When this bit is set, the Auxiliary snapshot of event on ptp_aux_trig_i[3] input is enabled When this bit is reset, the events on this input are ignored This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option is not selected during core configuration or the selected number in the Number of IEEE 1588 Auxiliary Snapshot Inputs option is less than four</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER449_SUBSECONDINCREMENTREGISTER</name>
          <description>Contains the 8bit value by which the SubSecond register is incremented This register is present only when IEEE1588 timestamping is enabled without an external timestamp input</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSINC</name>
              <description>Subsecond Increment Value The value programmed in this field is accumulated every clock cycle _of clk_ptp_i_ with the contents of the subsecond register For example, when PTP clock is 50 MHz _period is 20 ns_, you should program 20 _0x14_ when the System Time Nanoseconds register has an accuracy of 1 ns [Bit 9 _TSCTRLSSR_ is set in Register 448 _Timestamp Control Register_] When TSCTRLSSR is clear, the Nanoseconds register has a resolution of ~0465ns In this case, you should program a value of 43 _0x2B_ that is derived by 20ns/0465</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER450_SYSTEMTIMESECONDSREGISTER</name>
          <description>Contains the lower 32 bits of the seconds field of the system time This register is present only when IEEE1588 timestamping is enabled without an external timestamp input</description>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSS_RO</name>
              <description>Timestamp Second The value in this field indicates the current value in seconds of the System Time maintained by the MAC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER451_SYSTEMTIMENANOSECONDSREGISTER</name>
          <description>Contains 32 bits of the nanoseconds field of the system time This register is only present when IEEE1588 timestamping is enabled without an external timestamp input</description>
          <addressOffset>0x70c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSSS_RO</name>
              <description>Timestamp Sub Seconds The value in this field has the sub second representation of time, with an accuracy of 046 ns When Bit 9 _TSCTRLSSR_ is set in Register 448 _Timestamp Control Register_, each bit represents 1 ns and the maximum value is 0x3B9A_C9FF, after which it rollsover to zero</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER452_SYSTEMTIMESECONDSUPDATEREGISTER</name>
          <description>Contains the lower 32 bits of the seconds field to be written to, added to, or subtracted from the System Time value This register is only present when IEEE1588 timestamping is enabled without an external timestamp input</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSS</name>
              <description>TIMESTAMP SECOND THE VALUE IN THIS FIELD INDICATES THE TIME IN SECONDS TO BE INITIALIZED OR ADDED TO THE SYSTEM TIME</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER453_SYSTEMTIMENANOSECONDSUPDATEREGISTER</name>
          <description>Contains 32 bits of the nanoseconds field to be written to, added to, or subtracted from the System Time value This register is only present when IEEE1588 timestamping is enabled without an external timestamp input</description>
          <addressOffset>0x714</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSSS</name>
              <description>Timestamp Sub Seconds The value in this field has the sub second representation of time, with an accuracy of 046 ns When Bit 9 _TSCTRLSSR_ is set in Register 448 _Timestamp Control Register_, each bit represents 1 ns and the programmed value should not exceed 0x3B9A_C9FF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDSUB</name>
              <description>Add or Subtract Time When this bit is set, the time value is subtracted with the contents of the update register When this bit is reset, the time value is added with the contents of the update register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER454_TIMESTAMPADDENDREGISTER</name>
          <description>This register is used by the software to readjust the clock frequency linearly to match the master clock frequency This register is only present when IEEE1588 timestamping is enabled without an external timestamp input</description>
          <addressOffset>0x718</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSAR</name>
              <description>Timestamp Addend Register This field indicates the 32bit time value to be added to the Accumulator register to achieve time synchronization</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER455_TARGETTIMESECONDSREGISTER</name>
          <description>Contains the higher 32 bits of time to be compared with the system time for interrupt event generation or to start the PPS signal output generation This register is present only when IEEE1588 timestamping is enabled without an external timestamp input</description>
          <addressOffset>0x71c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSTR</name>
              <description>Target Time Seconds Register This register stores the time in seconds When the timestamp value matches or exceeds both Target Timestamp registers, then based on Bits [6:5] of Register 459 _PPS Control Register_, the MAC starts or stops the PPS signal output and generates an interrupt _if enabled_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER456_TARGETTIMENANOSECONDSREGISTER</name>
          <description>Contains the lower 32 bits of time to be compared with the system time for interrupt event generation or to start the PPS signal output generation This register is present only when IEEE1588 timestamping is enabled without an external timestamp input</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TTSLO</name>
              <description>Target Timestamp Low Register This register stores the time in _signed_ nanoseconds When the value of the timestamp matches the both Target Timestamp registers, then based on the TRGTMODSEL0 field _Bits [6:5]_ in Register 459 _PPS Control Register_, the MAC starts or stops the PPS signal output and generates an interrupt _if enabled_ This value should not exceed 0x3B9A_C9FF when Bit 9 _TSCTRLSSR_ is set in Register 448 _Timestamp Control Register_ The actual start or stop time of the PPS signal output may have an error margin up to one unit of subsecond increment value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGTBUSY</name>
              <description>Target Time Register Busy The MAC sets this bit when the PPSCMD field _Bit [3:0]_ in Register 459 _PPS Control Register_ is programmed to 010 or 011 Programming the PPSCMD field to 010 or 011, instructs the MAC to synchronize the Target Time Registers to the PTP clock domain The MAC clears this bit after synchronizing the Target Time Registers to the PTP clock domain The application must not update the Target Time Registers when this bit is read as 1 Otherwise, the synchronization of the previous programmed time gets corrupted This bit is reserved when the Enable Flexible PulsePerSecond Output feature is not selected</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER457_SYSTEMTIMEHIGHERWORDSECONDSREGISTER</name>
          <description>Contains the most significant 16bits of the timestamp seconds value This register is optional and can be selected using the parameter mentioned in “IEEE 1588 Timestamp Block” on page 492</description>
          <addressOffset>0x724</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSHWR</name>
              <description>Timestamp Higher Word Register This field contains the most significant 16bits of the timestamp seconds value This register is optional and can be selected using the Enable IEEE 1588 Higher Word Register option during core configuration The register is directly written to initialize the value This register is incremented when there is an overflow from the 32bits of the System Time  Seconds register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
