esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>REGISTER458_TIMESTAMPSTATUSREGISTER</name>
          <description>Contains the PTP status This register is available only when the advanced IEEE 1588 timestamp feature is selected</description>
          <addressOffset>0x728</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSSOVF</name>
              <description>Timestamp Seconds Overflow When set, this bit indicates that the seconds value of the timestamp _when supporting version 2 format_ has overflowed beyond 32’hFFFF_FFFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTARGT</name>
              <description>Timestamp Target Time Reached When set, this bit indicates that the value of system time is greater than or equal to the value specified in the Register 455 _Target Time Seconds Register_ and Register 456 _Target Time Nanoseconds Register_</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUXTSTRIG</name>
              <description>Auxiliary Timestamp Trigger Snapshot This bit is set high when the auxiliary snapshot is written to the FIFO This bit is valid only if the Enable IEEE 1588 Auxiliary Snapshot feature is selected</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTRGTERR</name>
              <description>Timestamp Target Time Error This bit is set when the target time, being programmed in Register 455 and Register 456, is already elapsed This bit is cleared when read by the application</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTARGT1</name>
              <description>Timestamp Target Time Reached for Target Time PPS1 When set, this bit indicates that the value of system time is greater than or equal to the value specified in Register 480 _PPS1 Target Time High Register_ and Register 481 _PPS1 Target Time Low Register_</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTRGTERR1</name>
              <description>Timestamp Target Time Error This bit is set when the target time, being programmed in Register 480 and Register 481, is already elapsed This bit is cleared when read by the application</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTARGT2</name>
              <description>Timestamp Target Time Reached for Target Time PPS2 When set, this bit indicates that the value of system time is greater than or equal to the value specified in Register 488 _PPS2 Target Time High Register_ and Register 489 _PPS2 Target Time Low Register_</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTRGTERR2</name>
              <description>Timestamp Target Time Error This bit is set when the target time, being programmed in Register 488 and Register 489, is already elapsed This bit is cleared when read by the application</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTARGT3</name>
              <description>Timestamp Target Time Reached for Target Time PPS3 When set, this bit indicates that the value of system time is greater than or equal to the value specified in Register 496 _PPS3 Target Time High Register_ and Register 497 _PPS3 Target Time Low Register_</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTRGTERR3</name>
              <description>Timestamp Target Time Error This bit is set when the target time, being programmed in Register 496 and Register 497, is already elapsed This bit is cleared when read by the application</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSSTN</name>
              <description>Auxiliary Timestamp Snapshot Trigger Identifier These bits identify the Auxiliary trigger inputs for which the timestamp available in the Auxiliary Snapshot Register is applicable When more than one bit is set at the same time, it means that corresponding auxiliary triggers were sampled at the same clock These bits are applicable only if the number of Auxiliary snapshots is more than one One bit is assigned for each trigger as shown in the following list: Bit 16: Auxiliary trigger 0 Bit 17: Auxiliary trigger 1 Bit 18: Auxiliary trigger 2 Bit 19: Auxiliary trigger 3 The software can read this register to find the triggers that are set when the timestamp is taken</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSSTM</name>
              <description>Auxiliary Timestamp Snapshot Trigger Missed</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ATSNS</name>
              <description>Number of Auxiliary Timestamp Snapshots This field indicates the number of Snapshots available in the FIFO A value equal to the selected depth of FIFO _4, 8, or 16_ indicates that the Auxiliary Snapshot FIFO is full These bits are cleared _to 00000_ when the Auxiliary snapshot FIFO clear bit is set This bit is valid only if the Add IEEE 1588 Auxiliary Snapshot option is selected during core configuration</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER459_PPSCONTROLREGISTER</name>
          <description>This register is used to control the interval of the PPS signal output This register is available only when the advanced IEEE 1588 timestamp feature is selected</description>
          <addressOffset>0x72c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PPSCTRL0</name>
              <description>PPSCTRL0: PPS0 Output Frequency Control This field controls the frequency of the PPS0 output _ptp_pps_o[0]_ signal The default value of PPSCTRL is 0000, and the PPS output is 1 pulse _of width clk_ptp_i_ every second For other values of PPSCTRL, the PPS output becomes a generated clock of following frequencies: 0001: The binary rollover is 2 Hz, and the digital rollover is 1 Hz 0010: The binary rollover is 4 Hz, and the digital rollover is 2 Hz 0011: The binary rollover is 8 Hz, and the digital rollover is 4 Hz 0100: The binary rollover is 16 Hz, and the digital rollover is 8 Hz  1111: The binary rollover is 32768 KHz, and the digital rollover is 16384 KHz Note: In the binary rollover mode, the PPS output _ptp_pps_o_ has a duty cycle of 50 percent with these frequencies In the digital rollover mode, the PPS output frequency is an average number The actual clock is of different frequency that gets synchronized every second For example: When PPSCTRL = 0001, the PPS _1 Hz_ has a low period of 537 ms and a high period of 463 ms When PPSCTRL = 0010, the PPS _2 Hz_ is a sequence of: 	One clock of 50 percent duty cycle and 537 ms period 	Second clock of 463 ms period _268 ms low and 195 ms high_ When PPSCTRL = 0011, the PPS _4 Hz_ is a sequence of: 	Three clocks of 50 percent duty cycle and 268 ms period 	Fourth clock of 195 ms period _134 ms low and 61 ms high_ This behavior is because of the nonlinear toggling of bits in the digital rollover mode in Register 451 _System Time  Nanoseconds Register_ / PPSCMD0: Flexible PPS0 Output _ptp_pps_o[0]_ Control Programming these bits with a nonzero value instructs the MAC to initiate an event When the command is transferred or synchronized to the PTP clock domain, these bits get cleared automatically The Software should ensure that these bits are programmed only when they are “allzero” The following list describes the values of PPSCMD0: 0000: No Command 0001: START Single Pulse This command generates single pulse rising at the start point defined in Target Time Registers _register 455 and 456_ and of a duration defined in the PPS0 Width Register 0010: START Pulse Train This command generates the train of pulses rising at the start point defined in the Target Time Registers and of a duration defined in the PPS0 Width Register and repeated at interval defined in the PPS Interval Register By default, the PPS pulse train is freerunning unless stopped by 'STOP Pulse train at time' or 'STOP Pulse Train immediately' commands 0011: Cancel START This command cancels the START Single Pulse and START Pulse Train commands if the system time has not crossed the programmed start time 0100: STOP Pulse train at time This command stops the train of pulses initiated by the START Pulse Train command _PPSCMD = 0010_ after the time programmed in the Target Time registers elapses 0101: STOP Pulse Train immediately This command immediately stops the train of pulses initiated by the START Pulse Train command _PPSCMD = 0010_ 0110: Cancel STOP Pulse train This command cancels the STOP pulse train at time command if the programmed stop time has not elapsed The PPS pulse train becomes freerunning on the successful execution of this command 01111111: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPSEN0</name>
              <description>Flexible PPS Output Mode Enable When set low, Bits [3:0] function as PPSCTRL _backward compatible_ When set high, Bits[3:0] function as PPSCMD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGTMODSEL0</name>
              <description>Target Time Register Mode for PPS0 Output This field indicates the Target Time registers _register 455 and 456_ mode for PPS0 output signal: 00: Indicates that the Target Time registers are programmed only for generating the interrupt event 01: Reserved 10: Indicates that the Target Time registers are programmed for generating the interrupt event and starting or stopping the generation of the PPS0 output signal 11: Indicates that the Target Time registers are programmed only for starting or stopping the generation of the PPS0 output signal No interrupt is asserted</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPSCMD1</name>
              <description>Flexible PPS1 Output Control This field controls the flexible PPS1 output _ptp_pps_o[1]_ signal This field is similar to PPSCMD0[2:0] in functionality</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGTMODSEL1</name>
              <description>Target Time Register Mode for PPS1 Output This field indicates the Target Time registers _register 480 and 481_ mode for PPS1 output signal This field is similar to the TRGTMODSEL0 field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPSCMD2</name>
              <description>Flexible PPS2 Output Control This field controls the flexible PPS2 output _ptp_pps_o[2]_ signal This field is similar to PPSCMD0[2:0] in functionality</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGTMODSEL2</name>
              <description>Target Time Register Mode for PPS2 Output This field indicates the Target Time registers _register 488 and 489_ mode for PPS2 output signal This field is similar to the TRGTMODSEL0 field</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPSCMD3</name>
              <description>Flexible PPS3 Output Control This field controls the flexible PPS3 output _ptp_pps_o[3]_ signal This field is similar to PPSCMD0[2:0] in functionality</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGTMODSEL3</name>
              <description>Target Time Register Mode for PPS3 Output This field indicates the Target Time registers _register 496 and 497_ mode for PPS3 output signal This field is similar to the TRGTMODSEL0 field</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER460_AUXILIARYTIMESTAMPNANOSECONDSREGISTER</name>
          <description>Contains the lower 32 bits _nanoseconds field_ of the auxiliary timestamp register</description>
          <addressOffset>0x730</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AUXTSLO</name>
              <description>Contains the lower 31 bits _nanoseconds field_ of the auxiliary timestamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER461_AUXILIARYTIMESTAMPSECONDSREGISTER</name>
          <description>Contains the lower 32 bits of the Seconds field of the auxiliary timestamp register</description>
          <addressOffset>0x734</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AUXTSHI</name>
              <description>Contains the lower 32 bits of the Seconds field of the auxiliary timestamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER462_AVMACCONTROLREGISTER</name>
          <description>Controls the AV traffic and queue management in the MAC Receiver This register is present only when you select the AV feature in coreConsultant</description>
          <addressOffset>0x738</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AVT</name>
              <description>AV EtherType Value This field contains the value that is compared with the EtherType field of the incoming _tagged or untagged_ Ethernet frame to detect an AV packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVP</name>
              <description>AV Priority for Queuing The value programmed in these bits control the receive channel _0, 1, or 2_ to which an AV packet with a given priority must be queued If only Channel 1 receive path is enabled, the AV packets with priority value greater than or equal to the programmed value are queued on Channel 1 and all other packets are queued on Channel 0 If Channel 2 receive path is also enabled, the AV packets with priority value greater than or equal to the programmed value are queued on Channel 2 The AV packets with value less than the programmed value on Channel 1 and all other packets are queued on Channel 0 These bits are applicable only if at least one additional receive channel is selected in the AV mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VQE</name>
              <description>VLAN Tagged NonAV Packets Queueing Enable When this bit is set, the MAC also queues nonAV VLAN tagged packets into the available channels according to the value of the AVP bits This bit is reserved and readonly if Channel 1 and Channel 2 Receive paths are not selected during core configuration</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVCD</name>
              <description>AV Channel Disable When this bit is set, the MAC forwards all packets to the default Channel 0 and the values programmed in the AVP, AVCH, and PTPCH fields are ignored This bit is reserved and readonly if Channel 1 or Channel 2 receive paths are not selected during core configuration</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVCH</name>
              <description>Channel for Queuing the AV Control Packets This field specifies the channel on which the received untagged AV control packets are queued 00: Channel 0 01: Channel 1 10: Channel 2 11: Reserved These bits are reserved if the receive paths of Channel 1 or Channel 2 are not enabled</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTPCH</name>
              <description>Channel for Queuing the PTP Packets This field specifies the channel on which the untagged PTP packets, sent over the Ethernet payload and not over IPv4 or IPv6, are queued 00: Channel 0 01: Channel 1 10: Channel 2 11: Reserved These bits are reserved if the receive paths of Channel 1 or Channel 2 are not enabled</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER472_PPS0INTERVALREGISTER</name>
          <description>Contains the number of units of subsecond increment value between the rising edges of PPS0 signal output This register is available only when the flexible PPS feature is selected</description>
          <addressOffset>0x760</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PPSINT</name>
              <description>PPS0 Output Signal Interval These bits store the interval between the rising edges of PPS0 signal output in terms of units of subsecond increment value You need to program one value less than the required interval For example, if the PTP reference clock is 50 MHz _period of 20ns_, and desired interval between rising edges of PPS0 signal output is 100ns _that is, five units of subsecond increment value_, then you should program value 4 _5  1_ in this register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER473_PPS0WIDTHREGISTER</name>
          <description>Contains the number of units of subsecond increment value between the rising and corresponding falling edges of PPS0 signal output This register is available only when the flexible PPS feature is selected</description>
          <addressOffset>0x764</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PPSWIDTH</name>
              <description>PPS0 Output Signal Width These bits store the width between the rising edge and corresponding falling edge of the PPS0 signal output in terms of units of subsecond increment value You need to program one value less than the required interval For example, if PTP reference clock is 50 MHz _period of 20ns_, and desired width between the rising and corresponding falling edges of PPS0 signal output is 80ns _that is, four units of subsecond increment value_, then you should program value 3 _4  1_ in this register Note: The value programmed in this register must be lesser than the value programmed in Register 472 _PPS0 Interval Register_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER480_PPS1TARGETTIMESECONDSREGISTER</name>
          <description>Contains the higher 32 bits of time to be compared with the system time to generate the interrupt event or to start generating the PPS1 output signal This register is present only when IEEE1588 timestamping is enabled without an external timestamp input and at least one additional PPS output is selected</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSTRH1</name>
              <description>PPS1 Target Time Seconds Register This register stores the time in seconds When the timestamp value matches or exceeds both Target Timestamp registers, then based on Bits [14:13], TRGTMODSEL1, of Register 459 _PPS Control Register_, the MAC starts or stops the PPS signal output and generates an interrupt _if enabled_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
