esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>REGISTER8_MISSEDFRAMEANDBUFFEROVERFLOWCOUNTERREGISTER</name>
          <description>Contains the counters for discarded frames because no host Receive Descriptor was available or because of Receive FIFO Overflow</description>
          <addressOffset>0x1020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MISFRMCNT</name>
              <description>Missed Frame Counter This field indicates the number of frames missed by the controller because of the Host Receive Buffer being unavailable This counter is incremented each time the DMA discards an incoming frame The counter is cleared when this register is read with mci_be_i[0] at 1’b1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MISCNTOVF</name>
              <description>Overflow Bit for Missed Frame Counter This bit is set every time Missed Frame Counter _Bits[15:0]_ overflows, that is, the DMA discards an incoming frame because of the Host Receive Buffer being unavailable with the missed frame counter at maximum value In such a scenario, the Missed frame counter is reset to allzeros and this bit indicates that the rollover happened</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVFFRMCNT</name>
              <description>Overflow Frame Counter This field indicates the number of frames missed by the application This counter is incremented each time the MTL FIFO overflows The counter is cleared when this register is read with mci_be_i[2] at 1’b1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVFCNTOVF</name>
              <description>Overflow Bit for FIFO Overflow Counter This bit is set every time the Overflow Frame Counter _Bits[27:17]_ overflows, that is, the Rx FIFO overflows with the overflow frame counter at maximum value In such a scenario, the overflow frame counter is reset to allzeros and this bit indicates that the rollover happened</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER9_RECEIVEINTERRUPTWATCHDOGTIMERREGISTER</name>
          <description>Watchdog timeout for Receive Interrupt _RI_ from DMA</description>
          <addressOffset>0x1024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RIWT</name>
              <description>RI Watchdog Timer Count This bit indicates the number of system clock cycles multiplied by 256 for which the watchdog timer is set The watchdog timer gets triggered with the programmed value after the Rx DMA completes the transfer of a frame for which the RI status bit is not set because of the setting in the corresponding descriptor RDES1[31] When the watchdog timer runs out, the RI bit is set and the timer is stopped The watchdog timer is reset when the RI bit is set high because of automatic setting of RI as per RDES1[31] of any received frame</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER10_AXIBUSMODEREGISTER</name>
          <description>Controls AXI master behavior _mainly controls burst splitting and number of outstanding requests_</description>
          <addressOffset>0x1028</addressOffset>
          <size>32</size>
          <resetValue>0x110001</resetValue>
          <fields>
            <field>
              <name>UNDEF</name>
              <description>AXI Undefined Burst Length This bit is readonly bit and indicates the complement _invert_ value of Bit 16 _FB_ in Register 0 _Bus Mode Register_ When this bit is set to 1, the GMACAXI is allowed to perform any burst length equal to or below the maximum allowed burst length programmed in Bits[7:3] When this bit is set to 0, the GMACAXI is allowed to perform only fixed burst lengths as indicated by BLEN256, BLEN128, BLEN64, BLEN32, BLEN16, BLEN8, or BLEN4, or a burst length of 1 If UNDEF is set and none of the BLEN bits is set, then GMACAXI is allowed to perform a burst length of 16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLEN4</name>
              <description>AXI Burst Length 4 When this bit is set to 1, the GMACAXI is allowed to select a burst length of 4 on the AXI master interface Setting this bit has no effect when UNDEF is set to 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEN8</name>
              <description>AXI Burst Length 8 When this bit is set to 1, the GMACAXI is allowed to select a burst length of 8 on the AXI master interface Setting this bit has no effect when UNDEF is set to 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEN16</name>
              <description>AXI Burst Length 16 When this bit is set to 1 or UNDEF is set to 1, the GMACAXI is allowed to select a burst length of 16 on the AXI master interface</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEN32</name>
              <description>AXI Burst Length 32 When this bit is set to 1, the GMACAXI is allowed to select a burst length of 32 on the AXI master interface This bit is present only when the configuration parameter AXI_BL is set to 32 or more Otherwise, this bit is reserved and is readonly _RO_</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEN64</name>
              <description>AXI Burst Length 64 When this bit is set to 1, the GMACAXI is allowed to select a burst length of 64 on the AXI master interface This bit is present only when the configuration parameter AXI_BL is set to 64 or more Otherwise, this bit is reserved and is readonly _RO_</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEN128</name>
              <description>AXI Burst Length 128 When this bit is set to 1, the GMACAXI is allowed to select a burst length of 128 on the AXI master interface This bit is present only when the configuration parameter AXI_BL is set to 128 or more Otherwise, this bit is reserved and is readonly _RO_</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEN256</name>
              <description>AXI Burst Length 256 When this bit is set to 1, the GMACAXI is allowed to select a burst length of 256 on the AXI master interface This bit is present only when the configuration parameter AXI_BL is set to 256 Otherwise, this bit is reserved and is readonly _RO_</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXI_AAL</name>
              <description>AddressAligned Beats This bit is readonly bit and reflects the Bit 25 _AAL_ of Register 0 _Bus Mode Register_ When this bit is set to 1, the GMACAXI performs addressaligned burst transfers on both read and write channels 11:8		Reserved	0H	RO</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ONEKBBE</name>
              <description>1 KB Boundary Crossing Enable for the GMACAXI Master When set, the GMACAXI master performs burst transfers that do not cross 1 KB boundary When reset, the GMACAXI master performs burst transfers that do not cross 4 KB boundary</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_OSR_LMT</name>
              <description>AXI Maximum Read Outstanding Request Limit This value limits the maximum outstanding request on the AXI read interface Maximum outstanding requests = RD_OSR_LMT+1 Note: Bit 18 is reserved if AXI_GM_MAX_RD_REQUESTS = 4 Bit 19 is reserved if AXI_GM_MAX_RD_REQUESTS != 16 15:14		Reserved	00	RO</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_OSR_LMT</name>
              <description>AXI Maximum Write Outstanding Request Limit This value limits the maximum outstanding request on the AXI write interface Maximum outstanding requests = WR_OSR_LMT+1 Note: Bit 22 is reserved if AXI_GM_MAX_WR_REQUESTS = 4 Bit 23 bit is reserved if AXI_GM_MAX_WR_REQUESTS != 16</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPI_XIT_FRM</name>
              <description>Unlock on Magic Packet or Remote WakeUp Frame When set to 1, this bit enables the GMACAXI to come out of the LPI mode only when the magic packet or remote wakeup frame is received When set to 0, this bit enables the GMACAXI to come out of LPI mode when any frame is received 29:24		Reserved	00H	RO</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_LPI</name>
              <description>Enable Low Power Interface _LPI_ When set to 1, this bit enables the LPI mode supported by the GMACAXI configuration and accepts the LPI request from the AXI System Clock controller When set to 0, this bit disables the LPI mode and always denies the LPI request from the AXI System Clock controller</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER11_AHBORAXISTATUSREGISTER</name>
          <description>Gives the idle status of the AHB master interface in the GMACAHB configuration Gives the idle status of the AXI master's read or write channel in the GMACAXI configuration</description>
          <addressOffset>0x102c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AXWHSTS</name>
              <description>AXI Master Write Channel or AHB Master Status When high, it indicates that AXI master's write channel is active and transferring data in the GMACAXI configuration In the GMACAHB configuration, it indicates that the AHB master interface FSMs are in the nonidle state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AXIRDSTS</name>
              <description>AXI Master Read Channel Status When high, it indicates that AXI master's read channel is active and transferring data</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER18_CURRENTHOSTTRANSMITDESCRIPTORREGISTER</name>
          <description>Points to the start of current Transmit Descriptor read by the DMA</description>
          <addressOffset>0x1048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CURTDESAPTR</name>
              <description>Host Transmit Descriptor Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER19_CURRENTHOSTRECEIVEDESCRIPTORREGISTER</name>
          <description>Points to the start of current Receive Descriptor read by the DMA</description>
          <addressOffset>0x104c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CURRDESAPTR</name>
              <description>Host Receive Descriptor Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER20_CURRENTHOSTTRANSMITBUFFERADDRESSREGISTER</name>
          <description>Points to the current Transmit Buffer address read by the DMA</description>
          <addressOffset>0x1050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CURTBUFAPTR</name>
              <description>Host Transmit Buffer Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER21_CURRENTHOSTRECEIVEBUFFERADDRESSREGISTER</name>
          <description>Points to the current Receive Buffer address read by the DMA</description>
          <addressOffset>0x1054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CURRBUFAPTR</name>
              <description>Host Receive Buffer Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER22_HWFEATUREREGISTER</name>
          <description>Indicates the presence of the optional features of the core</description>
          <addressOffset>0x1058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MIISEL</name>
              <description>10 or 100 Mbps support</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GMIISEL</name>
              <description>1000 Mbps support</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HDSEL</name>
              <description>Halfduplex support</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTHASHEN</name>
              <description>Expanded DA Hash filter</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HASHSEL</name>
              <description>HASH filter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDMACADRSEL</name>
              <description>Multiple MAC Address registers</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCSSEL</name>
              <description>PCS registers _TBI, SGMII, or RTBI PHY interface_</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L3L4FLTREN</name>
              <description>Layer 3 and Layer 4 feature</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMASEL</name>
              <description>SMA _MDIO_ Interface</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RWKSEL</name>
              <description>PMT remote wakeup frame</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MGKSEL</name>
              <description>PMT magic packet</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMCSEL</name>
              <description>RMON module</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSVER1SEL</name>
              <description>Only IEEE 15882002 timestamp</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSVER2SEL</name>
              <description>IEEE 15882008 Advanced timestamp</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EEESEL</name>
              <description>Energy Efficient Ethernet</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AVSEL</name>
              <description>AV feature</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXCOESEL</name>
              <description>Checksum Offload in Tx</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXTYP1COE</name>
              <description>IP Checksum Offload _Type 1_ in Rx Note: If IPCHKSUM_EN = Enabled and IPC_FULL_OFFLOAD = Enabled, then RXTYP1COE = 0 and RXTYP2COE = 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXTYP2COE</name>
              <description>IP Checksum Offload _Type 2_ in Rx</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIFOSIZE</name>
              <description>Rx FIFO &gt; 2,048 Bytes</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXCHCNT</name>
              <description>Number of additional Rx Channels</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXCHCNT</name>
              <description>Number of additional Tx Channels</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENHDESSEL</name>
              <description>Alternate _Enhanced Descriptor_</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTTSEN</name>
              <description>Timestamping with Internal System Time</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLEXIPPSEN</name>
              <description>Flexible PulsePerSecond Output</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAVLANINS</name>
              <description>Source Address or VLAN Insertion</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTPHYIF</name>
              <description>Active or selected PHY interface When you have multiple PHY interfaces in your configuration, this field indicates the sampled value of phy_intf_sel_i during reset deassertion 000: GMII or MII 001: RGMII 010: SGMII 011: TBI 100: RMII 101: RTBI 110: SMII 111: RevMII All Others: Reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
