esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>REGISTER72_CHANNEL1MISSEDFRAMEANDBUFFEROVERFLOWCOUNTERREGISTER</name>
          <description>Contains the counters for discarded frames because no host Receive Descriptor was available, and discarded frames because of Receive FIFO Overflow</description>
          <addressOffset>0x1120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH1_MISFRMCNT</name>
              <description>Missed Frame Counter This field indicates the number of frames missed by the controller because of the Host Receive Buffer being unavailable This counter is incremented each time the DMA discards an incoming frame The counter is cleared when this register is read with mci_be_i[0] at 1’b1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_MISCNTOVF</name>
              <description>Overflow Bit for Missed Frame Counter This bit is set every time Missed Frame Counter _Bits[15:0]_ overflows, that is, the DMA discards an incoming frame because of the Host Receive Buffer being unavailable with the missed frame counter at maximum value In such a scenario, the Missed frame counter is reset to allzeros and this bit indicates that the rollover happened</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_OVFFRMCNT</name>
              <description>Overflow Frame Counter This field indicates the number of frames missed by the application This counter is incremented each time the MTL FIFO overflows The counter is cleared when this register is read with mci_be_i[2] at 1’b1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_OVFCNTOVF</name>
              <description>Overflow Bit for FIFO Overflow Counter This bit is set every time the Overflow Frame Counter _Bits[27:17]_ overflows, that is, the Rx FIFO overflows with the overflow frame counter at maximum value In such a scenario, the overflow frame counter is reset to allzeros and this bit indicates that the rollover happened</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER73_CHANNEL1RECEIVEINTERRUPTWATCHDOGTIMERREGISTER</name>
          <description>Watchdog timeout for Receive Interrupt _RI_ from DMA</description>
          <addressOffset>0x1124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH1_RIWT</name>
              <description>RI Watchdog Timer Count This bit indicates the number of system clock cycles multiplied by 256 for which the watchdog timer is set The watchdog timer gets triggered with the programmed value after the Rx DMA completes the transfer of a frame for which the RI status bit is not set because of the setting in the corresponding descriptor RDES1[31] When the watchdog timer runs out, the RI bit is set and the timer is stopped The watchdog timer is reset when the RI bit is set high because of automatic setting of RI as per RDES1[31] of any received frame</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER76_CHANNEL1SLOTFUNCTIONCONTROLANDSTATUSREGISTER</name>
          <description>Contains the control bits for slot function and its status for Channel 1 transmit path</description>
          <addressOffset>0x1130</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ESC</name>
              <description>Enable Slot Comparison When set, this bit enables the checking of the slot numbers, programmed in the transmit descriptor, with the current reference given in Bits [19:16] The DMA fetches the data from the corresponding buffer only when the slot number is equal to the reference slot number or is ahead of the reference slot number by one slot When reset, this bit disables the checking of the slot numbers The DMA fetches the data immediately after the descriptor is processed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASC</name>
              <description>Advance Slot Check When set, this bit enables the DMA to fetch the data from the buffer when the slot number _SLOTNUM_ programmed in the transmit descriptor is: equal to the reference slot number given in Bits [19:16] or ahead of the reference slot number by up to two slots This bit is applicable only when Bit 0 _ESC_ is set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSN</name>
              <description>Reference Slot Number This field gives the current value of the reference slot number in DMA used for comparison checking</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER82_CHANNEL1CURRENTHOSTTRANSMITDESCRIPTORREGISTER</name>
          <description>Points to the start of current Transmit Descriptor read by the DMA</description>
          <addressOffset>0x1148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH1_CURTDESAPTR</name>
              <description>Host Transmit Descriptor Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER83_CHANNEL1CURRENTHOSTRECEIVEDESCRIPTORREGISTER</name>
          <description>Points to the start of current Receive Descriptor read by the DMA</description>
          <addressOffset>0x114c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH1_CURRDESAPTR</name>
              <description>Host Receive Descriptor Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER84_CHANNEL1CURRENTHOSTTRANSMITBUFFERADDRESSREGISTER</name>
          <description>Points to the current Transmit Buffer address read by the DMA</description>
          <addressOffset>0x1150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH1_CURTBUFAPTR</name>
              <description>Host Transmit Buffer Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER85_CHANNEL1CURRENTHOSTRECEIVEBUFFERADDRESSREGISTER</name>
          <description>Points to the current Receive Buffer address read by the DMA</description>
          <addressOffset>0x1154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH1_CURRBUFAPTR</name>
              <description>Host Receive Buffer Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER88_CHANNEL1CBSCONTROLREGISTER</name>
          <description>Controls the Channel 1 credit shaping operation on the transmit path</description>
          <addressOffset>0x1160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH1_CBSD</name>
              <description>CreditBased Shaper Disable When set, the MAC disables the creditbased shaper algorithm for Channel 1 traffic and makes the traffic management algorithm to strict priority for Channel 1 over Channel 0 When reset, the creditbased shaper algorithm schedules the traffic in Channel 1 for transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_CC</name>
              <description>Credit Control When reset, the accumulated credit parameter in the creditbased shaper algorithm logic is set to zero when there is positive credit and no frame to transmit in Channel 1 When there is no frame waiting in Channel 1 and other channel is transmitting, no credit is accumulated When set, the accumulated credit parameter in the creditbased shaper algorithm logic is not reset to zero when there is positive credit and no frame to transmit in Channel 1 The credit accumulates even when there is no frame waiting in Channel 1 and another channel is transmitting</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_SLC</name>
              <description>Slot Count The software can program the number of slots _of duration 125 microsec_ over which the average transmitted bits per slot _provided in the CBS Status register_ need to be computed for Channel 1 when the creditbased shaper algorithm is enabled The encoding is as follows: 3'b000: 1 Slot 3'b001: 2 Slots 3'b010: 4 Slots 3'b011: 8 Slots 3'b100: 16 Slots 3'b1013'b111: Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_ABPSSIE</name>
              <description>Average Bits Per Slot Interrupt Enable When this bit is set, the MAC asserts an interrupt _sbd_intr_o or mci_intr_o_ when the average bits per slot status is updated _Bit 17 _ABSU_ in Register 89_ for Channel 1 When this bit is cleared, interrupt is not asserted for such an event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER89_CHANNEL1CBSSTATUSREGISTER</name>
          <description>Provides the average traffic transmitted in Channel 1</description>
          <addressOffset>0x1164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH1_ABS</name>
              <description>Average Bits per Slot This field contains the average transmitted bits per slot This field is computed over programmed number of slots _SLC bits in the CBS Control Register_ for Channel 1 traffic The maximum value is 0x30D4 for 100 Mbps and 0x1E848 for 1000 Mbps</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_ABSU</name>
              <description>ABS Updated When set, this bit indicates that the MAC has updated the ABS value This bit is cleared when the application reads the ABS value</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER90_CHANNEL1IDLESLOPECREDITREGISTER</name>
          <description>Contains the idleSlope credit value required for the creditbased shaper algorithm for Channel 1</description>
          <addressOffset>0x1168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH1_ISC</name>
              <description>idleSlopeCredit This field contains the idleSlopeCredit value required for the creditbased shaper algorithm for Channel 1 This is the rate of change of credit in bits per cycle _40ns and 8ns for 100 Mbps and 1000 Mbps respectively_ when the credit is increasing The software should program this field with computed credit in bits per cycle scaled by 1024 The maximum value is portTransmitRate, that is, 0x2000 in 1000 Mbps mode and 0x1000 in 100 Mbps mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER91_CHANNEL1SENDSLOPECREDITREGISTER</name>
          <description>Contains the sendSlope credit value required for the creditbased shaper algorithm for Channel 1</description>
          <addressOffset>0x116c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH1_SSC</name>
              <description>sendSlopeCredit This field contains the sendSlopeCredit value required for creditbased shaper algorithm for Channel 1 This is the rate of change of credit in bits per cycle _40ns and 8ns for 100 Mbps and 1000 Mbps respectively_ when the credit is decreasing The software should program this field with computed credit in bits per cycle scaled by 1024 The maximum value is portTransmitRate, that is, 0x2000 in 1000 Mbps mode and 0x1000 in 100 Mbps mode This field should be programmed with absolute sendSlopeCredit value The creditbased shaper logic subtracts it from the accumulated credit when Channel 1 is selected for transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER92_CHANNEL1HICREDITREGISTER</name>
          <description>Contains the hiCredit value required for the creditbased shaper algorithm for Channel 1</description>
          <addressOffset>0x1170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH1_HC</name>
              <description>hiCredit This field contains the hiCredit value required for the creditbased shaper algorithm for Channel 1 This is the maximum value that can be accumulated in the credit parameter This is specified in bits scaled by 1,024 The maximum value is maxInterferenceSize, that is, besteffort maximum frame size which is 16,384 bytes or 131,072 bits The value to be specified is 131,072 * 1,024 = 134,217,728 or 0x0800_0000</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTER93_CHANNEL1LOCREDITREGISTER</name>
          <description>Contains the loCredit value required for the creditbased shaper algorithm for Channel 1</description>
          <addressOffset>0x1174</addressOffset>
          <size>32</size>
          <resetValue>0x1fffffff</resetValue>
          <fields>
            <field>
              <name>CH1_LC</name>
              <description>loCredit This field contains the loCredit value required for the creditbased shaper algorithm for Channel 1 This is the minimum value that can be accumulated in the credit parameter This is specified in bits scaled by 1,024 The maximum value is maxInterferenceSize, that is, besteffort maximum frame size which is 16,384 bytes or 131,072 bits The value to be specified is 131,072 * 1,024 = 134,217,728 or 0x0800_0000 The programmed value is 2's complement _negative number_, that is, 0xF800_0000</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
