esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO</name>
      <description>General Purpose Input/Output</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x20583000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6a4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO_INT0</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>GPIO_INT1</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>GPIO_INT2</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>GPIO_INT3</name>
        <value>64</value>
      </interrupt>
      <registers>
        <register>
          <name>STRAP</name>
          <description>Strapping pin register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STRAPPING</name>
              <description>Represents the values of GPIO strapping pins. (need update the description, for example)

    - bit0: invalid
    - bit1: MTMS
    - bit2: MTDI
    - bit3: GPIO27
    - bit4: GPIO28
    - bit5: GPIO7
    - bit6 ~ bit15: invalid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT</name>
          <description>GPIO output register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_ORIG</name>
              <description>Configures the output value of GPIO0 ~ 31 output in simple GPIO output mode.\\
0: Low level\\
1: High level\\
The value of bit0 ~ bit31 correspond to the output value of GPIO0 ~ GPIO31 respectively. Bitxx ~ bitxx is invalid.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_W1TS</name>
          <description>GPIO output set register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_W1TS</name>
              <description>Configures whether or not to set the output register GPIO_OUT_REG of GPIO0 ~ GPIO31.\\
0: Not set\\
1: The corresponding bit in GPIO_OUT_REG will be set to 1\\
Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. \\
Recommended operation: use this register to set GPIO_OUT_REG. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_W1TC</name>
          <description>GPIO output clear register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_W1TC</name>
              <description>Configures whether or not to clear the output register GPIO_OUT_REG of GPIO0 ~ GPIO31 output.\\
0: Not clear\\
1: The corresponding bit in GPIO_OUT_REG will be cleared.\\
Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. \\
Recommended operation: use this register to clear GPIO_OUT_REG. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT1</name>
          <description>GPIO output register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_ORIG</name>
              <description>Configures the output value of GPIO32 ~ 63 output in simple GPIO output mode.\\
0: Low level\\
1: High level\\
The value of bit32 ~ bit63 correspond to the output value of GPIO32 ~ GPIO63 respectively. Bitxx ~ bitxx is invalid.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT1_W1TS</name>
          <description>GPIO output set register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT1_W1TS</name>
              <description>Configures whether or not to set the output register GPIO_OUT1_REG of GPIO32 ~ GPIO63.\\
0: Not set\\
1: The corresponding bit in GPIO_OUT1_REG will be set to 1\\
Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. \\
Recommended operation: use this register to set GPIO_OUT1_REG. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT1_W1TC</name>
          <description>GPIO output clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT1_W1TC</name>
              <description>Configures whether or not to clear the output register GPIO_OUT1_REG of GPIO32 ~ GPIO63 output.\\
0: Not clear\\
1: The corresponding bit in GPIO_OUT1_REG will be cleared.\\
Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. \\
Recommended operation: use this register to clear GPIO_OUT1_REG. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT2</name>
          <description>GPIO output register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_ORIG</name>
              <description>Configures the output value of GPIO64 ~ 66 output in simple GPIO output mode.\\
0: Low level\\
1: High level\\
The value of bit64 ~ bit66 correspond to the output value of GPIO64 ~ GPIO66 respectively. Bitxx ~ bitxx is invalid.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT2_W1TS</name>
          <description>GPIO output set register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT2_W1TS</name>
              <description>Configures whether or not to set the output register GPIO_OUT2_REG of GPIO64 ~ GPIO66.\\
0: Not set\\
1: The corresponding bit in GPIO_OUT2_REG will be set to 1\\
Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. \\
Recommended operation: use this register to set GPIO_OUT2_REG. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT2_W1TC</name>
          <description>GPIO output clear register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT2_W1TC</name>
              <description>Configures whether or not to clear the output register GPIO_OUT2_REG of GPIO64 ~ GPIO66 output.\\
0: Not clear\\
1: The corresponding bit in GPIO_OUT2_REG will be cleared.\\
Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. \\
Recommended operation: use this register to clear GPIO_OUT2_REG. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>GPIO output enable register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Configures whether or not to enable the output of GPIO0 ~ GPIO31.\\
0: Not enable\\
1: Enable\\
Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE_W1TS</name>
          <description>GPIO output enable set register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE_W1TS</name>
              <description>Configures whether or not to set the output enable register GPIO_ENABLE_REG of GPIO0 ~ GPIO31.\\
0: Not set\\
1: The corresponding bit in GPIO_ENABLE_REG will be set to 1\\
Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. \\
Recommended operation: use this register to set GPIO_ENABLE_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE_W1TC</name>
          <description>GPIO output enable clear register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE_W1TC</name>
              <description>Configures whether or not to clear the output enable register GPIO_ENABLE_REG of GPIO0 ~ GPIO31. \\
0: Not clear\\
1: The corresponding bit in GPIO_ENABLE_REG will be cleared\\
Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. \\
Recommended operation: use this register to clear GPIO_ENABLE_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE1</name>
          <description>GPIO output enable register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Configures whether or not to enable the output of GPIO32 ~ GPIO63.\\
0: Not enable\\
1: Enable\\
Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE1_W1TS</name>
          <description>GPIO output enable set register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE1_W1TS</name>
              <description>Configures whether or not to set the output enable register GPIO_ENABLE1_REG of GPIO32 ~ GPIO63.\\
0: Not set\\
1: The corresponding bit in GPIO_ENABLE1_REG will be set to 1\\
Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. \\
Recommended operation: use this register to set GPIO_ENABLE1_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE1_W1TC</name>
          <description>GPIO output enable clear register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE1_W1TC</name>
              <description>Configures whether or not to clear the output enable register GPIO_ENABLE1_REG of GPIO32 ~ GPIO63. \\
0: Not clear\\
1: The corresponding bit in GPIO_ENABLE1_REG will be cleared\\
Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. \\
Recommended operation: use this register to clear GPIO_ENABLE1_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE2</name>
          <description>GPIO output enable register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Configures whether or not to enable the output of GPIO64 ~ GPIO66.\\
0: Not enable\\
1: Enable\\
Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE2_W1TS</name>
          <description>GPIO output enable set register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE2_W1TS</name>
              <description>Configures whether or not to set the output enable register GPIO_ENABLE2_REG of GPIO64 ~ GPIO66.\\
0: Not set\\
1: The corresponding bit in GPIO_ENABLE2_REG will be set to 1\\
Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. \\
Recommended operation: use this register to set GPIO_ENABLE2_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE2_W1TC</name>
          <description>GPIO output enable clear register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE2_W1TC</name>
              <description>Configures whether or not to clear the output enable register GPIO_ENABLE2_REG of GPIO64 ~ GPIO66. \\
0: Not clear\\
1: The corresponding bit in GPIO_ENABLE2_REG will be cleared\\
Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. \\
Recommended operation: use this register to clear GPIO_ENABLE2_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN</name>
          <description>GPIO input register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_NEXT</name>
              <description>Represents the input value of GPIO0 ~ GPIO31. Each bit represents a pin input value:\\
0: Low level\\
1: High level\\
Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN1</name>
          <description>GPIO input register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_NEXT</name>
              <description>Represents the input value of GPIO32 ~ GPIO63. Each bit represents a pin input value:\\
0: Low level\\
1: High level\\
Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN2</name>
          <description>GPIO input register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_NEXT</name>
              <description>Represents the input value of GPIO64 ~ GPIO66. Each bit represents a pin input value:\\
0: Low level\\
1: High level\\
Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>GPIO interrupt status register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTERRUPT</name>
              <description>The interrupt status of GPIO0 ~ GPIO31, can be configured by the software.

    - Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.
    - Each bit represents the status of its corresponding GPIO:

        - 0: Represents the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE, or this bit is configured to 0 by the software.
        - 1: Represents the GPIO generates the interrupt configured by GPIO_PIN0_INT_TYPE, or this bit is configured to 1 by the software.
    </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_W1TS</name>
          <description>GPIO interrupt status set register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_W1TS</name>
              <description>Configures whether or not to set the interrupt status register GPIO_STATUS_INTERRUPT of GPIO0 ~ GPIO31.

    - Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.
    - If the value 1 is written to a bit here, the corresponding bit in GPIO_STATUS_INTERRUPT will be set to 1. \item Recommended operation: use this register to set GPIO_STATUS_INTERRUPT. </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_W1TC</name>
          <description>GPIO interrupt status clear register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_W1TC</name>
              <description>Configures whether or not to clear the interrupt status register GPIO_STATUS_INTERRUPT of GPIO0 ~ GPIO31.

    - Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.
    - If the value 1 is written to a bit here, the corresponding bit in GPIO_STATUS_INTERRUPT will be cleared. \item Recommended operation: use this register to clear GPIO_STATUS_INTERRUPT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS1</name>
          <description>GPIO interrupt status register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTERRUPT</name>
              <description>The interrupt status of GPIO32 ~ GPIO63, can be configured by the software.

    - Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.
    - Each bit represents the status of its corresponding GPIO:

        - 0: Represents the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE, or this bit is configured to 0 by the software.
        - 1: Represents the GPIO generates the interrupt configured by GPIO_PIN0_INT_TYPE, or this bit is configured to 1 by the software.
    </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS1_W1TS</name>
          <description>GPIO interrupt status set register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS1_W1TS</name>
              <description>Configures whether or not to set the interrupt status register GPIO_STATUS1_INTERRUPT of GPIO32 ~ GPIO63.

    - Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.
    - If the value 1 is written to a bit here, the corresponding bit in GPIO_STATUS1_INTERRUPT will be set to 1. \item Recommended operation: use this register to set GPIO_STATUS1_INTERRUPT. </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS1_W1TC</name>
          <description>GPIO interrupt status clear register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS1_W1TC</name>
              <description>Configures whether or not to clear the interrupt status register GPIO_STATUS1_INTERRUPT of GPIO32 ~ GPIO63.

    - Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.
    - If the value 1 is written to a bit here, the corresponding bit in GPIO_STATUS1_INTERRUPT will be cleared. \item Recommended operation: use this register to clear GPIO_STATUS1_INTERRUPT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS2</name>
          <description>GPIO interrupt status register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTERRUPT</name>
              <description>The interrupt status of GPIO64 ~ GPIO66, can be configured by the software.

