esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
    - Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.
    - Each bit represents the status of its corresponding GPIO:

        - 0: Represents the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE, or this bit is configured to 0 by the software.
        - 1: Represents the GPIO generates the interrupt configured by GPIO_PIN0_INT_TYPE, or this bit is configured to 1 by the software.
    </description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS2_W1TS</name>
          <description>GPIO interrupt status set register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS2_W1TS</name>
              <description>Configures whether or not to set the interrupt status register GPIO_STATUS2_INTERRUPT of GPIO64 ~ GPIO66.

    - Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.
    - If the value 1 is written to a bit here, the corresponding bit in GPIO_STATUS2_INTERRUPT will be set to 1. \item Recommended operation: use this register to set GPIO_STATUS2_INTERRUPT. </description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS2_W1TC</name>
          <description>GPIO interrupt status clear register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS2_W1TC</name>
              <description>Configures whether or not to clear the interrupt status register GPIO_STATUS2_INTERRUPT of GPIO64 ~ GPIO66.

    - Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.
    - If the value 1 is written to a bit here, the corresponding bit in GPIO_STATUS2_INTERRUPT will be cleared. \item Recommended operation: use this register to clear GPIO_STATUS2_INTERRUPT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_0</name>
          <description>GPIO_INT_0 interrupt status register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_0</name>
              <description>Represents the GPIO_INT_0 interrupt status of GPIO0 ~ GPIO31. Each bit represents:(need update in different project)\\
0: Represents GPIO_INT_0 interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the GPIO_INT_0 interrupt is enabled.\\
Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. This interrupt status is corresponding to the bit in GPIO_STATUS_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_1</name>
          <description>GPIO_INT_1 interrupt status register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_1</name>
              <description>Represents the GPIO_INT_1 interrupt status of GPIO0 ~ GPIO31. Each bit represents:(need update in different project)\\
0: Represents GPIO_INT_1 interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the GPIO_INT_1 interrupt is enabled.\\
Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. This interrupt status is corresponding to the bit in GPIO_STATUS_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_2</name>
          <description>GPIO_INT_2 interrupt status register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_2</name>
              <description>Represents the GPIO_INT_2 interrupt status of GPIO0 ~ GPIO31. Each bit represents:(need update in different project)\\
0: Represents GPIO_INT_2 interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the GPIO_INT_2 interrupt is enabled.\\
Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. This interrupt status is corresponding to the bit in GPIO_STATUS_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_3</name>
          <description>GPIO_INT_3 interrupt status register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_3</name>
              <description>Represents the GPIO_INT_3 interrupt status of GPIO0 ~ GPIO31. Each bit represents:(need update in different project)\\
0: Represents GPIO_INT_3 interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the GPIO_INT_3 interrupt is enabled.\\
Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. This interrupt status is corresponding to the bit in GPIO_STATUS_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_01</name>
          <description>GPIO_INT_0 interrupt status register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_01</name>
              <description>Represents the GPIO_INT_0 interrupt status of GPIO32 ~ GPIO63. Each bit represents:(need update in different project)\\
0: Represents GPIO_INT_0 interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the GPIO_INT_0 interrupt is enabled.\\
Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. This interrupt status is corresponding to the bit in GPIO_STATUS1_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_11</name>
          <description>GPIO_INT_1 interrupt status register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_11</name>
              <description>Represents the GPIO_INT_1 interrupt status of GPIO32 ~ GPIO63. Each bit represents:(need update in different project)\\
0: Represents GPIO_INT_1 interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the GPIO_INT_1 interrupt is enabled.\\
Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. This interrupt status is corresponding to the bit in GPIO_STATUS1_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_21</name>
          <description>GPIO_INT_2 interrupt status register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_21</name>
              <description>Represents the GPIO_INT_2 interrupt status of GPIO32 ~ GPIO63. Each bit represents:(need update in different project)\\
0: Represents GPIO_INT_2 interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the GPIO_INT_2 interrupt is enabled.\\
Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. This interrupt status is corresponding to the bit in GPIO_STATUS1_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_31</name>
          <description>GPIO_INT_3 interrupt status register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_31</name>
              <description>Represents the GPIO_INT_3 interrupt status of GPIO32 ~ GPIO63. Each bit represents:(need update in different project)\\
0: Represents GPIO_INT_3 interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the GPIO_INT_3 interrupt is enabled.\\
Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. This interrupt status is corresponding to the bit in GPIO_STATUS1_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_02</name>
          <description>GPIO_INT_0 interrupt status register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_02</name>
              <description>Represents the GPIO_INT_0 interrupt status of GPIO64 ~ GPIO66. Each bit represents:(need update in different project)\\
0: Represents GPIO_INT_0 interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the GPIO_INT_0 interrupt is enabled.\\
Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. This interrupt status is corresponding to the bit in GPIO_STATUS2_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_12</name>
          <description>GPIO_INT_1 interrupt status register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_12</name>
              <description>Represents the GPIO_INT_1 interrupt status of GPIO64 ~ GPIO66. Each bit represents:(need update in different project)\\
0: Represents GPIO_INT_1 interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the GPIO_INT_1 interrupt is enabled.\\
Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. This interrupt status is corresponding to the bit in GPIO_STATUS2_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_22</name>
          <description>GPIO_INT_2 interrupt status register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_22</name>
              <description>Represents the GPIO_INT_2 interrupt status of GPIO64 ~ GPIO66. Each bit represents:(need update in different project)\\
0: Represents GPIO_INT_2 interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the GPIO_INT_2 interrupt is enabled.\\
Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. This interrupt status is corresponding to the bit in GPIO_STATUS2_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_32</name>
          <description>GPIO_INT_3 interrupt status register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_32</name>
              <description>Represents the GPIO_INT_3 interrupt status of GPIO64 ~ GPIO66. Each bit represents:(need update in different project)\\
0: Represents GPIO_INT_3 interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the GPIO_INT_3 interrupt is enabled.\\
Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. This interrupt status is corresponding to the bit in GPIO_STATUS2_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_NEXT</name>
          <description>GPIO interrupt source register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_INTERRUPT_NEXT</name>
              <description>Represents the interrupt source signal of GPIO0 ~ GPIO31.\\
Bit0 ~ bit24 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. Each bit represents:\\
0: The GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: The GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE.\\
The interrupt could be rising edge interrupt, falling edge interrupt, level sensitive interrupt and any edge interrupt.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_NEXT1</name>
          <description>GPIO interrupt source register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_INTERRUPT_NEXT1</name>
              <description>Represents the interrupt source signal of GPIO32 ~ GPIO63.\\
Bit0 ~ bit24 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. Each bit represents:\\
0: The GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: The GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE.\\
The interrupt could be rising edge interrupt, falling edge interrupt, level sensitive interrupt and any edge interrupt.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_NEXT2</name>
          <description>GPIO interrupt source register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_INTERRUPT_NEXT2</name>
              <description>Represents the interrupt source signal of GPIO64 ~ GPIO66.\\
Bit0 ~ bit24 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. Each bit represents:\\
0: The GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: The GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE.\\
The interrupt could be rising edge interrupt, falling edge interrupt, level sensitive interrupt and any edge interrupt.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>63</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PIN%s</name>
          <description>GPIO%s configuration register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select pin drive mode. \\
0: Normal output\\
1: Open drain output \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO interrupt type.\\
0: GPIO interrupt disabled\\
1: Rising edge trigger\\
2: Falling edge trigger\\
3: Any edge trigger\\
4: Low level trigger\\
5: High level trigger\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO wake-up function.\\
0: Disable\\
1: Enable\\
This function only wakes up the CPU from Light-sleep. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_ENA</name>
              <description>Configures whether or not to enable gpio_int_0 or gpio_int_1 or gpio_int_2 or gpio_int_3(need update in different project).

    - bit13: Configures whether or not to enable gpio_int_0(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit14: Configures whether or not to enable gpio_int_1(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit15: Configures whether or not to enable gpio_int_2(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit16: Configures whether or not to enable gpio_int_3(need update in different project):\\
    0: Disable\\
    1: Enable\\
    - bit17: invalid</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN63</name>
          <description>GPIO$n configuration register</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select pin drive mode. \\
0: Normal output\\
1: Open drain output \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO interrupt type.\\
0: GPIO interrupt disabled\\
1: Rising edge trigger\\
2: Falling edge trigger\\
3: Any edge trigger\\
4: Low level trigger\\
5: High level trigger\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO wake-up function.\\
0: Disable\\
1: Enable\\
This function only wakes up the CPU from Light-sleep. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_ENA</name>
              <description>Configures whether or not to enable gpio_int_0 or gpio_int_1 or gpio_int_2 or gpio_int_3(need update in different project).

