esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
    - bit13: Configures whether or not to enable gpio_int_0(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit14: Configures whether or not to enable gpio_int_1(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit15: Configures whether or not to enable gpio_int_2(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit16: Configures whether or not to enable gpio_int_3(need update in different project):\\
    0: Disable\\
    1: Enable\\
    - bit17: invalid</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN64</name>
          <description>GPIO$n configuration register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select pin drive mode. \\
0: Normal output\\
1: Open drain output \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO interrupt type.\\
0: GPIO interrupt disabled\\
1: Rising edge trigger\\
2: Falling edge trigger\\
3: Any edge trigger\\
4: Low level trigger\\
5: High level trigger\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO wake-up function.\\
0: Disable\\
1: Enable\\
This function only wakes up the CPU from Light-sleep. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_ENA</name>
              <description>Configures whether or not to enable gpio_int_0 or gpio_int_1 or gpio_int_2 or gpio_int_3(need update in different project).

    - bit13: Configures whether or not to enable gpio_int_0(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit14: Configures whether or not to enable gpio_int_1(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit15: Configures whether or not to enable gpio_int_2(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit16: Configures whether or not to enable gpio_int_3(need update in different project):\\
    0: Disable\\
    1: Enable\\
    - bit17: invalid</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN65</name>
          <description>GPIO$n configuration register</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select pin drive mode. \\
0: Normal output\\
1: Open drain output \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO interrupt type.\\
0: GPIO interrupt disabled\\
1: Rising edge trigger\\
2: Falling edge trigger\\
3: Any edge trigger\\
4: Low level trigger\\
5: High level trigger\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO wake-up function.\\
0: Disable\\
1: Enable\\
This function only wakes up the CPU from Light-sleep. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_ENA</name>
              <description>Configures whether or not to enable gpio_int_0 or gpio_int_1 or gpio_int_2 or gpio_int_3(need update in different project).

    - bit13: Configures whether or not to enable gpio_int_0(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit14: Configures whether or not to enable gpio_int_1(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit15: Configures whether or not to enable gpio_int_2(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit16: Configures whether or not to enable gpio_int_3(need update in different project):\\
    0: Disable\\
    1: Enable\\
    - bit17: invalid</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN66</name>
          <description>GPIO$n configuration register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select pin drive mode. \\
0: Normal output\\
1: Open drain output \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO interrupt type.\\
0: GPIO interrupt disabled\\
1: Rising edge trigger\\
2: Falling edge trigger\\
3: Any edge trigger\\
4: Low level trigger\\
5: High level trigger\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO wake-up function.\\
0: Disable\\
1: Enable\\
This function only wakes up the CPU from Light-sleep. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_ENA</name>
              <description>Configures whether or not to enable gpio_int_0 or gpio_int_1 or gpio_int_2 or gpio_int_3(need update in different project).

    - bit13: Configures whether or not to enable gpio_int_0(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit14: Configures whether or not to enable gpio_int_1(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit15: Configures whether or not to enable gpio_int_2(need update in different project):\\
    0: Disable\\
    1: Enable\\    - bit16: Configures whether or not to enable gpio_int_3(need update in different project):\\
    0: Disable\\
    1: Enable\\
    - bit17: invalid</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x2f4</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 63 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
61: Select GPIO61\\
62: Select GPIO62\\
Or\\
0x80: A constantly high input\\
0xc0: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>31</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <resetValue>0xc0</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 63 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
61: Select GPIO61\\
62: Select GPIO62\\
Or\\
0x80: A constantly high input\\
0xc0: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x3a0</addressOffset>
          <size>32</size>
          <resetValue>0xc0</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 63 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
61: Select GPIO61\\
62: Select GPIO62\\
Or\\
0x80: A constantly high input\\
0xc0: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x3b0</addressOffset>
          <size>32</size>
          <resetValue>0xc0</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 63 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
61: Select GPIO61\\
62: Select GPIO62\\
Or\\
0x80: A constantly high input\\
0xc0: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 63 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
61: Select GPIO61\\
62: Select GPIO62\\
Or\\
0x80: A constantly high input\\
0xc0: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>18</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x4cc</addressOffset>
          <size>32</size>
          <resetValue>0xc0</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 63 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
61: Select GPIO61\\
62: Select GPIO62\\
Or\\
0x80: A constantly high input\\
0xc0: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <resetValue>0xc0</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 63 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
61: Select GPIO61\\
62: Select GPIO62\\
Or\\
0x80: A constantly high input\\
0xc0: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>54</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x56c</addressOffset>
          <size>32</size>
          <resetValue>0xc0</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 63 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
61: Select GPIO61\\
62: Select GPIO62\\
Or\\
0x80: A constantly high input\\
0xc0: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
