esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <dim>36</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x64c</addressOffset>
          <size>32</size>
          <resetValue>0xc0</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 63 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
61: Select GPIO61\\
62: Select GPIO62\\
Or\\
0x80: A constantly high input\\
0xc0: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x6e0</addressOffset>
          <size>32</size>
          <resetValue>0xc0</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 63 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
61: Select GPIO61\\
62: Select GPIO62\\
Or\\
0x80: A constantly high input\\
0xc0: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>63</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO%s output</description>
          <addressOffset>0xaf4</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO%s.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit %s of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\
1: Force the output enable signal to be sourced from bit %s of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC63_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xbf0</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC63_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC63_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC63_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC63_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC64_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xbf4</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC64_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC64_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC64_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC64_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC65_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xbf8</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC65_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC65_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC65_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC65_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC66_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xbfc</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC66_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC66_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC66_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC66_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>GPIO clock gate register</description>
          <addressOffset>0xdf8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether or not to enable clock gate.\\
0: Not enable\\
1: Enable, the clock is free running. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>GPIO version register</description>
          <addressOffset>0xdfc</addressOffset>
          <size>32</size>
          <resetValue>0x2508150</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
