esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>ETM_TASK_P4_CFG</name>
          <description>GPIO selection register 4 for ETM</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO20_SEL</name>
              <description>Configures to select an ETM task channel for GPIO20.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO20_EN</name>
              <description>Configures whether or not to enable GPIO20 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO21_SEL</name>
              <description>Configures to select an ETM task channel for GPIO21.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO21_EN</name>
              <description>Configures whether or not to enable GPIO21 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO22_SEL</name>
              <description>Configures to select an ETM task channel for GPIO22.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO22_EN</name>
              <description>Configures whether or not to enable GPIO22 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO23_SEL</name>
              <description>Configures to select an ETM task channel for GPIO23.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO23_EN</name>
              <description>Configures whether or not to enable GPIO23 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO24_SEL</name>
              <description>Configures to select an ETM task channel for GPIO24.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO24_EN</name>
              <description>Configures whether or not to enable GPIO24 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P5_CFG</name>
          <description>GPIO selection register 5 for ETM</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO25_SEL</name>
              <description>Configures to select an ETM task channel for GPIO25.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO25_EN</name>
              <description>Configures whether or not to enable GPIO25 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO26_SEL</name>
              <description>Configures to select an ETM task channel for GPIO26.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO26_EN</name>
              <description>Configures whether or not to enable GPIO26 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO27_SEL</name>
              <description>Configures to select an ETM task channel for GPIO27.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO27_EN</name>
              <description>Configures whether or not to enable GPIO27 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO28_SEL</name>
              <description>Configures to select an ETM task channel for GPIO28.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO28_EN</name>
              <description>Configures whether or not to enable GPIO28 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO29_SEL</name>
              <description>Configures to select an ETM task channel for GPIO29.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO29_EN</name>
              <description>Configures whether or not to enable GPIO29 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P6_CFG</name>
          <description>GPIO selection register 6 for ETM</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO30_SEL</name>
              <description>Configures to select an ETM task channel for GPIO30.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO30_EN</name>
              <description>Configures whether or not to enable GPIO30 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO31_SEL</name>
              <description>Configures to select an ETM task channel for GPIO31.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO31_EN</name>
              <description>Configures whether or not to enable GPIO31 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO32_SEL</name>
              <description>Configures to select an ETM task channel for GPIO32.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO32_EN</name>
              <description>Configures whether or not to enable GPIO32 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO33_SEL</name>
              <description>Configures to select an ETM task channel for GPIO33.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO33_EN</name>
              <description>Configures whether or not to enable GPIO33 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO34_SEL</name>
              <description>Configures to select an ETM task channel for GPIO34.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO34_EN</name>
              <description>Configures whether or not to enable GPIO34 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P7_CFG</name>
          <description>GPIO selection register 7 for ETM</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO35_SEL</name>
              <description>Configures to select an ETM task channel for GPIO35.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO35_EN</name>
              <description>Configures whether or not to enable GPIO35 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO36_SEL</name>
              <description>Configures to select an ETM task channel for GPIO36.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO36_EN</name>
              <description>Configures whether or not to enable GPIO36 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO37_SEL</name>
              <description>Configures to select an ETM task channel for GPIO37.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO37_EN</name>
              <description>Configures whether or not to enable GPIO37 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO38_SEL</name>
              <description>Configures to select an ETM task channel for GPIO38.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO38_EN</name>
              <description>Configures whether or not to enable GPIO38 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO39_SEL</name>
              <description>Configures to select an ETM task channel for GPIO39.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO39_EN</name>
              <description>Configures whether or not to enable GPIO39 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P8_CFG</name>
          <description>GPIO selection register 8 for ETM</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO40_SEL</name>
              <description>Configures to select an ETM task channel for GPIO40.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO40_EN</name>
              <description>Configures whether or not to enable GPIO40 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO41_SEL</name>
              <description>Configures to select an ETM task channel for GPIO41.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO41_EN</name>
              <description>Configures whether or not to enable GPIO41 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO42_SEL</name>
              <description>Configures to select an ETM task channel for GPIO42.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO42_EN</name>
              <description>Configures whether or not to enable GPIO42 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO43_SEL</name>
              <description>Configures to select an ETM task channel for GPIO43.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO43_EN</name>
              <description>Configures whether or not to enable GPIO43 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO44_SEL</name>
              <description>Configures to select an ETM task channel for GPIO44.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO44_EN</name>
              <description>Configures whether or not to enable GPIO44 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P9_CFG</name>
          <description>GPIO selection register 9 for ETM</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO45_SEL</name>
              <description>Configures to select an ETM task channel for GPIO45.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO45_EN</name>
              <description>Configures whether or not to enable GPIO45 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO46_SEL</name>
              <description>Configures to select an ETM task channel for GPIO46.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO46_EN</name>
              <description>Configures whether or not to enable GPIO46 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO47_SEL</name>
              <description>Configures to select an ETM task channel for GPIO47.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO47_EN</name>
              <description>Configures whether or not to enable GPIO47 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO48_SEL</name>
              <description>Configures to select an ETM task channel for GPIO48.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO48_EN</name>
              <description>Configures whether or not to enable GPIO48 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO49_SEL</name>
              <description>Configures to select an ETM task channel for GPIO49.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO49_EN</name>
              <description>Configures whether or not to enable GPIO49 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
