esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>ETM_TASK_P10_CFG</name>
          <description>GPIO selection register 10 for ETM</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO50_SEL</name>
              <description>Configures to select an ETM task channel for GPIO50.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO50_EN</name>
              <description>Configures whether or not to enable GPIO50 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO51_SEL</name>
              <description>Configures to select an ETM task channel for GPIO51.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO51_EN</name>
              <description>Configures whether or not to enable GPIO51 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO52_SEL</name>
              <description>Configures to select an ETM task channel for GPIO52.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO52_EN</name>
              <description>Configures whether or not to enable GPIO52 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO53_SEL</name>
              <description>Configures to select an ETM task channel for GPIO53.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO53_EN</name>
              <description>Configures whether or not to enable GPIO53 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO54_SEL</name>
              <description>Configures to select an ETM task channel for GPIO54.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO54_EN</name>
              <description>Configures whether or not to enable GPIO54 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P11_CFG</name>
          <description>GPIO selection register 11 for ETM</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO55_SEL</name>
              <description>Configures to select an ETM task channel for GPIO55.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO55_EN</name>
              <description>Configures whether or not to enable GPIO55 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO56_SEL</name>
              <description>Configures to select an ETM task channel for GPIO56.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO56_EN</name>
              <description>Configures whether or not to enable GPIO56 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO57_SEL</name>
              <description>Configures to select an ETM task channel for GPIO57.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO57_EN</name>
              <description>Configures whether or not to enable GPIO57 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO58_SEL</name>
              <description>Configures to select an ETM task channel for GPIO58.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO58_EN</name>
              <description>Configures whether or not to enable GPIO58 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO59_SEL</name>
              <description>Configures to select an ETM task channel for GPIO59.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO59_EN</name>
              <description>Configures whether or not to enable GPIO59 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P12_CFG</name>
          <description>GPIO selection register 12 for ETM</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO60_SEL</name>
              <description>Configures to select an ETM task channel for GPIO60.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO60_EN</name>
              <description>Configures whether or not to enable GPIO60 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO61_SEL</name>
              <description>Configures to select an ETM task channel for GPIO61.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO61_EN</name>
              <description>Configures whether or not to enable GPIO61 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO62_SEL</name>
              <description>Configures to select an ETM task channel for GPIO62.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO62_EN</name>
              <description>Configures whether or not to enable GPIO62 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Version control register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <resetValue>0x2508150</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
