esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HMAC</name>
      <description>HMAC (Hash-based Message Authentication Code) Accelerator</description>
      <groupName>HMAC</groupName>
      <baseAddress>0x2050d000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xa8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SET_START</name>
          <description>HMAC start control register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_START</name>
              <description>Configures whether or not to enable HMAC.
\\0: Disable HMAC
\\1: Enable HMAC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_PARA_PURPOSE</name>
          <description>HMAC parameter configuration register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PURPOSE_SET</name>
              <description>Configures the HMAC purpose, refer to the Table &lt;a href=tab:hmac-key-purpose&quot;&gt;link&lt;/a&gt;. &quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_PARA_KEY</name>
          <description>HMAC parameters configuration register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_SET</name>
              <description>Configures HMAC key. There are six keys with index 0~5. Write the index of the selected key to this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_PARA_FINISH</name>
          <description>HMAC configuration completion register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_PARA_END</name>
              <description>Configures whether to finish HMAC configuration.
\\0: No effect
\\1: Finish configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_MESSAGE_ONE</name>
          <description>HMAC message control register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_TEXT_ONE</name>
              <description>Calls SHA to calculate one message block.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_MESSAGE_ING</name>
          <description>HMAC message continue register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_TEXT_ING</name>
              <description>Configures whether or not there are unprocessed message blocks.
\\0: No unprocessed message block
\\1: There are still some message blocks to be processed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_MESSAGE_END</name>
          <description>HMAC message end register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_TEXT_END</name>
              <description>Configures whether to start hardware padding.
\\0: No effect
\\1: Start hardware padding</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_RESULT_FINISH</name>
          <description>HMAC result reading finish register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_RESULT_END</name>
              <description>Configures whether to exit upstream mode and clear calculation results.
\\0: Not exit
\\1: Exit upstream mode and clear calculation results.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_INVALIDATE_JTAG</name>
          <description>Invalidate JTAG result register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_INVALIDATE_JTAG</name>
              <description>Configures whether or not to clear calculation results when re-enabling JTAG in downstream mode.
\\0: Not clear
\\1: Clear calculation results</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_INVALIDATE_DS</name>
          <description>Invalidate digital signature result register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_INVALIDATE_DS</name>
              <description>Configures whether or not to clear calculation results of the DS module in downstream mode.
\\0: Not clear
\\1: Clear calculation results</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_ERROR</name>
          <description>Stores matching results between keys generated by users and corresponding purposes</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QUREY_CHECK</name>
              <description>Represents whether or not an HMAC key matches the purpose.
\\0: Match
\\1: Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_BUSY</name>
          <description>Busy state of HMAC module</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUSY_STATE</name>
              <description>Represents whether or not HMAC is in a busy state. Before configuring HMAC, please make sure HMAC is in an IDLE state.
\\0: Idle
\\1: HMAC is still working on the calculation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_LIMIT</name>
          <description>HMAC timeout limit configurate register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>TIMEOUT_LIMIT</name>
              <description>The timeout limitation for waiting sub-IP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>WR_MESSAGE_MEM[%s]</name>
          <description>Message block memory.</description>
          <addressOffset>0x80</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>RD_RESULT_MEM[%s]</name>
          <description>Result from upstream.</description>
          <addressOffset>0xc0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>SET_MESSAGE_PAD</name>
          <description>Software padding register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_TEXT_PAD</name>
              <description>Configures whether or not the padding is applied by software.
\\0: Not applied by software
\\1: Applied by software</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ONE_BLOCK</name>
          <description>One block message register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET_ONE_BLOCK</name>
              <description>Write 1 to indicate there is only one block which already contains padding bits and there is no need for padding.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOFT_JTAG_CTRL</name>
          <description>Jtag register 0.</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SOFT_JTAG_CTRL</name>
              <description>Configures whether or not to enable JTAG authentication mode.
\\0: Disable
\\1: Enable
\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_JTAG</name>
          <description>Re-enable JTAG register 1</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WR_JTAG</name>
              <description>Writes the comparing input used for re-enabling JTAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <resetValue>0x20250819</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Hmac date information/ hmac version information.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
