esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HP_ALIVE_SYS</name>
      <description>HP_ALIVE_SYS Peripheral</description>
      <groupName>HP_ALIVE_SYS</groupName>
      <baseAddress>0x20589000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x84</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>HP_CLK_CTRL</name>
          <description>HP Clock Control Register.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0xfffe0000</resetValue>
          <fields>
            <field>
              <name>HP_XTALX2_80M_CLK_EN</name>
              <description>XTALx2 80M Clock Enalbe.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ROOT_CLK_EN</name>
              <description>HP SoC Root Clock Enable.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_XTAL_32K_CLK_EN</name>
              <description>XTAL 32K Clock Enable.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_RC_32K_CLK_EN</name>
              <description>RC 32K Clock Enable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SOSC_150K_CLK_EN</name>
              <description>SOSC 150K Clock Enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_PLL_80M_CLK_EN</name>
              <description>PLL 8M Clock Enable.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_AUDIO_PLL_CLK_EN</name>
              <description>AUDIO PLL Clock Enable.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SDIO_PLL2_CLK_EN</name>
              <description>reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SDIO_PLL1_CLK_EN</name>
              <description>reserved</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SDIO_PLL0_CLK_EN</name>
              <description>reserved</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_FOSC_20M_CLK_EN</name>
              <description>FOSC 20M Clock Enable.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_XTAL_40M_CLK_EN</name>
              <description>XTAL 40M Clock Enalbe.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CPLL_300M_CLK_EN</name>
              <description>CPLL 300M Clock Enable.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SPLL_480M_CLK_EN</name>
              <description>SPLL 480M Clock Enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MPLL_500M_CLK_EN</name>
              <description>MPLL 500M Clock Enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PAD_PARLIO_CTRL</name>
          <description>HP Clock Control Register.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0xc0000000</resetValue>
          <fields>
            <field>
              <name>HP_PAD_PARLIO_TX_CLK_EN</name>
              <description>PARLIO TX Clock From Pad Enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_PAD_PARLIO_RX_CLK_EN</name>
              <description>PARLIO RX Clock From Pad Enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PAD_I2S0_CTRL</name>
          <description>HP Clock Control Register.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>HP_PAD_I2S0_MCLK_EN</name>
              <description>I2S0 MCLK Clock From Pad Enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PAD_I2S1_CTRL</name>
          <description>HP Clock Control Register.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>HP_PAD_I2S1_MCLK_EN</name>
              <description>I2S1 MCLK Clock From Pad Enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PAD_UART0_CTRL</name>
          <description>HP Clock Control Register.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>HP_PAD_UART0_SLP_CLK_EN</name>
              <description>UART0 SLP Clock From Pad Enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PAD_UART1_CTRL</name>
          <description>HP Clock Control Register.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>HP_PAD_UART1_SLP_CLK_EN</name>
              <description>UART1 SLP Clock From Pad Enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PAD_UART2_CTRL</name>
          <description>HP Clock Control Register.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>HP_PAD_UART2_SLP_CLK_EN</name>
              <description>UART2 SLP Clock From Pad Enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PAD_UART3_CTRL</name>
          <description>HP Clock Control Register.</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>HP_PAD_UART3_SLP_CLK_EN</name>
              <description>UART3 SLP Clock From Pad Enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEM_CLK_AON</name>
          <description>need_des</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>SEL</name>
              <description>Modem clk aon sel. 0: foscl  1:xtal</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_OTGHS_PHY_CHRGVBUS</name>
              <description>phy chrgvbus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_OTGHS_PHY_DISCHRGVBUS</name>
              <description>phy dischrgvbus</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_OTGHS_PHY_DMPULLDOWN</name>
              <description>phy dmpulldown</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_OTGHS_PHY_DPPULLDOWN</name>
              <description>phy dppulldown</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_OTGHS_PHY_IDPULLUP</name>
              <description>phy idpullup</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TCM_MEM_LP_CTRL</name>
          <description>configure rmemory power in lp system register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_TCM_L0_MEM_LP_MODE</name>
              <description>Configures layer0  hp_sram memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TCM_L0_MEM_LP_EN</name>
              <description>Set this bit to power down layer0 hp_sram memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TCM_MEM_L0_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control layer0 hp_sram memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TCM_L1_MEM_LP_MODE</name>
              <description>Configures layer1  hp_sram memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TCM_L1_MEM_LP_EN</name>
              <description>Set this bit to power down layer1 hp_sram memory.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TCM_MEM_L1_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control layer1 hp_sram memory, disbale hardware control.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TCM_L2_MEM_LP_MODE</name>
              <description>Configures layer2  hp_sram memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TCM_L2_MEM_LP_EN</name>
              <description>Set this bit to power down layer2 hp_sram memory.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TCM_MEM_L2_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control layer2 hp_sram memory, disbale hardware control.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TCM_L3_MEM_LP_MODE</name>
              <description>Configures layer3  hp_sram memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TCM_L3_MEM_LP_EN</name>
              <description>Set this bit to power down layer3 hp_sram memory.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TCM_MEM_L3_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control layer3 hp_sram memory, disbale hardware control.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_MMU_MEM_LP_CTRL</name>
          <description>configure rmemory power in lp system register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_MMU_MEM_LP_MODE</name>
              <description>Configures flash_mmu memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_MMU_MEM_LP_EN</name>
              <description>Set this bit to power down flash_mmu memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_MMU_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control flash_mmu memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_MMU_MEM_LP_CTRL</name>
          <description>configure rmemory power in lp system register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PSRAM_MMU_MEM_LP_MODE</name>
              <description>Configures psram_mmu memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_MMU_MEM_LP_EN</name>
              <description>Set this bit to power down psram_mmu memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_MMU_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control psram_mmu memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPRAM_MEM_AUX_CTRL</name>
          <description>spram mem aux ctrl , control TOP/CNNT/MODEM power domain</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x2070</resetValue>
          <fields>
            <field>
              <name>SPRAM_MEM_AUX_CTRL</name>
              <description>spram mem aux ctrl , control TOP/CNNT/MODEM power domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPRF_MEM_AUX_CTRL</name>
          <description>sprf mem aux ctrl , control TOP/CNNT power domain</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x2070</resetValue>
          <fields>
            <field>
              <name>SPRF_MEM_AUX_CTRL</name>
              <description>sprf mem aux ctrl , control TOP/CNNT/MODEM power domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDPRF_MEM_AUX_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDPRF_MEM_AUX_CTRL</name>
              <description>sdprf mem aux ctrl , control TOP/CNNT/MODEM power domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_SPROM_MEM_AUX_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x70</resetValue>
          <fields>
            <field>
              <name>CPU_SPROM_MEM_AUX_CTRL</name>
              <description>sprom mem aux ctrl , control CPU power domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_SPRF_MEM_AUX_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x2070</resetValue>
          <fields>
            <field>
              <name>CPU_SPRF_MEM_AUX_CTRL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_HP2LP_CONF_0</name>
          <description>intr hp2lp configuration register 0</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>INTR_HP2LP_EN_0</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_HP2LP_CONF_1</name>
          <description>intr hp2lp configuration register 1</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>INTR_HP2LP_EN_1</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_HP2LP_CONF_2</name>
          <description>intr hp2lp configuration register 2</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>INTR_HP2LP_EN_2</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_HP2LP_CONF_3</name>
          <description>intr hp2lp configuration register 3</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>INTR_HP2LP_EN_3</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_HP2LP_CONF_4</name>
          <description>intr hp2lp configuration register 4</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0xff</resetValue>
          <fields>
            <field>
              <name>INTR_HP2LP_EN_4</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
