esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>INTR_HP2LP_STATUS_0</name>
          <description>intr hp2lp status register 0</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTR_HP2LP_STATUS_0</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_HP2LP_STATUS_1</name>
          <description>intr hp2lp status register 1</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTR_HP2LP_STATUS_1</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_HP2LP_STATUS_2</name>
          <description>intr hp2lp status register 2</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTR_HP2LP_STATUS_2</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_HP2LP_STATUS_3</name>
          <description>intr hp2lp status register 3</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTR_HP2LP_STATUS_3</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_HP2LP_STATUS_4</name>
          <description>intr hp2lp status register 4</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTR_HP2LP_STATUS_4</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_SPRAM_MEM_AUX_CTRL</name>
          <description>spram mem aux ctrl , control CPU power domain</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0x2070</resetValue>
          <fields>
            <field>
              <name>CPU_SPRAM_MEM_AUX_CTRL</name>
              <description>spram mem aux ctrl , control CPU power domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_CLOCK_GATE_BYPASS</name>
          <description>bus clock gating bypass configuration register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0x1f</resetValue>
          <fields>
            <field>
              <name>AHB_CLK_GATING_BYPASS</name>
              <description>Set 1 to bypass the clock gating for ahb bus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB_CLK_GATING_BYPASS</name>
              <description>Set 1 to bypass the clock gating for apb bus</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXI_CLK_GATING_BYPASS</name>
              <description>Set 1 to bypass the clock gating for axi bus</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CLK_GATING_BYPASS</name>
              <description>Set 1 to bypass the clock gating for mem bus</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_MTX_CLK_GATING_BYPASS</name>
              <description>Set 1 to bypass the clock gating for ahb mtx</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RST_EVENT_BYPASS</name>
          <description>bus clock gating bypass configuration register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>ICMAPB</name>
              <description>Set 1 to bypass none-power_on reset source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICMSYS</name>
              <description>Set 1 to bypass none-power_on reset source</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICMCPU</name>
              <description>Set 1 to bypass none-power_on reset source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKRST</name>
              <description>Set 1 to bypass none-power_on reset source</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKRST_REG</name>
              <description>Set 1 to bypass none-power_on reset source</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOMUX</name>
              <description>Set 1 to bypass none-power_on reset source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_BYPASS_LOCK</name>
              <description>Set 1 to lock reset event bypass configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_OTGHS_CTRL</name>
          <description>usb_otghs Control configuration register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0x104</resetValue>
          <fields>
            <field>
              <name>REG_USB_OTGHS_PHY_PLL_FORCE_EN</name>
              <description>Set this bit as 1 to force use reg_usb_otghs_phy_pll_en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_USB_OTGHS_PHY_PLL_EN</name>
              <description>pll_en for phy inf</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_USB_OTGHS_PHY_SUSPENDM_FORCE_EN</name>
              <description>Set this bit as 1 to force use reg_usb_otghs_phy_suspendm</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_USB_OTGHS_PHY_SUSPENDM</name>
              <description>phy suspendm</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_USB_OTGHS_PHY_RESET_FORCE_EN</name>
              <description>Set this bit as 1 to force use reg_usb_otghs_phy_reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_USB_OTGHS_PHY_RESET</name>
              <description>phy reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_USB_OTGHS_PHY_TXBITSTUFF_EN</name>
              <description>phy txbitstuff_en</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_USB_OTGHS_PHY_OTG_SUSPENDM</name>
              <description>phy otg_suspendm</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_USB_OTGHS_PHY_REFCLK_MODE</name>
              <description>phy refclk_mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_USB_OTGHS_CORE_SS_SCALEDOWN_MODE</name>
              <description>usb otghs core ss_scaledown_mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_USB_OTGHS_PHY_SELF_TEST</name>
              <description>phy self_test</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_USB_OTGHS_PHY_TEST_DONE</name>
              <description>phy test_bist</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_USB_OTGHS_PHY_DTO</name>
              <description>phy dto</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>need_des</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2509110</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
