esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>M5_STATUS_CLR</name>
          <description>M5 status clear register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M5_EXCEPTION_STATUS_CLR</name>
              <description>Configures to clear exception status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M5_EXCEPTION_INFO0</name>
          <description>M5 exception_info0 register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M5_EXCEPTION_REGION</name>
              <description>Represents exception region.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M5_EXCEPTION_MODE</name>
              <description>Represents exception mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M5_EXCEPTION_ID</name>
              <description>Represents exception id information.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M5_EXCEPTION_INFO1</name>
          <description>M5 exception_info1 register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M5_EXCEPTION_ADDR</name>
              <description>Represents exception addr.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M6_STATUS</name>
          <description>M6 status register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M6_EXCEPTION_STATUS</name>
              <description>Represents exception status.\\
bit0: 1 represents authority_exception \\
bit1: 1 represents space_exception  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M6_STATUS_CLR</name>
          <description>M6 status clear register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M6_EXCEPTION_STATUS_CLR</name>
              <description>Configures to clear exception status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M6_EXCEPTION_INFO0</name>
          <description>M6 exception_info0 register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M6_EXCEPTION_REGION</name>
              <description>Represents exception region.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M6_EXCEPTION_MODE</name>
              <description>Represents exception mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M6_EXCEPTION_ID</name>
              <description>Represents exception id information.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M6_EXCEPTION_INFO1</name>
          <description>M6 exception_info1 register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M6_EXCEPTION_ADDR</name>
              <description>Represents exception addr.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EN</name>
          <description>APM interrupt enable register</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M0_APM_INT_EN</name>
              <description>Configures to enable APM M0 interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M1_APM_INT_EN</name>
              <description>Configures to enable APM M1 interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M2_APM_INT_EN</name>
              <description>Configures to enable APM M2 interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M3_APM_INT_EN</name>
              <description>Configures to enable APM M3 interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M4_APM_INT_EN</name>
              <description>Configures to enable APM M4 interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M5_APM_INT_EN</name>
              <description>Configures to enable APM M5 interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M6_APM_INT_EN</name>
              <description>Configures to enable APM M6 interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_BLOCK_EN</name>
          <description>M6 status clear register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>AXI_BLOCK_EN</name>
              <description>Configures to if block transmission when get exceltion.\\
0: transparent transmission to slave \\
1: don't transparent transmission to slave  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_ERR_CONF</name>
          <description>APM interrupt enable register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUS_ERR_RESP_EN</name>
              <description>Configures whether return error response to cpu when access blocked
0: disable error response \\
1: enable error response  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gating register</description>
          <addressOffset>0x3f8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to keep the clock always on.\\
0: enable automatic clock gating \\
1: keep the clock always on  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2506260</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
