esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HP_MEM_APM</name>
      <description>HP_MEM_APM Peripheral</description>
      <groupName>HP_MEM_APM</groupName>
      <baseAddress>0x20504800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xd8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HP_MEM_APM_M0</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M1</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M2</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M3</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M4</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M5</name>
        <value>79</value>
      </interrupt>
      <registers>
        <register>
          <name>REGION_FILTER_EN</name>
          <description>Region filter enable register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>REGION_FILTER_EN</name>
              <description>Configure bit 0 (0-7) to enable region 0.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0xc</dimIncrement>
          <name>REGION%s_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x2f000000</resetValue>
          <fields>
            <field>
              <name>L</name>
              <description>Low 12 bit, start address of region %s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REGION_ADDR_START</name>
              <description>Configures start address of region %s.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H</name>
              <description>High 13 bit,  start address of region %s.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0xc</dimIncrement>
          <name>REGION%s_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x2f07ffff</resetValue>
          <fields>
            <field>
              <name>L</name>
              <description>Low 12 bit, end address of region %s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REGION_ADDR_END</name>
              <description>Configures end address of region %s.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H</name>
              <description>High 13 bit,  end address of region %s.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0xc</dimIncrement>
          <name>REGION%s_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x7000</resetValue>
          <fields>
            <field>
              <name>REGION_R0_X</name>
              <description>Configures the execution authority of REE_MODE 0 in region %s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R0_W</name>
              <description>Configures the write authority of REE_MODE 0 in region %s.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R0_R</name>
              <description>Configures the read authority of REE_MODE 0 in region %s.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R1_X</name>
              <description>Configures the execution authority of REE_MODE 1 in region %s.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R1_W</name>
              <description>Configures the write authority of REE_MODE 1 in region %s.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R1_R</name>
              <description>Configures the read authority of REE_MODE 1 in region %s.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R2_X</name>
              <description>Configures the execution authority of REE_MODE 2 in region %s.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R2_W</name>
              <description>Configures the write authority of REE_MODE 2 in region %s.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R2_R</name>
              <description>Configures the read authority of REE_MODE 2 in region %s.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_TEE_X</name>
              <description>Configures the execution authority of TEE_MODE in region %s.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_TEE_W</name>
              <description>Configures the write authority of TEE_MODE in region %s.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_TEE_R</name>
              <description>Configures the read authority of TEE_MODE in region %s.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_LOCK</name>
              <description>Set 1 to lock region0 configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC_CTRL</name>
          <description>APM function control register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0x3f</resetValue>
          <fields>
            <field>
              <name>M0_FUNC_EN</name>
              <description>PMS M0 function enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M1_FUNC_EN</name>
              <description>PMS M1 function enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M2_FUNC_EN</name>
              <description>PMS M2 function enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M3_FUNC_EN</name>
              <description>PMS M3 function enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M4_FUNC_EN</name>
              <description>PMS M4 function enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M5_FUNC_EN</name>
              <description>PMS M5 function enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M0_STATUS</name>
          <description>M0 status register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M0_EXCEPTION_STATUS</name>
              <description>Represents exception status.\\
bit0: 1 represents authority_exception \\
bit1: 1 represents space_exception  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M0_STATUS_CLR</name>
          <description>M0 status clear register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M0_EXCEPTION_STATUS_CLR</name>
              <description>Configures to clear exception status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M0_EXCEPTION_INFO0</name>
          <description>M0 exception_info0 register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M0_EXCEPTION_REGION</name>
              <description>Represents exception region.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M0_EXCEPTION_MODE</name>
              <description>Represents exception mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M0_EXCEPTION_ID</name>
              <description>Represents exception id information.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M0_EXCEPTION_INFO1</name>
          <description>M0 exception_info1 register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M0_EXCEPTION_ADDR</name>
              <description>Represents exception addr.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M1_STATUS</name>
          <description>M1 status register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M1_EXCEPTION_STATUS</name>
              <description>Represents exception status.\\
bit0: 1 represents authority_exception \\
bit1: 1 represents space_exception  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M1_STATUS_CLR</name>
          <description>M1 status clear register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M1_EXCEPTION_STATUS_CLR</name>
              <description>Configures to clear exception status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M1_EXCEPTION_INFO0</name>
          <description>M1 exception_info0 register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M1_EXCEPTION_REGION</name>
              <description>Represents exception region.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M1_EXCEPTION_MODE</name>
              <description>Represents exception mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M1_EXCEPTION_ID</name>
              <description>Represents exception id information.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M1_EXCEPTION_INFO1</name>
          <description>M1 exception_info1 register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M1_EXCEPTION_ADDR</name>
              <description>Represents exception addr.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M2_STATUS</name>
          <description>M2 status register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M2_EXCEPTION_STATUS</name>
              <description>Represents exception status.\\
bit0: 1 represents authority_exception \\
bit1: 1 represents space_exception  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M2_STATUS_CLR</name>
          <description>M2 status clear register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M2_EXCEPTION_STATUS_CLR</name>
              <description>Configures to clear exception status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M2_EXCEPTION_INFO0</name>
          <description>M2 exception_info0 register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M2_EXCEPTION_REGION</name>
              <description>Represents exception region.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M2_EXCEPTION_MODE</name>
              <description>Represents exception mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M2_EXCEPTION_ID</name>
              <description>Represents exception id information.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M2_EXCEPTION_INFO1</name>
          <description>M2 exception_info1 register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M2_EXCEPTION_ADDR</name>
              <description>Represents exception addr.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M3_STATUS</name>
          <description>M3 status register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M3_EXCEPTION_STATUS</name>
              <description>Represents exception status.\\
bit0: 1 represents authority_exception \\
bit1: 1 represents space_exception  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M3_STATUS_CLR</name>
          <description>M3 status clear register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M3_EXCEPTION_STATUS_CLR</name>
              <description>Configures to clear exception status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M3_EXCEPTION_INFO0</name>
          <description>M3 exception_info0 register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M3_EXCEPTION_REGION</name>
              <description>Represents exception region.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M3_EXCEPTION_MODE</name>
              <description>Represents exception mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M3_EXCEPTION_ID</name>
              <description>Represents exception id information.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M3_EXCEPTION_INFO1</name>
          <description>M3 exception_info1 register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M3_EXCEPTION_ADDR</name>
              <description>Represents exception addr.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M4_STATUS</name>
          <description>M4 status register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M4_EXCEPTION_STATUS</name>
              <description>Represents exception status.\\
bit0: 1 represents authority_exception \\
bit1: 1 represents space_exception  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M4_STATUS_CLR</name>
          <description>M4 status clear register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M4_EXCEPTION_STATUS_CLR</name>
              <description>Configures to clear exception status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M4_EXCEPTION_INFO0</name>
          <description>M4 exception_info0 register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M4_EXCEPTION_REGION</name>
              <description>Represents exception region.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M4_EXCEPTION_MODE</name>
              <description>Represents exception mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>M4_EXCEPTION_ID</name>
              <description>Represents exception id information.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M4_EXCEPTION_INFO1</name>
          <description>M4 exception_info1 register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M4_EXCEPTION_ADDR</name>
              <description>Represents exception addr.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
