esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>HP_KEY_MANAGER_CTRL</name>
          <description>hp_key_manager read/write control register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_KEY_MANAGER</name>
              <description>Configures hp_key_manager registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_KEY_MANAGER</name>
              <description>Configures hp_key_manager registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_KEY_MANAGER</name>
              <description>Configures hp_key_manager registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_KEY_MANAGER</name>
              <description>Configures hp_key_manager registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_KEY_MANAGER</name>
              <description>Configures hp_key_manager registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_KEY_MANAGER</name>
              <description>Configures hp_key_manager registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_KEY_MANAGER</name>
              <description>Configures hp_key_manager registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_KEY_MANAGER</name>
              <description>Configures hp_key_manager registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_KEY_MANAGER_LOCK</name>
              <description>Set 1 to lock hp_key_manager peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CRYPTO_CTRL</name>
          <description>hp_crypto read/write control register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_CRYPTO</name>
              <description>Configures hp_crypto registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_CRYPTO</name>
              <description>Configures hp_crypto registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_CRYPTO</name>
              <description>Configures hp_crypto registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_CRYPTO</name>
              <description>Configures hp_crypto registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_CRYPTO</name>
              <description>Configures hp_crypto registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_CRYPTO</name>
              <description>Configures hp_crypto registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_CRYPTO</name>
              <description>Configures hp_crypto registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_CRYPTO</name>
              <description>Configures hp_crypto registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CRYPTO_LOCK</name>
              <description>Set 1 to lock hp_crypto peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_AXI_ICM_CTRL</name>
          <description>hp_axi_icm read/write control register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_AXI_ICM</name>
              <description>Configures hp_axi_icm registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_AXI_ICM</name>
              <description>Configures hp_axi_icm registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_AXI_ICM</name>
              <description>Configures hp_axi_icm registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_AXI_ICM</name>
              <description>Configures hp_axi_icm registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_AXI_ICM</name>
              <description>Configures hp_axi_icm registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_AXI_ICM</name>
              <description>Configures hp_axi_icm registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_AXI_ICM</name>
              <description>Configures hp_axi_icm registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_AXI_ICM</name>
              <description>Configures hp_axi_icm registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_AXI_ICM_LOCK</name>
              <description>Set 1 to lock hp_axi_icm peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PERF_MON_CTRL</name>
          <description>axi_perf_mon read/write control register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_AXI_PERF_MON</name>
              <description>Configures axi_perf_mon registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_AXI_PERF_MON</name>
              <description>Configures axi_perf_mon registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_AXI_PERF_MON</name>
              <description>Configures axi_perf_mon registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_AXI_PERF_MON</name>
              <description>Configures axi_perf_mon registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_AXI_PERF_MON</name>
              <description>Configures axi_perf_mon registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_AXI_PERF_MON</name>
              <description>Configures axi_perf_mon registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_AXI_PERF_MON</name>
              <description>Configures axi_perf_mon registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_AXI_PERF_MON</name>
              <description>Configures axi_perf_mon registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXI_PERF_MON_LOCK</name>
              <description>Set 1 to lock axi_perf_mon peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPUPERI0_0</name>
          <description>HP_CPUPERI0 PMS configuration &amp; info register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPUPERI0_PMS_EXCEPTION_CLR</name>
              <description>Configures whether or not to clear hp_cpuperi0 peri_pms_record_reg.\\
0: No clear\\
1: Clear peri_pms_record_reg\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_CPUPERI0_PMS_EXCEPTION_DET</name>
              <description>Represents whether the hp_cpuperi0 pms has been triggered.\\
0: No triggered\\
1: Has been triggered\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CPUPERI0_PMS_EXCEPTION_ID</name>
              <description>Represents the master id when hp_cpuperi0 pms has been triggered.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CPUPERI0_PMS_EXCEPTION_MODE</name>
              <description>Represents the security mode when hp_cpuperi0 pms has been triggered.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPUPERI0_1</name>
          <description>HP_CPUPERI0 PMS exception addr record register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>HP_CPUPERI0_PMS_EXCEPTION_ADDR</name>
              <description>Represents the access address (bit27~bit0) when hp_cpuperi0 pms has been triggered.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CPUPERI0_PMS_EXCEPTION_ADDR_CONST</name>
              <description>Represents the access address (bit31~bit28) when hp_cpuperi0 pms has been triggered.\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPUPERI1_0</name>
          <description>HP_CPUPERI1 PMS configuration &amp; info register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPUPERI1_PMS_EXCEPTION_CLR</name>
              <description>Configures whether or not to clear hp_cpuperi1 peri_pms_record_reg.\\
0: No clear\\
1: Clear peri_pms_record_reg\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_CPUPERI1_PMS_EXCEPTION_DET</name>
              <description>Represents whether the hp_cpuperi1 pms has been triggered.\\
0: No triggered\\
1: Has been triggered\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CPUPERI1_PMS_EXCEPTION_ID</name>
              <description>Represents the master id when hp_cpuperi1 pms has been triggered.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CPUPERI1_PMS_EXCEPTION_MODE</name>
              <description>Represents the security mode when hp_cpuperi1 pms has been triggered.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPUPERI1_1</name>
          <description>HP_CPUPERI1 PMS exception addr record register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>HP_CPUPERI1_PMS_EXCEPTION_ADDR</name>
              <description>Represents the access address (bit27~bit0) when hp_cpuperi1 pms has been triggered.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CPUPERI1_PMS_EXCEPTION_ADDR_CONST</name>
              <description>Represents the access address (bit31~bit28) when hp_cpuperi1 pms has been triggered.\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI0_0</name>
          <description>HP_PERI0 PMS configuration &amp; info register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI0_PMS_EXCEPTION_CLR</name>
              <description>Configures whether or not to clear hp_peri0 peri_pms_record_reg.\\
0: No clear\\
1: Clear peri_pms_record_reg\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_PERI0_PMS_EXCEPTION_DET</name>
              <description>Represents whether the hp_peri0 pms has been triggered.\\
0: No triggered\\
1: Has been triggered\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_PERI0_PMS_EXCEPTION_ID</name>
              <description>Represents the master id when hp_peri0 pms has been triggered.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_PERI0_PMS_EXCEPTION_MODE</name>
              <description>Represents the security mode when hp_peri0 pms has been triggered.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI0_1</name>
          <description>HP_PERI0 PMS exception addr record register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>HP_PERI0_PMS_EXCEPTION_ADDR</name>
              <description>Represents the access address (bit27~bit0) when hp_peri0 pms has been triggered.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_PERI0_PMS_EXCEPTION_ADDR_CONST</name>
              <description>Represents the access address (bit31~bit28) when hp_peri0 pms has been triggered.\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EN</name>
          <description>APM interrupt enable register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI0_PMS_INT_EN</name>
              <description>Configures to enable hp_peri0 pms interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CPUPERI1_PMS_INT_EN</name>
              <description>Configures to enable hp_cpuperi1 pms interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CPUPERI0_PMS_INT_EN</name>
              <description>Configures to enable hp_cpuperi0 pms interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_ERR_CONF</name>
          <description>Clock gating register</description>
          <addressOffset>0xff0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUS_ERR_RESP_EN</name>
              <description>Configures whether return error response to cpu when access blocked
0: disable error response \\
1: enable error response  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
