esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>HP_UART3_CTRL</name>
          <description>hp_uart3 read/write control register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_UART3</name>
              <description>Configures hp_uart3 registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_UART3</name>
              <description>Configures hp_uart3 registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_UART3</name>
              <description>Configures hp_uart3 registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_UART3</name>
              <description>Configures hp_uart3 registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_UART3</name>
              <description>Configures hp_uart3 registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_UART3</name>
              <description>Configures hp_uart3 registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_UART3</name>
              <description>Configures hp_uart3 registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_UART3</name>
              <description>Configures hp_uart3 registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_UART3_LOCK</name>
              <description>Set 1 to lock hp_uart3 peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PARLIO_CTRL</name>
          <description>hp_parlio read/write control register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_PARLIO</name>
              <description>Configures hp_parlio registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_PARLIO</name>
              <description>Configures hp_parlio registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_PARLIO</name>
              <description>Configures hp_parlio registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_PARLIO</name>
              <description>Configures hp_parlio registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_PARLIO</name>
              <description>Configures hp_parlio registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_PARLIO</name>
              <description>Configures hp_parlio registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_PARLIO</name>
              <description>Configures hp_parlio registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_PARLIO</name>
              <description>Configures hp_parlio registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_PARLIO_LOCK</name>
              <description>Set 1 to lock hp_parlio peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_GPSPI2_CTRL</name>
          <description>hp_gpspi2 read/write control register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_GPSPI2</name>
              <description>Configures hp_gpspi2 registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_GPSPI2</name>
              <description>Configures hp_gpspi2 registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_GPSPI2</name>
              <description>Configures hp_gpspi2 registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_GPSPI2</name>
              <description>Configures hp_gpspi2 registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_GPSPI2</name>
              <description>Configures hp_gpspi2 registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_GPSPI2</name>
              <description>Configures hp_gpspi2 registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_GPSPI2</name>
              <description>Configures hp_gpspi2 registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_GPSPI2</name>
              <description>Configures hp_gpspi2 registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_GPSPI2_LOCK</name>
              <description>Set 1 to lock hp_gpspi2 peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_GPSPI3_CTRL</name>
          <description>hp_gpspi3 read/write control register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_GPSPI3</name>
              <description>Configures hp_gpspi3 registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_GPSPI3</name>
              <description>Configures hp_gpspi3 registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_GPSPI3</name>
              <description>Configures hp_gpspi3 registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_GPSPI3</name>
              <description>Configures hp_gpspi3 registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_GPSPI3</name>
              <description>Configures hp_gpspi3 registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_GPSPI3</name>
              <description>Configures hp_gpspi3 registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_GPSPI3</name>
              <description>Configures hp_gpspi3 registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_GPSPI3</name>
              <description>Configures hp_gpspi3 registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_GPSPI3_LOCK</name>
              <description>Set 1 to lock hp_gpspi3 peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_USBDEVICE_CTRL</name>
          <description>hp_usbdevice read/write control register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_USBDEVICE</name>
              <description>Configures hp_usbdevice registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_USBDEVICE</name>
              <description>Configures hp_usbdevice registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_USBDEVICE</name>
              <description>Configures hp_usbdevice registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_USBDEVICE</name>
              <description>Configures hp_usbdevice registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_USBDEVICE</name>
              <description>Configures hp_usbdevice registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_USBDEVICE</name>
              <description>Configures hp_usbdevice registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_USBDEVICE</name>
              <description>Configures hp_usbdevice registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_USBDEVICE</name>
              <description>Configures hp_usbdevice registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_USBDEVICE_LOCK</name>
              <description>Set 1 to lock hp_usbdevice peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_LEDC0_CTRL</name>
          <description>hp_ledc0 read/write control register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_LEDC0</name>
              <description>Configures hp_ledc0 registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_LEDC0</name>
              <description>Configures hp_ledc0 registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_LEDC0</name>
              <description>Configures hp_ledc0 registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_LEDC0</name>
              <description>Configures hp_ledc0 registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_LEDC0</name>
              <description>Configures hp_ledc0 registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_LEDC0</name>
              <description>Configures hp_ledc0 registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_LEDC0</name>
              <description>Configures hp_ledc0 registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_LEDC0</name>
              <description>Configures hp_ledc0 registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_LEDC0_LOCK</name>
              <description>Set 1 to lock hp_ledc0 peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_ETM_CTRL</name>
          <description>hp_etm read/write control register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_ETM</name>
              <description>Configures hp_etm registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_ETM</name>
              <description>Configures hp_etm registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_ETM</name>
              <description>Configures hp_etm registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_ETM</name>
              <description>Configures hp_etm registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_ETM</name>
              <description>Configures hp_etm registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_ETM</name>
              <description>Configures hp_etm registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_ETM</name>
              <description>Configures hp_etm registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_ETM</name>
              <description>Configures hp_etm registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ETM_LOCK</name>
              <description>Set 1 to lock hp_etm peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
