esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>HP_LEDC1_CTRL</name>
          <description>hp_ledc1 read/write control register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_LEDC1</name>
              <description>Configures hp_ledc1 registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_LEDC1</name>
              <description>Configures hp_ledc1 registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_LEDC1</name>
              <description>Configures hp_ledc1 registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_LEDC1</name>
              <description>Configures hp_ledc1 registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_LEDC1</name>
              <description>Configures hp_ledc1 registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_LEDC1</name>
              <description>Configures hp_ledc1 registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_LEDC1</name>
              <description>Configures hp_ledc1 registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_LEDC1</name>
              <description>Configures hp_ledc1 registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_LEDC1_LOCK</name>
              <description>Set 1 to lock hp_ledc1 peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PCNT1_CTRL</name>
          <description>hp_pcnt1 read/write control register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_PCNT1</name>
              <description>Configures hp_pcnt1 registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_PCNT1</name>
              <description>Configures hp_pcnt1 registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_PCNT1</name>
              <description>Configures hp_pcnt1 registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_PCNT1</name>
              <description>Configures hp_pcnt1 registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_PCNT1</name>
              <description>Configures hp_pcnt1 registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_PCNT1</name>
              <description>Configures hp_pcnt1 registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_PCNT1</name>
              <description>Configures hp_pcnt1 registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_PCNT1</name>
              <description>Configures hp_pcnt1 registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_PCNT1_LOCK</name>
              <description>Set 1 to lock hp_pcnt1 peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TIMER_GROUP0_CTRL</name>
          <description>hp_timer_group0 read/write control register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_TIMER_GROUP0</name>
              <description>Configures hp_timer_group0 registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_TIMER_GROUP0</name>
              <description>Configures hp_timer_group0 registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_TIMER_GROUP0</name>
              <description>Configures hp_timer_group0 registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_TIMER_GROUP0</name>
              <description>Configures hp_timer_group0 registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_TIMER_GROUP0</name>
              <description>Configures hp_timer_group0 registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_TIMER_GROUP0</name>
              <description>Configures hp_timer_group0 registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_TIMER_GROUP0</name>
              <description>Configures hp_timer_group0 registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_TIMER_GROUP0</name>
              <description>Configures hp_timer_group0 registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TIMER_GROUP0_LOCK</name>
              <description>Set 1 to lock hp_timer_group0 peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TIMER_GROUP1_CTRL</name>
          <description>hp_timer_group1 read/write control register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_TIMER_GROUP1</name>
              <description>Configures hp_timer_group1 registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_TIMER_GROUP1</name>
              <description>Configures hp_timer_group1 registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_TIMER_GROUP1</name>
              <description>Configures hp_timer_group1 registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_TIMER_GROUP1</name>
              <description>Configures hp_timer_group1 registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_TIMER_GROUP1</name>
              <description>Configures hp_timer_group1 registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_TIMER_GROUP1</name>
              <description>Configures hp_timer_group1 registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_TIMER_GROUP1</name>
              <description>Configures hp_timer_group1 registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_TIMER_GROUP1</name>
              <description>Configures hp_timer_group1 registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TIMER_GROUP1_LOCK</name>
              <description>Set 1 to lock hp_timer_group1 peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_IOMUX_CTRL</name>
          <description>hp_iomux read/write control register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_IOMUX</name>
              <description>Configures hp_iomux registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_IOMUX</name>
              <description>Configures hp_iomux registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_IOMUX</name>
              <description>Configures hp_iomux registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_IOMUX</name>
              <description>Configures hp_iomux registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_IOMUX</name>
              <description>Configures hp_iomux registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_IOMUX</name>
              <description>Configures hp_iomux registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_IOMUX</name>
              <description>Configures hp_iomux registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_IOMUX</name>
              <description>Configures hp_iomux registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_IOMUX_LOCK</name>
              <description>Set 1 to lock hp_iomux peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MSPI_PADCTRL_CTRL</name>
          <description>hp_mspi_padctrl read/write control register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_MSPI_PADCTRL</name>
              <description>Configures hp_mspi_padctrl registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_MSPI_PADCTRL</name>
              <description>Configures hp_mspi_padctrl registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_MSPI_PADCTRL</name>
              <description>Configures hp_mspi_padctrl registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_MSPI_PADCTRL</name>
              <description>Configures hp_mspi_padctrl registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_MSPI_PADCTRL</name>
              <description>Configures hp_mspi_padctrl registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_MSPI_PADCTRL</name>
              <description>Configures hp_mspi_padctrl registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_MSPI_PADCTRL</name>
              <description>Configures hp_mspi_padctrl registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_MSPI_PADCTRL</name>
              <description>Configures hp_mspi_padctrl registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MSPI_PADCTRL_LOCK</name>
              <description>Set 1 to lock hp_mspi_padctrl peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
