esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>HP_INTRMTX_CTRL</name>
          <description>hp_intrmtx read/write control register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_INTRMTX</name>
              <description>Configures hp_intrmtx registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_INTRMTX</name>
              <description>Configures hp_intrmtx registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_INTRMTX</name>
              <description>Configures hp_intrmtx registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_INTRMTX</name>
              <description>Configures hp_intrmtx registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_INTRMTX</name>
              <description>Configures hp_intrmtx registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_INTRMTX</name>
              <description>Configures hp_intrmtx registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_INTRMTX</name>
              <description>Configures hp_intrmtx registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_INTRMTX</name>
              <description>Configures hp_intrmtx registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_INTRMTX_LOCK</name>
              <description>Set 1 to lock hp_intrmtx peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SYS_REG_CTRL</name>
          <description>hp_sys_reg read/write control register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_SYS</name>
              <description>Configures hp_sys_reg registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_SYS</name>
              <description>Configures hp_sys_reg registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_SYS</name>
              <description>Configures hp_sys_reg registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_SYS</name>
              <description>Configures hp_sys_reg registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_SYS</name>
              <description>Configures hp_sys_reg registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_SYS</name>
              <description>Configures hp_sys_reg registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_SYS</name>
              <description>Configures hp_sys_reg registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_SYS</name>
              <description>Configures hp_sys_reg registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SYS_REG_LOCK</name>
              <description>Set 1 to lock hp_sys_reg peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CLKRST_CTRL</name>
          <description>hp_clkrst read/write control register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_CLKRST</name>
              <description>Configures hp_clkrst registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_CLKRST</name>
              <description>Configures hp_clkrst registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_CLKRST</name>
              <description>Configures hp_clkrst registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_CLKRST</name>
              <description>Configures hp_clkrst registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_CLKRST</name>
              <description>Configures hp_clkrst registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_CLKRST</name>
              <description>Configures hp_clkrst registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_CLKRST</name>
              <description>Configures hp_clkrst registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_CLKRST</name>
              <description>Configures hp_clkrst registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CLKRST_LOCK</name>
              <description>Set 1 to lock hp_clkrst peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNT_PAD_CTRL_CTRL</name>
          <description>cnnt_pad_ctrl read/write control register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_CNNT_PAD_CTRL</name>
              <description>Configures cnnt_pad_ctrl registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_CNNT_PAD_CTRL</name>
              <description>Configures cnnt_pad_ctrl registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_CNNT_PAD_CTRL</name>
              <description>Configures cnnt_pad_ctrl registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_CNNT_PAD_CTRL</name>
              <description>Configures cnnt_pad_ctrl registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_CNNT_PAD_CTRL</name>
              <description>Configures cnnt_pad_ctrl registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_CNNT_PAD_CTRL</name>
              <description>Configures cnnt_pad_ctrl registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_CNNT_PAD_CTRL</name>
              <description>Configures cnnt_pad_ctrl registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_CNNT_PAD_CTRL</name>
              <description>Configures cnnt_pad_ctrl registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNNT_PAD_CTRL_LOCK</name>
              <description>Set 1 to lock cnnt_pad_ctrl peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_ALIVE_SYS_REG_CTRL</name>
          <description>hp_alive_sys_reg read/write control register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_ALIVE_SYS</name>
              <description>Configures hp_alive_sys_reg registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_ALIVE_SYS</name>
              <description>Configures hp_alive_sys_reg registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_HP_ALIVE_SYS</name>
              <description>Configures hp_alive_sys_reg registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_HP_ALIVE_SYS</name>
              <description>Configures hp_alive_sys_reg registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_ALIVE_SYS</name>
              <description>Configures hp_alive_sys_reg registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_ALIVE_SYS</name>
              <description>Configures hp_alive_sys_reg registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_ALIVE_SYS</name>
              <description>Configures hp_alive_sys_reg registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_ALIVE_SYS</name>
              <description>Configures hp_alive_sys_reg registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ALIVE_SYS_REG_LOCK</name>
              <description>Set 1 to lock hp_alive_sys_reg peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI1_PMS_CTRL</name>
          <description>hp_peri1_pms read/write control register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_PERI1_PMS</name>
              <description>Configures hp_peri1_pms registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_PERI1_PMS</name>
              <description>Configures hp_peri1_pms registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE1_HP_PERI1_PMS</name>
              <description>Configures hp_peri1_pms registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE2_HP_PERI1_PMS</name>
              <description>Configures hp_peri1_pms registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_PERI1_PMS</name>
              <description>Configures hp_peri1_pms registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_PERI1_PMS</name>
              <description>Configures hp_peri1_pms registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_PERI1_PMS</name>
              <description>Configures hp_peri1_pms registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_PERI1_PMS</name>
              <description>Configures hp_peri1_pms registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_PERI1_PMS_LOCK</name>
              <description>Set 1 to lock hp_peri1_pms peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI1_0</name>
          <description>HP_PERI1 PMS configuration &amp; info register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI1_PMS_EXCEPTION_CLR</name>
              <description>Configures whether or not to clear hp_peri1 peri_pms_record_reg.\\
0: No clear\\
1: Clear peri_pms_record_reg\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_PERI1_PMS_EXCEPTION_DET</name>
              <description>Represents whether the hp_peri1 pms has been triggered.\\
0: No triggered\\
1: Has been triggered\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_PERI1_PMS_EXCEPTION_ID</name>
              <description>Represents the master id when hp_peri1 pms has been triggered.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_PERI1_PMS_EXCEPTION_MODE</name>
              <description>Represents the security mode when hp_peri1 pms has been triggered.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI1_1</name>
          <description>HP_PERI1 PMS exception addr record register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>HP_PERI1_PMS_EXCEPTION_ADDR</name>
              <description>Represents the access address (bit27~bit0) when hp_peri1 pms has been triggered.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_PERI1_PMS_EXCEPTION_ADDR_CONST</name>
              <description>Represents the access address (bit31~bit28) when hp_peri1 pms has been triggered.\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EN</name>
          <description>APM interrupt enable register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI1_PMS_INT_EN</name>
              <description>Configures to enable hp_peri1 pms interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
