esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>BUS_ERR_CONF</name>
          <description>Clock gating register</description>
          <addressOffset>0xff0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUS_ERR_RESP_EN</name>
              <description>Configures whether return error response to cpu when access blocked
0: disable error response \\
1: enable error response  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gating register</description>
          <addressOffset>0xff8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to keep the clock always on.\\
0: enable automatic clock gating \\
1: keep the clock always on  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xffc</addressOffset>
          <size>32</size>
          <resetValue>0x2509220</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>HP_SYS</name>
      <description>High-Power System</description>
      <groupName>HP_SYS</groupName>
      <baseAddress>0x20586000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1b4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HP_SYSREG</name>
        <value>113</value>
      </interrupt>
      <registers>
        <register>
          <name>VER_DATE</name>
          <description>NA</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x20250402</resetValue>
          <fields>
            <field>
              <name>HP_REG_VER_DATE</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CLK_EN</name>
          <description>NA</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_CLK_EN</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPU_INT_FROM_CPU_0</name>
          <description>NA</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPU_INT_FROM_CPU_0</name>
              <description>set 1 will triger a interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPU_INT_FROM_CPU_1</name>
          <description>NA</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPU_INT_FROM_CPU_1</name>
              <description>set 1 will triger a interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPU_INT_FROM_CPU_2</name>
          <description>NA</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPU_INT_FROM_CPU_2</name>
              <description>set 1 will triger a interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPU_INT_FROM_CPU_3</name>
          <description>NA</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPU_INT_FROM_CPU_3</name>
              <description>set 1 will triger a interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_DIAG_EN</name>
          <description>NA</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_MODEM_DIAG_EN</name>
              <description>set reg_modem_diag_en[15:0] will let hp_probe_out[15:0] used as modem_diag[15:0], set reg_modem_diag_en[31:16] will let lcd_data_out[15:0] used as modem_diag[31:16]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TCM_RAM_PWR_CTRL0</name>
          <description>NA</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_HP_TCM_CLK_FORCE_ON</name>
              <description>hp_tcm clk gatig force on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_ROM_PWR_CTRL0</name>
          <description>NA</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_HP_ROM_CLK_FORCE_ON</name>
              <description>hp_rom clk gating force on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PROBEA_CTRL</name>
          <description>NA</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_PROBE_A_MOD_SEL</name>
              <description>Tihs field is used to selec probe_group from probe_group0 to probe_group15 for module's probe_out[31:0] in a mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_PROBE_A_TOP_SEL</name>
              <description>Tihs field is used to selec module's probe_out[31:0] as probe out in a mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_PROBE_L_SEL</name>
              <description>Tihs field is used to selec probe_out[31:16]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_PROBE_H_SEL</name>
              <description>Tihs field is used to selec probe_out[31:16]</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_PROBE_GLOBAL_EN</name>
              <description>Set this bit to enable global debug probe in hp system.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PROBEB_CTRL</name>
          <description>NA</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_PROBE_B_MOD_SEL</name>
              <description>Tihs field is used to selec probe_group from probe_group0 to probe_group15 for module's probe_out[31:0] in b mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_PROBE_B_TOP_SEL</name>
              <description>Tihs field is used to select module's probe_out[31:0]  as probe_out in b mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_PROBE_B_EN</name>
              <description>Set this bit to enable b mode for debug probe. 1:  b mode, 0: a mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PROBE_OUT</name>
          <description>NA</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_PROBE_TOP_OUT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPU_CORESTALLED_ST</name>
          <description>NA</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_CORE0_CORESTALLED_ST</name>
              <description>hp core0 corestalled status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_REG_CORE1_CORESTALLED_ST</name>
              <description>hp core1 corestalled status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CRYPTO_CTRL</name>
          <description>NA</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_ENABLE_SPI_MANUAL_ENCRYPT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_ENABLE_DOWNLOAD_DB_ENCRYPT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_ENABLE_DOWNLOAD_G0CB_DECRYPT</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_ENABLE_DOWNLOAD_MANUAL_ENCRYPT</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_IOMUX_FPGA_DEBUG</name>
          <description>NA</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>HP_REG_FPGA_DEBUG</name>
              <description>iomux fpga debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_CS</name>
          <description>NA</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_HP_SYS_RDN_ECO_EN</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_HP_SYS_RDN_ECO_RESULT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TCM_RDN_ECO_CS</name>
          <description>NA</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_HP_TCM_RDN_ECO_EN</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_HP_TCM_RDN_ECO_RESULT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TCM_RDN_ECO_LOW</name>
          <description>NA</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_HP_TCM_RDN_ECO_LOW</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TCM_RDN_ECO_HIGH</name>
          <description>NA</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_REG_HP_TCM_RDN_ECO_HIGH</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CACHE_PWR_CTRL</name>
          <description>NA</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_AC_MEM_FO</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_IC_MEM_FO</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_DC_MEM_FO</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TCM_DATA_DUMP_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_TCM_DATA_DUMP_EN</name>
              <description>hp tcm_data dump switch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPU_WAITI_CONF</name>
          <description>CPU_WAITI configuration register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>HP_CPU_WAIT_MODE_FORCE_ON</name>
              <description>Set 1 to force cpu_waiti_clk enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CPU_WAITI_DELAY_NUM</name>
              <description>This field used to set delay cycle when cpu enter waiti mode, after delay waiti_clk will close</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_DEBUG_RUNSTALL_CONF</name>
          <description>Core Debug runstall configure register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_DEBUG_RUNSTALL_ENABLE</name>
              <description>Set this field to 1 to enable debug runstall feature between HP-core and LP-core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_IBUS_TIMEOUT_CONF</name>
          <description>need_des</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0x1ffff</resetValue>
          <fields>
            <field>
              <name>HP_CORE_IBUS_TIMEOUT_PROTECT_EN</name>
              <description>set this field to 1 to enable hp core0&amp;1 ibus timeout handle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE_IBUS_TIMEOUT_THRES</name>
              <description>This field used to set hp core0&amp;1 ibus timeout  threshold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_DBUS_TIMEOUT_CONF</name>
          <description>need_des</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0x1ffff</resetValue>
          <fields>
            <field>
              <name>HP_CORE_DBUS_TIMEOUT_PROTECT_EN</name>
              <description>set this field to 1 to enable hp core0&amp;1 dbus timeout handle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE_DBUS_TIMEOUT_THRES</name>
              <description>This field used to set hp core0&amp;1 dbus timeout  threshold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_ICM_H2X_CFG</name>
          <description>need_des</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0x12</resetValue>
          <fields>
            <field>
              <name>HP_CPU_ICM_H2X_POST_WR_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CPU_ICM_H2X_CUT_THROUGH_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CPU_ICM_H2X_BRIDGE_BUSY</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_SDMMC_ICM_H2X_POST_WR_EN</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SDMMC_ICM_H2X_CUT_THROUGH_EN</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SDMMC_ICM_H2X_BRIDGE_BUSY</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_BITSCRAMBLER_PERI_SEL</name>
          <description>Bitscrambler Peri Sel</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_BITSCRAMBLER_PERI_RX_SEL</name>
              <description>Set  this field to sel peri with DMA RX interface to connec with bitscrambler:  lcd_cam: 5'h1, gpspi2: 5'h2: gpspi3: 5'h3, parl_io:5'h4, aes: 5'h5, sha: 5'h6, adc: 5'h7, i2s0_ch0: 5'h8, i2s0_ch1: 5'h9, i2s0_ch2: 5'ha, i2s0_ch3: 5'hb,
 i2s1_ch0: 5'hc, i2s1_ch1: 5'hd, i2s1_ch2: 5'he, i2s1_ch3: 5'hf, uhci0: 5'h10, RMT: 5'h11, none: else.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_BITSCRAMBLER_PERI_TX_SEL</name>
              <description>Set  this field to sel peri with DMA TX interface to connec with bitscrambler:  lcd_cam: 5'h1, gpspi2: 5'h2: gpspi3: 5'h3, parl_io:5'h4, aes: 5'h5, sha: 5'h6, adc: 5'h7, i2s0_ch0: 5'h8, i2s0_ch1: 5'h9, i2s0_ch2: 5'ha, i2s0_ch3: 5'hb,
 i2s1_ch0: 5'hc, i2s1_ch1: 5'hd, i2s1_ch2: 5'he, i2s1_ch3: 5'hf, uhci0: 5'h10, RMT: 5'h11, none: else.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
