esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>GDMA_CTRL</name>
          <description>N/A</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DEBUG_CH_NUM</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VPU_CTRL</name>
          <description>N/A</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PPA_LSLP_MEM_PD</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JPEG_SDSLP_MEM_PD</name>
              <description>N/A</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JPEG_LSLP_MEM_PD</name>
              <description>N/A</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JPEG_DSLP_MEM_PD</name>
              <description>N/A</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_LSLP_MEM_PD</name>
              <description>N/A</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_DESIGN_FOR_VERIFICATION0</name>
          <description>need_des</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_DFV0</name>
              <description>register for DV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_DESIGN_FOR_VERIFICATION1</name>
          <description>need_des</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_DFV1</name>
              <description>register for DV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_AHB2AXI_BRESP_ERR_INT_RAW</name>
          <description>NA</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SDMMC_ICM_H2X_BRESP_ERR_INT_RAW</name>
              <description>the raw interrupt status of bresp error,  triggered when if  bresp err occurs  in post write mode in ahb2axi.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CPU_ICM_H2X_BRESP_ERR_INT_RAW</name>
              <description>the raw interrupt status of bresp error,  triggered when if  bresp err occurs  in post write mode in ahb2axi.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_AHB2AXI_BRESP_ERR_INT_ST</name>
          <description>need_des</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SDMMC_ICM_H2X_BRESP_ERR_INT_ST</name>
              <description>the masked interrupt status of  sdmmc_icm_h2x_bresp_err</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CPU_ICM_H2X_BRESP_ERR_INT_ST</name>
              <description>the masked interrupt status of  cpu_icm_h2x_bresp_err</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_AHB2AXI_BRESP_ERR_INT_ENA</name>
          <description>need_des</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SDMMC_ICM_H2X_BRESP_ERR_INT_ENA</name>
              <description>Write 1 to enable sdmmc_icm_h2x_bresp_err int</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CPU_ICM_H2X_BRESP_ERR_INT_ENA</name>
              <description>Write 1 to enable cpu_icm_h2x_bresp_err int</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_AHB2AXI_BRESP_ERR_INT_CLR</name>
          <description>need_des</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SDMMC_ICM_H2X_BRESP_ERR_INT_CLR</name>
              <description>Write 1 to clear sdmmc_icm_h2x_bresp_err  int</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_CPU_ICM_H2X_BRESP_ERR_INT_CLR</name>
              <description>Write 1 to clear cpu_icm_h2x_bresp_err  int</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_DMACTIVE_LPCORE</name>
          <description>need_des</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE_DMACTIVE_LPCORE</name>
              <description>hp core dmactive_lpcore value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_ERR_RESP_DIS</name>
          <description>need_des</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE_ERR_RESP_DIS</name>
              <description>Set bit0 to disable ibus err resp. Set bit1 to disable dbus err resp.  Set bit 2 to disable ahb err resp.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_TIMEOUT_INT_RAW</name>
          <description>Hp core bus timeout interrupt raw register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE0_IBUS_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of hp core0  ibus timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE1_IBUS_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of hp core1  ibus timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE0_DBUS_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of hp core0  dbus timeout</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE1_DBUS_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of hp core1  dbus timeout</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_TIMEOUT_INT_ST</name>
          <description>masked interrupt register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE0_IBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core0  ibus timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CORE1_IBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core1  ibus timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CORE0_DBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core0  dbus timeout</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CORE1_DBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core1  dbus timeout</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_TIMEOUT_INT_ENA</name>
          <description>masked interrupt register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE0_IBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core0_ibus_timeout int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE1_IBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core1_ibus_timeout int</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE0_DBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core0_dbus_timeout int</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE1_DBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core1_dbus_timeout int</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_TIMEOUT_INT_CLR</name>
          <description>interrupt clear register</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE0_IBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core0_ibus_timeout int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_CORE1_IBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core1_ibus_timeout int</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_CORE0_DBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core0_dbus_timeout int</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_CORE1_DBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core1_dbus_timeout int</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_PAD_WAKEUP_EVENT</name>
          <description>pad wakeup event register</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE0_PAD_WAKEUP_EVENT</name>
              <description>wakeup core0 register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE1_PAD_WAKEUP_EVENT</name>
              <description>wakeup core1 register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TWAI0_TIMESTAMP_L</name>
          <description>twai0 timestamp low bit reg</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_TWAI0_TIMESTAMP_I</name>
              <description>This field used to set lower 32bits of timestamp hp twai0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TWAI0_TIMESTAMP_H</name>
          <description>twai0 timestamp high bit reg</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_TWAI0_TIMESTAMP_H</name>
              <description>This field used to set upper 32bits of timestamp hp twai0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TWAI1_TIMESTAMP_L</name>
          <description>twai1 timestamp low bit reg</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_TWAI1_TIMESTAMP_I</name>
              <description>This field used to set lower 32bits of timestamp hp twai1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TWAI1_TIMESTAMP_H</name>
          <description>twai1 timestamp high bit reg</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_TWAI1_TIMESTAMP_H</name>
              <description>This field used to set upper 32bits of timestamp hp twai1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_RNG_CFG</name>
          <description>rng cfg register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_RNG_CHAIN_CLK_DIV_NUM</name>
              <description>chain clk div num to pad for debug</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI_MEM_CLK_FORCE_ON</name>
          <description>hp peri mem clk force on regpster</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_RMT_MEM_CLK_FORCE_ON</name>
              <description>Set this bit to force on mem clk in rmt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON</name>
              <description>Set this bit to force on tx mem clk in bitscrambler</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON</name>
              <description>Set this bit to force on rx mem clk in bitscrambler</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_GDMA_MEM_CLK_FORCE_ON</name>
              <description>Set this bit to force on mem clk in gdma</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRDYN_ST</name>
          <description>hp system prdyn status register</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <resetValue>0xfd7da</resetValue>
          <fields>
            <field>
              <name>HP_ROM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CPU_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_BITSCRAMBLER_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_USB_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_RMT_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_LEDC0_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_KEY_MANAGER_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_VPU_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_GDMA_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_UART_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CRYPTO_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_FLASH_MSPI_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_PSRAM_MSPI_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_MODEM_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_LEDC1_MEM_PRDYN</name>
              <description>record memory power status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
