esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>ICM_CFG</name>
          <description>hp system axi icm ctrl register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ICM_DIS_RD</name>
              <description>0:mean master can acess slave , 1:mean master can not rd slave ,will returen decerro on axi bus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICM_DIS_WR</name>
              <description>0:mean master can acess slave , 1:mean master can not wr slave ,will returen decerro on axi bus</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECURE</name>
              <description>axi_matrix slave ,0: non-secure, 1: secure , total 3 slave.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART3_MEM_LP_CTRL</name>
          <description>uart memory power control register</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>UART3_MEM_LP_MODE</name>
              <description>Configures uart3 memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART3_MEM_LP_EN</name>
              <description>Set this bit to power down uart3 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART3_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control uart3 memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RMT_MEM_LP_CTRL</name>
          <description>rmt memory power control register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>RMT_MEM_LP_MODE</name>
              <description>Configures rmt memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_MEM_LP_EN</name>
              <description>Set this bit to power down rmt memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control rmt memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDC0_MEM_LP_CTRL</name>
          <description>ledc0 memory power control register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>LEDC0_MEM_LP_MODE</name>
              <description>Configures ledc0 memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_MEM_LP_EN</name>
              <description>Set this bit to power down ledc0 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control ledc0 memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KM_MEM_LP_CTRL</name>
          <description>key manager memory power control register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>KM_MEM_LP_MODE</name>
              <description>Configures km memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KM_MEM_LP_EN</name>
              <description>Set this bit to power down km memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KM_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control km memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2D_MEM_LP_CTRL</name>
          <description>vpu memory power control register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>_2DDMA_MEM_LP_MODE</name>
              <description>Configures 2ddma memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_2DDMA_MEM_LP_EN</name>
              <description>Set this bit to power down 2ddma memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_2DDMA_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control 2ddma memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PDMA_MEM_LP_CTRL</name>
          <description>vpu memory power control register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AXI_PDMA_MEM_LP_MODE</name>
              <description>Configures axi_pdma memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXI_PDMA_MEM_LP_EN</name>
              <description>Set this bit to power down axi_pdma memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXI_PDMA_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control axi_pdma memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_MEM_LP_CTRL</name>
          <description>HP CORE0 &amp; HP CORE1 memory power control register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>ECC_MEM_LP_MODE</name>
              <description>Configures ecc memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_MEM_LP_EN</name>
              <description>Set this bit to power down ecc memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control ecc memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSA_MEM_LP_CTRL</name>
          <description>HP CORE0 &amp; HP CORE1 memory power control register</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>RSA_MEM_LP_MODE</name>
              <description>Configures rsa memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_MEM_LP_EN</name>
              <description>Set this bit to power down rsa memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control rsa memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BITSCRAM_MEM_LP_CTRL</name>
          <description>HP CORE0 &amp; HP CORE1 memory power control register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>BITSCRAM_MEM_LP_MODE</name>
              <description>Configures bitscram memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BITSCRAM_MEM_LP_EN</name>
              <description>Set this bit to power down bitscram memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BITSCRAM_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control bitscram memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN0_MEM_LP_CTRL</name>
          <description>HP CORE0 &amp; HP CORE1 memory power control register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>CAN0_MEM_LP_MODE</name>
              <description>Configures can0 memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN0_MEM_LP_EN</name>
              <description>Set this bit to power down can0 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN0_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control can0 memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPI_MEM_LP_CTRL</name>
          <description>HP CORE0 &amp; HP CORE1 memory power control register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <resetValue>0x22</resetValue>
          <fields>
            <field>
              <name>PSRAM_MSPI_MEM_LP_MODE</name>
              <description>Configures psram_mspi memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_MSPI_MEM_LP_EN</name>
              <description>Set this bit to power down psram_mspi memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_MSPI_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control psram_mspi memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_MSPI_MEM_LP_MODE</name>
              <description>Configures flash_mspi memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_MSPI_MEM_LP_EN</name>
              <description>Set this bit to power down flash_mspi memory.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_MSPI_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control flash_mspi memory, disbale hardware control.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPCORE_MEM_LP_CTRL</name>
          <description>HP CORE0 &amp; HP CORE1 memory power control register</description>
          <addressOffset>0x24c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HPCORE_MEM_LP_MODE</name>
              <description>Configures hpcore memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPCORE_MEM_LP_EN</name>
              <description>Set this bit to power down hpcore memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPCORE_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control hpcore memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROM_MEM_LP_CTRL</name>
          <description>rom power control register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>ROM_MEM_LP_MODE</name>
              <description>Configures rom low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM_MEM_LP_EN</name>
              <description>Set this bit to power down rom.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control rom, disbale hardware control.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_MEM_LP_CTRL</name>
          <description>HP CORE0 &amp; HP CORE1 memory power control register</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_CACHE_MEM_LP_MODE</name>
              <description>Configures l1_cache memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_MEM_LP_EN</name>
              <description>Set this bit to power down l1_cache memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control l1_cache memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KYBER_MEM_LP_CTRL</name>
          <description>HP CORE0 &amp; HP CORE1 memory power control register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>KYBER_MEM_LP_MODE</name>
              <description>Configures kyber memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KYBER_MEM_LP_EN</name>
              <description>Set this bit to power down kyber memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KYBER_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control kyber memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCAM_MEM_LP_CTRL</name>
          <description>HP CORE0 &amp; HP CORE1 memory power control register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>LCDCAM_MEM_LP_MODE</name>
              <description>Configures lcdcam memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCAM_MEM_LP_EN</name>
              <description>Set this bit to power down lcdcam memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCAM_MEM_LP_FORCE_CTRL</name>
              <description>Set this bit to force software control lcdcam memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
