esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>CPU_PERI0_TIMEOUT_CONF</name>
          <description>CPU_PERI0_TIMEOUT configuration register</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <resetValue>0x2ffff</resetValue>
          <fields>
            <field>
              <name>CPU_PERI0_TIMEOUT_THRES</name>
              <description>Configures the timeout threshold for bus access for accessing CPU peripheral0 register in the number of clock cycles of the clock domain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_PERI0_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear timeout interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPU_PERI0_TIMEOUT_PROTECT_EN</name>
              <description>Configures whether or not to enable timeout protection for accessing CPU peripheral0 registers.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI0_TIMEOUT_ADDR</name>
          <description>CPU_PERI0_TIMEOUT_ADDR register</description>
          <addressOffset>0x26c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_PERI0_TIMEOUT_ADDR</name>
              <description>Represents the address information of abnormal access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI0_TIMEOUT_UID</name>
          <description>CPU_PERI0_TIMEOUT_UID register</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_PERI0_TIMEOUT_UID</name>
              <description>Represents the master id[5:0] and master permission[6:5] when trigger timeout. This register will be cleared after the interrupt is cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI0_TIMEOUT_CONF</name>
          <description>HP_PERI0_TIMEOUT configuration register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <resetValue>0x2ffff</resetValue>
          <fields>
            <field>
              <name>HP_PERI0_TIMEOUT_THRES</name>
              <description>Configures the timeout threshold for bus access for accessing CPU peripheral register in the number of clock cycles of the clock domain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_PERI0_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear timeout interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_PERI0_TIMEOUT_PROTECT_EN</name>
              <description>Configures whether or not to enable timeout protection for accessing CPU peripheral registers.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI0_TIMEOUT_ADDR</name>
          <description>HP_PERI0_TIMEOUT_ADDR register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI0_TIMEOUT_ADDR</name>
              <description>Represents the address information of abnormal access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI0_TIMEOUT_UID</name>
          <description>HP_PERI0_TIMEOUT_UID register</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI0_TIMEOUT_UID</name>
              <description>Represents the master id[5:0] and master permission[6:5] when trigger timeout. This register will be cleared after the interrupt is cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI1_TIMEOUT_CONF</name>
          <description>HP_PERI1_TIMEOUT configuration register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>0x2ffff</resetValue>
          <fields>
            <field>
              <name>HP_PERI1_TIMEOUT_THRES</name>
              <description>Configures the timeout threshold for bus access for accessing CPU peripheral register in the number of clock cycles of the clock domain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_PERI1_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear timeout interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_PERI1_TIMEOUT_PROTECT_EN</name>
              <description>Configures whether or not to enable timeout protection for accessing CPU peripheral registers.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI1_TIMEOUT_ADDR</name>
          <description>HP_PERI1_TIMEOUT_ADDR register</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI1_TIMEOUT_ADDR</name>
              <description>Represents the address information of abnormal access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI1_TIMEOUT_UID</name>
          <description>HP_PERI1_TIMEOUT_UID register</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI1_TIMEOUT_UID</name>
              <description>Represents the master id[5:0] and master permission[6:5] when trigger timeout. This register will be cleared after the interrupt is cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART0_MEM_LP_CTRL</name>
          <description>uart memory power control register</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART0_MEM_LP_MODE</name>
              <description>Configures uart0 memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_MEM_LP_EN</name>
              <description>Set this bit to power down uart0 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control uart0 memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART1_MEM_LP_CTRL</name>
          <description>uart memory power control register</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>UART1_MEM_LP_MODE</name>
              <description>Configures uart1 memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_MEM_LP_EN</name>
              <description>Set this bit to power down uart1 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control uart1 memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART2_MEM_LP_CTRL</name>
          <description>uart memory power control register</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>UART2_MEM_LP_MODE</name>
              <description>Configures uart2 memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART2_MEM_LP_EN</name>
              <description>Set this bit to power down uart2 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART2_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control uart2 memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDC1_MEM_LP_CTRL</name>
          <description>ledc1 memory power control register</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>LEDC1_MEM_LP_MODE</name>
              <description>Configures ledc1 memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_MEM_LP_EN</name>
              <description>Set this bit to power down ledc1 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control ledc1 memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPA_MEM_LP_CTRL</name>
          <description>vpu memory power control register</description>
          <addressOffset>0x29c</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>PPA_SPRF_MEM_LP_MODE</name>
              <description>Configures ppa_sprf memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPA_SPRF_MEM_LP_EN</name>
              <description>Set this bit to power down ppa_sprf memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPA_SPRF_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control ppa_sprf memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_MEM_LP_CTRL</name>
          <description>vpu memory power control register</description>
          <addressOffset>0x2a0</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>JPEG_MEM_LP_MODE</name>
              <description>Configures jpeg memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JPEG_MEM_LP_EN</name>
              <description>Set this bit to power down jpeg memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JPEG_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control jpeg memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN1_MEM_LP_CTRL</name>
          <description>HP CORE0 &amp; HP CORE1 memory power control register</description>
          <addressOffset>0x2a4</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>CAN1_MEM_LP_MODE</name>
              <description>Configures can1 memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN1_MEM_LP_EN</name>
              <description>Set this bit to power down can1 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN1_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control can1 memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI1_TIMEOUT_CONF</name>
          <description>CPU_PERI1_TIMEOUT configuration register</description>
          <addressOffset>0x2a8</addressOffset>
          <size>32</size>
          <resetValue>0x2ffff</resetValue>
          <fields>
            <field>
              <name>CPU_PERI1_TIMEOUT_THRES</name>
              <description>Configures the timeout threshold for bus access for accessing CPU peripheral register in the number of clock cycles of the clock domain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_PERI1_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear timeout interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPU_PERI1_TIMEOUT_PROTECT_EN</name>
              <description>Configures whether or not to enable timeout protection for accessing CPU peripheral11 registers.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI1_TIMEOUT_ADDR</name>
          <description>CPU_PERI1_TIMEOUT_ADDR register</description>
          <addressOffset>0x2ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_PERI1_TIMEOUT_ADDR</name>
              <description>Represents the address information of abnormal access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI1_TIMEOUT_UID</name>
          <description>CPU_PERI1_TIMEOUT_UID register</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_PERI1_TIMEOUT_UID</name>
              <description>Represents the master id[5:0] and master permission[6:5] when trigger timeout. This register will be cleared after the interrupt is cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_ACS_CACHE_MEM_CONF</name>
          <description>CPU access Cache data mem configuration register</description>
          <addressOffset>0x2b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_ACCESS_AC0_DATAMEM_EN</name>
              <description>Set this bit to enable CPU accessROMCache0 data mem path</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_ACCESS_AC1_DATAMEM_EN</name>
              <description>Set this bit to enable CPU access ROMCache1 data mem path</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_ACCESS_IC0_DATAMEM_EN</name>
              <description>Set this bit to enable CPU access ICache0 data mem path</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_ACCESS_IC1_DATAMEM_EN</name>
              <description>Set this bit to enable CPU access ICache1 data mem path</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_ACCESS_DC_DATAMEM_EN</name>
              <description>Set this bit to enable CPU access DCache data mem path</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_ACS_CACHE_MEM_LOCK</name>
              <description>Set 1 to lock cpu acs mem data mem path configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCM_PERFORMACE_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x2e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_TO_TCM_MEM_EN_HOLD</name>
              <description>Set 1 to keep TCM mem enable hold when mem access is busy.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_PAD_BIST_CFG</name>
          <description>sdio pad bist control register</description>
          <addressOffset>0x2e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDIO_PAD_BIST_START</name>
              <description>Write 1 to start sdio pad bist</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_PAD_BIST_INT_RAW</name>
          <description>sdio pad bist interupt raw register</description>
          <addressOffset>0x2e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDIO_PAD_BIST_OK_INT_RAW</name>
              <description>intr triggered when bist finish and status is bist ok</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_PAD_BIST_FAIL_INT_RAW</name>
              <description>intr triggered when bist finish and status is bist fail</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
