esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SDIO_PAD_BIST_INT_ST</name>
          <description>masked interrupt register</description>
          <addressOffset>0x2ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDIO_PAD_BIST_OK_INT_ST</name>
              <description>the masked interrupt status of sdio pad bist ok interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDIO_PAD_BIST_FAIL_INT_ST</name>
              <description>the masked interrupt status of sdio pad bist fail interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_PAD_BIST_INT_ENA</name>
          <description>interrupt enable register</description>
          <addressOffset>0x2f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDIO_PAD_BIST_OK_INT_ENA</name>
              <description>Write 1 to enable sdio pad bist ok interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_PAD_BIST_FAIL_INT_ENA</name>
              <description>Write 1 to enable sdio pad bist fail interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_PAD_BIST_INT_CLR</name>
          <description>interrupt clear register</description>
          <addressOffset>0x2f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDIO_PAD_BIST_OK_INT_CLR</name>
              <description>Write 1 to clr sdio pad bist ok interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_PAD_BIST_FAIL_INT_CLR</name>
              <description>Write 1 to clr sdio pad bist fail interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_PAD_BIST_ST</name>
          <description>sdio pad bist status register</description>
          <addressOffset>0x2f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDIO_PAD_BIST_RCNT</name>
              <description>Indicate number of clock cycles received for pad bist debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC0_PAD_BIST_CFG</name>
          <description>gmac0 pad bist control register</description>
          <addressOffset>0x2fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC0_PAD_BIST_START</name>
              <description>Write 1 to start gmac0 pad bist</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC0_PAD_BIST_INT_RAW</name>
          <description>gmac0 pad bist interupt raw register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC0_PAD_BIST_OK_INT_RAW</name>
              <description>intr triggered when bist finish and status is bist ok</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC0_PAD_BIST_FAIL_INT_RAW</name>
              <description>intr triggered when bist finish and status is bist fail</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC0_PAD_BIST_INT_ST</name>
          <description>masked interrupt register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC0_PAD_BIST_OK_INT_ST</name>
              <description>the masked interrupt status of gmac0 pad bist ok interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GMAC0_PAD_BIST_FAIL_INT_ST</name>
              <description>the masked interrupt status of gmac0 pad bist fail interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC0_PAD_BIST_INT_ENA</name>
          <description>interrupt enable register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC0_PAD_BIST_OK_INT_ENA</name>
              <description>Write 1 to enable gmac0 pad bist ok interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC0_PAD_BIST_FAIL_INT_ENA</name>
              <description>Write 1 to enable gmac0 pad bist fail interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC0_PAD_BIST_INT_CLR</name>
          <description>interrupt clear register</description>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC0_PAD_BIST_OK_INT_CLR</name>
              <description>Write 1 to clr gmac0 pad bist ok interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GMAC0_PAD_BIST_FAIL_INT_CLR</name>
              <description>Write 1 to clr gmac0 pad bist fail interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC0_PAD_BIST_ST</name>
          <description>gmac0 pad bist status register</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC0_PAD_BIST_RCNT</name>
              <description>Indicate number of clock cycles received for pad bist debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC1_PAD_BIST_CFG</name>
          <description>gmac1 pad bist control register</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC1_PAD_BIST_START</name>
              <description>Write 1 to start gmac1 pad bist</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC1_PAD_BIST_INT_RAW</name>
          <description>gmac1 pad bist interupt raw register</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC1_PAD_BIST_OK_INT_RAW</name>
              <description>intr triggered when bist finish and status is bist ok</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC1_PAD_BIST_FAIL_INT_RAW</name>
              <description>intr triggered when bist finish and status is bist fail</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC1_PAD_BIST_INT_ST</name>
          <description>masked interrupt register</description>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC1_PAD_BIST_OK_INT_ST</name>
              <description>the masked interrupt status of gmac1 pad bist ok interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GMAC1_PAD_BIST_FAIL_INT_ST</name>
              <description>the masked interrupt status of gmac1 pad bist fail interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC1_PAD_BIST_INT_ENA</name>
          <description>interrupt enable register</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC1_PAD_BIST_OK_INT_ENA</name>
              <description>Write 1 to enable gmac1 pad bist ok interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC1_PAD_BIST_FAIL_INT_ENA</name>
              <description>Write 1 to enable gmac1 pad bist fail interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC1_PAD_BIST_INT_CLR</name>
          <description>interrupt clear register</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC1_PAD_BIST_OK_INT_CLR</name>
              <description>Write 1 to clr gmac1 pad bist ok interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GMAC1_PAD_BIST_FAIL_INT_CLR</name>
              <description>Write 1 to clr gmac1 pad bist fail interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC1_PAD_BIST_ST</name>
          <description>gmac1 pad bist status register</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC1_PAD_BIST_RCNT</name>
              <description>Indicate number of clock cycles received for pad bist debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_PAD_BIST_CTRL</name>
          <description>gmac0 pad bist status register</description>
          <addressOffset>0x32c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDIO_PAD_BIST_0_SEL</name>
              <description>Write 1 to select sdio pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_PAD_BIST_1_SEL</name>
              <description>Write 1 to select sdio pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_PAD_BIST_2_SEL</name>
              <description>Write 1 to select sdio pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_PAD_BIST_3_SEL</name>
              <description>Write 1 to select sdio pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_PAD_BIST_4_SEL</name>
              <description>Write 1 to select sdio pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_PAD_BIST_5_SEL</name>
              <description>Write 1 to select sdio pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC0_PAD_BIST_CTRL</name>
          <description>gmac0 pad bist status register</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC0_PAD_BIST_0_SEL</name>
              <description>Write 1 to select gmac0 pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC0_PAD_BIST_1_SEL</name>
              <description>Write 1 to select gmac0 pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC0_PAD_BIST_2_SEL</name>
              <description>Write 1 to select gmac0 pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC0_PAD_BIST_3_SEL</name>
              <description>Write 1 to select gmac0 pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC0_PAD_BIST_4_SEL</name>
              <description>Write 1 to select gmac0 pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC0_PAD_BIST_5_SEL</name>
              <description>Write 1 to select gmac0 pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC1_PAD_BIST_CTRL</name>
          <description>gmac0 pad bist status register</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GMAC1_PAD_BIST_0_SEL</name>
              <description>Write 1 to select gmac1 pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC1_PAD_BIST_1_SEL</name>
              <description>Write 1 to select gmac1 pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC1_PAD_BIST_2_SEL</name>
              <description>Write 1 to select gmac1 pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC1_PAD_BIST_3_SEL</name>
              <description>Write 1 to select gmac1 pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC1_PAD_BIST_4_SEL</name>
              <description>Write 1 to select gmac1 pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC1_PAD_BIST_5_SEL</name>
              <description>Write 1 to select gmac1 pad bist signal out, default 0 is normal pad mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PWAIT_MODE</name>
          <description>Indicate status of core0 and core1 pwait</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_PWAIT_MODE</name>
              <description>Indicate status of core0 and core1 pwait</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
