esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>BUSMON_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_BUSMON_CORE0_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BUSMON_CORE0_CLK_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BUSMON_CORE0_RST_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BUSMON_CORE0_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BUSMON_CORE1_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BUSMON_CORE1_CLK_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BUSMON_CORE1_RST_EN</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BUSMON_CORE1_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMOVE_TMP0</name>
          <description>need_des</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_GDMA_CPU_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_VPU_CPU_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_VPU_SYS_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PVT0_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_PVT0_SYS_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PVT0_TOP_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PVT0_APB_RST_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PVT0_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PVT0_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PVT0_PERI_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_PVT0_PERI_GROUP1_RST_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PVT0_PERI_GROUP2_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PVT0_PERI_GROUP3_RST_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PVT0_PERI_GROUP4_RST_EN</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PVT0_PERI_GROUP1_CLK_EN</name>
              <description>TOP power domian pvt clk en</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PVT0_PERI_GROUP2_CLK_EN</name>
              <description>TOP power domian pvt clk en</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PVT0_PERI_GROUP3_CLK_EN</name>
              <description>modem power domian pvt clk en</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PVT0_PERI_GROUP4_CLK_EN</name>
              <description>modem power domian pvt clk en</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRYPTO_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0x415555</resetValue>
          <fields>
            <field>
              <name>REG_CRYPTO_SYS_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_SEC_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_SEC_RST_EN</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_AES_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_AES_RST_EN</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_SHA_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_SHA_RST_EN</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_RSA_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_RSA_RST_EN</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_DS_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_DS_RST_EN</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_ECC_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_ECC_RST_EN</name>
              <description>need_des</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_HMAC_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_HMAC_RST_EN</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_ECDSA_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_ECDSA_RST_EN</name>
              <description>need_des</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_RMA_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_RMA_RST_EN</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_MANAGER_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>REG_KEY_MANAGER_SYS_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_KM_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CRYPTO_KM_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPA_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_SEC_DPA_LEVEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SEC_DPA_CFG_SEL</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x781</resetValue>
          <fields>
            <field>
              <name>REG_FLASH_SYS_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FLASH_AXI_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FLASH_APB_RST_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FLASH_AXI_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FLASH_APB_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FLASH_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FLASH_PLL_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FLASH_CORE_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FLASH_CORE_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x181</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_SYS_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_AXI_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_APB_RST_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_AXI_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_APB_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_PLL_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CORE_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CORE_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPSPI2_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x800043</resetValue>
          <fields>
            <field>
              <name>REG_GPSPI2_SYS_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPSPI2_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPSPI2_RST_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPSPI2_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPSPI2_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPSPI2_HS_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPSPI2_HS_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPSPI2_MST_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPSPI2_MST_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
