esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SYSTIMER_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_SYSTIMER_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SYSTIMER_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SYSTIMER_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SYSTIMER_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SYSTIMER_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCPWM0_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_MCPWM0_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM0_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM0_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM0_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM0_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM0_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCPWM1_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_MCPWM1_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM1_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM1_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM1_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM1_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM1_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCPWM2_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_MCPWM2_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM2_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM2_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM2_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM2_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM2_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCPWM3_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_MCPWM3_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM3_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM3_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM3_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM3_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MCPWM3_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTRMTX_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>REG_INTRMTX_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_INTRMTX_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_INTRMTX_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNT_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_PCNT0_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PCNT0_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PCNT0_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PCNT1_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PCNT1_RST_EN</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PCNT1_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DEVICE_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>REG_USB_DEVICE_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDC_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_LEDC0_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LEDC0_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LEDC0_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LEDC0_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LEDC0_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LEDC1_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LEDC1_RST_EN</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LEDC1_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LEDC1_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LEDC1_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCAM_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_LCDCAM_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LCDCAM_APB_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LCDCAM_SYS_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LCDCAM_RST_EN</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LCDCAM_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCAM_LCD_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_LCD_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LCD_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LCD_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LCD_CLK_DIV_NUMERATOR</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LCD_CLK_DIV_DENOMINATOR</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCAM_LCDCAM_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_LCDCAM_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LCDCAM_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LCDCAM_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LCDCAM_CLK_DIV_NUMERATOR</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LCDCAM_CLK_DIV_DENOMINATOR</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCAM_CAM_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_CAM_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CAM_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CAM_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CAM_CLK_DIV_NUMERATOR</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CAM_CLK_DIV_DENOMINATOR</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOMUX_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>REG_IOMUX_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_IOMUX_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_IOMUX_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_IOMUX_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_IOMUX_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_IOMUX_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPWDT_CORE0_RST_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>0x1011</resetValue>
          <fields>
            <field>
              <name>REG_HPCORE0_STALL_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_HPCORE0_STALL_WAIT_NUM</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_WDT_HPCORE0_RST_LEN</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
