esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>HPWDT_CORE1_RST_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <resetValue>0x1011</resetValue>
          <fields>
            <field>
              <name>REG_HPCORE1_STALL_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_HPCORE1_STALL_WAIT_NUM</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_WDT_HPCORE1_RST_LEN</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_SRC_FREQ0</name>
          <description>CPU Source Frequency</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_CPU_SRC_FREQ</name>
              <description>cpu source clock frequency, step by 0.25MHz</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_CLK_STATUS0</name>
          <description>CPU Clock Status</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_ASIC_OR_FPGA</name>
              <description>0: ASIC mode, 1: FPGA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_DIV_EFFECT</name>
              <description>0: Divider bypass, 1: Divider takes effect</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_SRC_IS_CPLL</name>
              <description>0: CPU source isn't cpll_400m, 1: CPU Source is cll_400m</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_DIV_NUM_CUR</name>
              <description>cpu current div number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_DIV_NUMERATOR_CUR</name>
              <description>cpu current div numerator</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_DIV_DENOMINATOR_CUR</name>
              <description>cpu current div denominator</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPCORE_WDT_RESET_SOURCE0</name>
          <description>need_des</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>REG_HPCORE0_WDT_RESET_SOURCE_SEL</name>
              <description>1'b0: use wdt0 to reset hpcore0, 1'b1: use wdt1 to reset hpcore0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_HPCORE1_WDT_RESET_SOURCE_SEL</name>
              <description>1'b0: use wdt0 to reset hpcore1, 1'b1: use wdt1 to reset hpcore1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANA_PLL_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_PLLA_CAL_END</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_PLLA_CAL_STOP</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CPU_PLL_CAL_END</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_PLL_CAL_STOP</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SDIO_PLL_CAL_END</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_SDIO_PLL_CAL_STOP</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BBPLL_CAL_END</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_BBPLL_CAL_STOP</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_MSPI_CAL_END</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_MSPI_CAL_STOP</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PLL_CAL_END</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_500M_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_REF_500M_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_240M_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <resetValue>0x101</resetValue>
          <fields>
            <field>
              <name>REG_REF_240M_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_REF_240M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_160M_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <resetValue>0x102</resetValue>
          <fields>
            <field>
              <name>REG_REF_160M_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_REF_160M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_120M_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <resetValue>0x103</resetValue>
          <fields>
            <field>
              <name>REG_REF_120M_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_REF_120M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_80M_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <resetValue>0x505</resetValue>
          <fields>
            <field>
              <name>REG_REF_80M_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_REF_80M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_REF_80M_SEL</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_REF_80M_MUX_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_60M_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <resetValue>0x107</resetValue>
          <fields>
            <field>
              <name>REG_REF_60M_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_REF_60M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_20M_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <resetValue>0x117</resetValue>
          <fields>
            <field>
              <name>REG_REF_20M_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_REF_20M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_50M_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <resetValue>0x105</resetValue>
          <fields>
            <field>
              <name>REG_REF_50M_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_REF_50M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_25M_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <resetValue>0x10b</resetValue>
          <fields>
            <field>
              <name>REG_REF_25M_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_REF_25M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM_CLK_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_TM_480M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_TM_240M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_TM_160M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_TM_120M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_TM_80M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_TM_60M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_TM_48M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_TM_20M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_TM_250M_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG0_CLK_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <resetValue>0x3ff</resetValue>
          <fields>
            <field>
              <name>REG_DBG_CH0_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH0_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH0_EN</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG1_CLK_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <resetValue>0x3ff</resetValue>
          <fields>
            <field>
              <name>REG_DBG_CH1_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH1_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH1_EN</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG2_CLK_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <resetValue>0x3ff</resetValue>
          <fields>
            <field>
              <name>REG_DBG_CH2_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH2_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH2_EN</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CLK_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_LPAON_FOSC_CLK_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LPAON_XTAL_CLK_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LPAON_PLL80M_CLK_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_ASRC_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>REG_AHB_ASRC_SYS_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_AHB_ASRC_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_AHB_ASRC_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
