esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>CORDIC_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_CORDIC_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CORDIC_APB_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CORDIC_SYS_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CORDIC_SYS_RST_EN</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CORDIC_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CORDIC_CORE_RST_EN</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CORDIC_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CORDIC_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZERO_DET_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_ZERO_DET_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_ZERO_DET_APB_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_ZERO_DET_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_ZERO_DET_CORE_RST_EN</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_ZERO_DET_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_ZERO_DET_CLK_SRC_SEL</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_ZERO_DET_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORDIC_CTRL1</name>
          <description>need_des</description>
          <addressOffset>0x1bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_CORDIC_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CORDIC_CLK_DIV_NUMERATOR</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CORDIC_CLK_DIV_DENONIMATOR</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_PWR_DECREASE</name>
          <description>need_des</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_APB_HW_DECREASE_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CPU_WFI_DECREASE_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNT_IOMUX_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>REG_CNNT_IOMUX_APB_CLK_EN</name>
              <description>cnnt_iomux clk en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_I2CMST_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>REG_HP_I2CMST_APB_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_HP_I2CMST_RST_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_HP_I2CMST_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PERF_MON_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_AXI_PERF_MON_RST_EN</name>
              <description>axi_perf_mon rst en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_AXI_PERF_MON_CLK_EN</name>
              <description>axi_perf_mon clk en</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_AXI_PERF_MON_FORCE_NORST</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNT_SYSREG_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>REG_CNNT_SYSREG_SYS_CLK_EN</name>
              <description>cnnt_sysreg clk en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_ALIVE_SYSREG_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>REG_HP_ALIVE_SYSREG_APB_CLK_EN</name>
              <description>hp alive_sysreg clk en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEM_CONF</name>
          <description>MODEM_APB configuration register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <resetValue>0x25</resetValue>
          <fields>
            <field>
              <name>MODEM_APB_CLK_EN</name>
              <description>This field indicates if modem_apb clock is enable. 0: disable, 1: enable(default).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_RST_EN</name>
              <description>Set this file as 1 to reset modem-subsystem.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_CLK_EN</name>
              <description>This field indicates if modem source clock is enable. 0: disable, 1: enable(default).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_CLK_SOURCE_SEL</name>
              <description>modem clk source sel</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_PLL_CLK_EN</name>
              <description>modem clk source pll on</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_XTAL_CLK_EN</name>
              <description>modem clk source xtal on</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DAC_INV_PHASE_CONF</name>
          <description>xxxx</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_RX_ADC_INV_PHASE_ENA</name>
              <description>xxxx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_TX_DAC_INV_PHASE_ENA</name>
              <description>xxxx</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_PWDET_ADC_INV_PHASE_ENA</name>
              <description>xxxx</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWDET_SAR_CLK_CONF</name>
          <description>xxxx</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <resetValue>0x107</resetValue>
          <fields>
            <field>
              <name>PWDET_SAR_CLK_DIV_NUM</name>
              <description>xxxx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWDET_SAR_CLK_EN</name>
              <description>xxxx</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_BIST_SDIO</name>
          <description>need_des</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <resetValue>0xc</resetValue>
          <fields>
            <field>
              <name>OUT_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_EN</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_BIST_GMAC0</name>
          <description>need_des</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>OUT_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_EN</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_BIST_GMAC1</name>
          <description>need_des</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>OUT_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CLK_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_EN</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_EN0</name>
          <description>need_des</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>REG_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>need_des</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <resetValue>0x2509110</resetValue>
          <fields>
            <field>
              <name>REG_DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
