esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>FIFO_CNT</name>
          <description>I2S sync counter register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_FIFO_CNT</name>
              <description>tx fifo counter value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_FIFO_CNT_RST</name>
              <description>Set this bit to reset tx fifo counter.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCK_CNT</name>
          <description>I2S sync counter register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_BCK_CNT</name>
              <description>tx bck counter value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_BCK_CNT_RST</name>
              <description>Set this bit to reset tx bck counter.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT_DIFF</name>
          <description>I2S sync counter register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CNT_DIFF</name>
              <description>tx bck counter value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_CNT_DIFF_RST</name>
              <description>Set this bit to reset fifo counter difference.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_SW_THRES</name>
          <description>I2S sync counter register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CNT_DIFF_SW_THRES</name>
              <description>tx fifo counter difference software threshold value, when difference larger than this threshold, interrupt will occur and hardware sync will not be executed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_HW_THRES</name>
          <description>I2S sync counter register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CNT_DIFF_HW_THRES</name>
              <description>tx fifo counter difference hardware threshold value, which means that only when difference larger than this threshold will hardware start hardware sync.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HW_SYNC_CONF</name>
          <description>I2S TX hardware sync function configuration register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_HW_SYNC_EN</name>
              <description>Configure whether enable i2s tx hardware sync function. 1: Enable. 0: Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_HW_SYNC_SUPPL_MODE</name>
              <description>Configure the i2s tx hardware sync supplementation mode. 1: Supplement the data configured in I2S_TX_HW_SYNC_SUPPL_DATA[31:0]. 0: Supplement the last data.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HW_SYNC_DATA</name>
          <description>I2S TX hardware sync function configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_HW_SYNC_SUPPL_DATA</name>
              <description>Configure the i2s tx hardware sync supplementation data when  I2S_TX_HW_SYNC_SUPPL_MODE is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESTINATION</name>
          <description>I2S TX status register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_DESTINATION</name>
              <description>Set this bit to configure the data destination of i2s rx. 1: ble. 0: gdma.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DESTINATION</name>
              <description>Set this bit to configure the data destination of i2s tx. 1: ble. 0: gdma.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GATE</name>
          <description>Clock gate register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>set this bit to enable clock gate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2504030</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>I2S version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
