esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2S0">
      <name>I2S1</name>
      <baseAddress>0x20388000</baseAddress>
      <description>I2S (Inter-IC Sound) Controller 1</description>
      <interrupt>
        <name>I2S1</name>
        <value>7</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>IOMUX_MSPI_PIN</name>
      <description>IOMUX_MSPI_PIN Peripheral</description>
      <groupName>IOMUX_MSPI_PIN</groupName>
      <baseAddress>0x20584000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLK_EN0</name>
          <description>apb registers auto clock gating reg</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>REG_CLK_EN</name>
              <description>1: auto clock gating on
0: auto clock gating off</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_D_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_D_DLI</name>
              <description>psram d dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_D_DLC</name>
              <description>psram d dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_D_HYS</name>
              <description>psram d sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_D_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_D_WPU</name>
              <description>psram d wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_D_WPD</name>
              <description>psram d wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_D_DRV</name>
              <description>psram d drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_D_HOLD</name>
              <description>psram d hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_Q_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_Q_DLI</name>
              <description>psram q dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_Q_DLC</name>
              <description>psram q dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_Q_HYS</name>
              <description>psram q sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_Q_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_Q_WPU</name>
              <description>psram q wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_Q_WPD</name>
              <description>psram q wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_Q_DRV</name>
              <description>psram q drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_Q_HOLD</name>
              <description>psram q hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_WP_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_WP_DLI</name>
              <description>psram wp dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_WP_DLC</name>
              <description>psram wp dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_WP_HYS</name>
              <description>psram wp sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_WP_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_WP_WPU</name>
              <description>psram wp wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_WP_WPD</name>
              <description>psram wp wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_WP_DRV</name>
              <description>psram wp drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_WP_HOLD</name>
              <description>psram wp hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_HOLD_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_HOLD_DLI</name>
              <description>psram hold dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_HOLD_DLC</name>
              <description>psram hold dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_HOLD_HYS</name>
              <description>psram hold sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_HOLD_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_HOLD_WPU</name>
              <description>psram hold wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_HOLD_WPD</name>
              <description>psram hold wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_HOLD_DRV</name>
              <description>psram hold drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_HOLD_HOLD</name>
              <description>psram hold hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_DQ4_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_DQ4_DLI</name>
              <description>psram dq4 dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ4_DLC</name>
              <description>psram dq4 dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ4_HYS</name>
              <description>psram dq4 sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ4_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ4_WPU</name>
              <description>psram dq4 wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ4_WPD</name>
              <description>psram dq4 wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ4_DRV</name>
              <description>psram dq4 drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ4_HOLD</name>
              <description>psram dq4 hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_DQ5_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_DQ5_DLI</name>
              <description>psram dq5 dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ5_DLC</name>
              <description>psram dq5 dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ5_HYS</name>
              <description>psram dq5 sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ5_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ5_WPU</name>
              <description>psram dq5 wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ5_WPD</name>
              <description>psram dq5 wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ5_DRV</name>
              <description>psram dq5 drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ5_HOLD</name>
              <description>psram dq5 hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_DQ6_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_DQ6_DLI</name>
              <description>psram dq6 dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ6_DLC</name>
              <description>psram dq6 dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ6_HYS</name>
              <description>psram dq6 sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ6_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ6_WPU</name>
              <description>psram dq6 wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ6_WPD</name>
              <description>psram dq6 wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ6_DRV</name>
              <description>psram dq6 drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ6_HOLD</name>
              <description>psram dq6 hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_DQ7_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_DQ7_DLI</name>
              <description>psram dq7 dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ7_DLC</name>
              <description>psram dq7 dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ7_HYS</name>
              <description>psram dq7 sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ7_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ7_WPU</name>
              <description>psram dq7 wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ7_WPD</name>
              <description>psram dq7 wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ7_DRV</name>
              <description>psram dq7 drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ7_HOLD</name>
              <description>psram dq7 hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_DQS_0_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x20000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_DQS_0_XPD</name>
              <description>psram xpd dqs0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_0_PHASE</name>
              <description>psram dqs0 phase</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_0_DLI</name>
              <description>psram dqs0 dli</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_0_DELAY_90</name>
              <description>psram dqs0 delay 90</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_0_HYS</name>
              <description>psram dqs0 sl</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_0_IE</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_0_WPU</name>
              <description>psram dqs0 wpu</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_0_WPD</name>
              <description>psram dqs0 wpd</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_0_DRV</name>
              <description>psram dqs0 drv</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_0_DELAY_270</name>
              <description>psram dqs0 delay 270</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_HOLD</name>
              <description>psram dqs hold</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
