esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>PSRAM_CK_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_CK_DLI</name>
              <description>psram ck dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CK_DLC</name>
              <description>psram ck dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CK_HYS</name>
              <description>psram ck sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CK_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CK_WPU</name>
              <description>psram ck wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CK_WPD</name>
              <description>psram ck wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CK_DRV</name>
              <description>psram ck drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CK_HOLD</name>
              <description>psram ck hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_CS_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_CS_DLI</name>
              <description>psram cs dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CS_DLC</name>
              <description>psram cs dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CS_HYS</name>
              <description>psram cs sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CS_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CS_WPU</name>
              <description>psram cs wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CS_WPD</name>
              <description>psram cs wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CS_DRV</name>
              <description>psram cs drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CS_HOLD</name>
              <description>psram cs hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>IO_MUX</name>
      <description>Input/Output Multiplexer</description>
      <groupName>IO_MUX</groupName>
      <baseAddress>0x20582000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>63</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GPIO%s</name>
          <description>IO MUX configuration register for GPIO%s</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x1800</resetValue>
          <fields>
            <field>
              <name>MCU_OE</name>
              <description>Configures whether or not to enable the output of GPIO%s in sleep mode.
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLP_SEL</name>
              <description>Configures whether or not to enter sleep mode for GPIO%s.\\
0: Not enter\\
1: Enter\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPD</name>
              <description>Configure whether or not to enable pull-down resistor of GPIO%s in sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WPU</name>
              <description>Configures whether or not to enable pull-up resistor of GPIO%s during sleep mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_IE</name>
              <description>Configures whether or not to enable the input of GPIO%s during sleep mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_DRV</name>
              <description>Configures the drive strength of GPIO%s during sleep mode. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPD</name>
              <description>Configures whether or not to enable pull-down resistor of GPIO%s.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_WPU</name>
              <description>Configures whether or not enable pull-up resistor of GPIO%s.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_IE</name>
              <description>Configures whether or not to enable input of GPIO%s.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUN_DRV</name>
              <description>Configures the drive strength of GPIO%s. \\
0: ~5 mA\\
1: ~10 mA\\
2: ~20 mA\\
3: ~40 mA\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_SEL</name>
              <description>Configures to select IO MUX function for this signal. \\
0: Select Function 0\\
1: Select Function 1\\
......\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_EN</name>
              <description>Configures whether or not to enable filter for pin input signals.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_EN</name>
              <description>Configures whether or not to enable the hysteresis function of the pin when IO_MUX_GPIO%s_HYS_SEL is set to 1.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS_SEL</name>
              <description>Configures to choose the signal for enabling the hysteresis function for GPIO%s. \\
0: Choose the output enable signal of eFuse\\
1: Choose the output enable signal of IO_MUX_GPIO%s_HYS_EN\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <resetValue>0x2502070</resetValue>
          <fields>
            <field>
              <name>REG_DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
