esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>INT_RAW</name>
          <description>Interrupt raw registers</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DONE_INT_RAW</name>
              <description>This raw interrupt bit turns to high level when JPEG finishes encoding a picture..</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLE_PARALLEL_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that rle parallel error when decoding.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CID_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that scan id check with component fails when decoding.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C_DHT_DC_ID_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that scan component's dc dht id check with dc dht table's id fails when decoding.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C_DHT_AC_ID_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that scan component's ac dht id check with ac dht table's id fails when decoding.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C_DQT_ID_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that scan component's dqt id check with dqt table's id fails when decoding.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_UXP_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that RST header marker is detected but restart interval is 0 when decoding.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_CHECK_NONE_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that RST header marker is not detected but restart interval is not 0 when decoding.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_CHECK_POS_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that RST header marker position mismatches with restart interval when decoding.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the last pixel of one square has been transmitted for Tx channel.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_COLOR_MODE_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that the selected source color mode is not supported.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCT_DONE_INT_RAW</name>
              <description>The raw interrupt bit to sign that one dct calculation is finished.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BS_LAST_BLOCK_EOF_INT_RAW</name>
              <description>The raw interrupt bit to sign that the coding process for last block is finished.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_CHECK_NONE_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that SOS header marker is not detected but there are still components left to be decoded.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_CHECK_POS_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that SOS header marker position wrong when decoding.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UXP_DET_INT_RAW</name>
              <description>The raw interrupt bit to sign that unsupported header marker is detected when decoding.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_FRAME_EOF_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that received pixel blocks are smaller than expected when encoding.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_FRAME_EOF_LACK_INT_RAW</name>
              <description>The raw interrupt bit to sign that the frame eof sign bit from dma input is missing when encoding. But the number of pixel blocks is enough.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DE_FRAME_EOF_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that decoded blocks are smaller than expected when decoding.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DE_FRAME_EOF_LACK_INT_RAW</name>
              <description>The raw interrupt bit to sign that the either frame eof from dma input or eoi marker is missing when encoding. But the number of decoded blocks is enough.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOS_UNMATCH_ERR_INT_RAW</name>
              <description>The raw interrupt bit to sign that the component number of a scan is 0 or does not match the sos marker's length when decoding.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MARKER_ERR_FST_SCAN_INT_RAW</name>
              <description>The raw interrupt bit to sign that the first scan has header marker error when decoding.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MARKER_ERR_OTHER_SCAN_INT_RAW</name>
              <description>The raw interrupt bit to sign that the following scans but not the first scan have header marker error when decoding.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDET_INT_RAW</name>
              <description>The raw interrupt bit to sign that JPEG format is not detected at the eof data of a packet when decoding.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECODE_TIMEOUT_INT_RAW</name>
              <description>The raw interrupt bit to sign that decode pause time is longer than the setting decode timeout time when decoding.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENCODE_TIMEOUT_INT_RAW</name>
              <description>The raw interrupt bit to sign that encode can not output bitstream time is longer than the setting encode timeout time when encoding.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable registers</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DONE_INT_ENA</name>
              <description>This enable interrupt bit turns to high level when JPEG finishes encoding a picture..</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLE_PARALLEL_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that rle parallel error when decoding.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CID_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that scan id check with component fails when decoding.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C_DHT_DC_ID_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that scan component's dc dht id check with dc dht table's id fails when decoding.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C_DHT_AC_ID_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that scan component's ac dht id check with ac dht table's id fails when decoding.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C_DQT_ID_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that scan component's dqt id check with dqt table's id fails when decoding.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_UXP_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that RST header marker is detected but restart interval is 0 when decoding.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_CHECK_NONE_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that RST header marker is not detected but restart interval is not 0 when decoding.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_CHECK_POS_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that RST header marker position mismatches with restart interval when decoding.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_INT_ENA</name>
              <description>The enable interrupt bit turns to high level when the last pixel of one square has been transmitted for Tx channel.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_COLOR_MODE_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that the selected source color mode is not supported.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCT_DONE_INT_ENA</name>
              <description>The enable interrupt bit to sign that one dct calculation is finished.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BS_LAST_BLOCK_EOF_INT_ENA</name>
              <description>The enable interrupt bit to sign that the coding process for last block is finished.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_CHECK_NONE_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that SOS header marker is not detected but there are still components left to be decoded.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_CHECK_POS_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that SOS header marker position wrong when decoding.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UXP_DET_INT_ENA</name>
              <description>The enable interrupt bit to sign that unsupported header marker is detected when decoding.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_FRAME_EOF_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that received pixel blocks are smaller than expected when encoding.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_FRAME_EOF_LACK_INT_ENA</name>
              <description>The enable interrupt bit to sign that the frame eof sign bit from dma input is missing when encoding. But the number of pixel blocks is enough.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DE_FRAME_EOF_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that decoded blocks are smaller than expected when decoding.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DE_FRAME_EOF_LACK_INT_ENA</name>
              <description>The enable interrupt bit to sign that the either frame eof from dma input or eoi marker is missing when encoding. But the number of decoded blocks is enough.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOS_UNMATCH_ERR_INT_ENA</name>
              <description>The enable interrupt bit to sign that the component number of a scan is 0 or does not match the sos marker's length when decoding.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MARKER_ERR_FST_SCAN_INT_ENA</name>
              <description>The enable interrupt bit to sign that the first scan has header marker error when decoding.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MARKER_ERR_OTHER_SCAN_INT_ENA</name>
              <description>The enable interrupt bit to sign that the following scans but not the first scan have header marker error when decoding.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDET_INT_ENA</name>
              <description>The enable interrupt bit to sign that JPEG format is not detected at the eof data of a packet when decoding.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECODE_TIMEOUT_INT_ENA</name>
              <description>The enable interrupt bit to sign that decode pause time is longer than the setting decode timeout time when decoding.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENCODE_TIMEOUT_INT_ENA</name>
              <description>The enable interrupt bit to sign that encode can not output bitstream time is longer than the setting encode timeout time when encoding.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
