esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LCD_CAM</name>
      <description>Camera/LCD Controller</description>
      <groupName>LCDCAM</groupName>
      <baseAddress>0x20396000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x60</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LCD_CAM</name>
        <value>13</value>
      </interrupt>
      <registers>
        <register>
          <name>LCD_CLOCK</name>
          <description>LCD clock config register.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x843</resetValue>
          <fields>
            <field>
              <name>LCD_CLKCNT_N</name>
              <description>f_LCD_PCLK = f_LCD_CLK / (reg_clkcnt_N + 1) when reg_clk_equ_sysclk is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CLK_EQU_SYSCLK</name>
              <description>1: f_LCD_PCLK = f_LCD_CLK. 0: f_LCD_PCLK = f_LCD_CLK / (reg_clkcnt_N + 1).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CK_IDLE_EDGE</name>
              <description>1: LCD_PCLK line is high when idle     0: LCD_PCLK line is low when idle.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CK_OUT_EDGE</name>
              <description>1: LCD_PCLK line is high in the first half data cycle.     0: LCD_PCLK line is low in the second half data cycle.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CLKM_DIV_NUM</name>
              <description>Integral LCD clock divider value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CLKM_DIV_B</name>
              <description>Fractional clock divider numerator value</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CLKM_DIV_A</name>
              <description>Fractional clock divider denominator value</description>
              <bitOffset>23</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CLK_SEL</name>
              <description>Select LCD module source clock. 0: no clock. 1: APLL. 2: CLK160. 3: no clock.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Set this bit to enable clk gate</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAM_CTRL</name>
          <description>CAM config register.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x800</resetValue>
          <fields>
            <field>
              <name>CAM_STOP_EN</name>
              <description>Camera stop enable signal, 1: camera stops when DMA Rx FIFO is full. 0: Not stop.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_VSYNC_FILTER_THRES</name>
              <description>Filter threshold value for CAM_VSYNC signal.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_UPDATE</name>
              <description>1: Update Camera registers, will be cleared by hardware. 0 : Not care.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_BYTE_ORDER</name>
              <description>1: invert data byte order. 0: Not change.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_BIT_ORDER</name>
              <description>1: Change data bit order, change CAM_DATA_in[7:0] to CAM_DATA_in[0:7] in one byte mode, and bits[15:0] to bits[0:15] in two byte mode.  0: Not change.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_LINE_INT_EN</name>
              <description>1: Enable to generate CAM_HS_INT. 0: Disable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_VS_EOF_EN</name>
              <description>1: CAM_VSYNC to generate in_suc_eof. 0: in_suc_eof is controlled by reg_cam_rec_data_cyclelen.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CLKM_DIV_NUM</name>
              <description>Integral Camera clock divider value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CLKM_DIV_B</name>
              <description>Fractional clock divider numerator value</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CLKM_DIV_A</name>
              <description>Fractional clock divider denominator value</description>
              <bitOffset>23</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CLK_SEL</name>
              <description>Select Camera module source clock. 0: no clock. 1: APLL. 2: CLK160. 3: no clock.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAM_CTRL1</name>
          <description>CAM config register.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAM_REC_DATA_BYTELEN</name>
              <description>Camera receive data byte length minus 1 to set DMA in_suc_eof_int.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_LINE_INT_NUM</name>
              <description>The line number minus 1 to generate cam_hs_int.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CLK_INV</name>
              <description>1: Invert  the input signal CAM_PCLK. 0: Not invert.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_VSYNC_FILTER_EN</name>
              <description>1: Enable CAM_VSYNC filter function. 0: bypass.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_2BYTE_EN</name>
              <description>1: The bit number of input data is 9~16.  0: The bit number of input data is 0~8.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_DE_INV</name>
              <description>CAM_DE invert enable signal, valid in high level.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_HSYNC_INV</name>
              <description>CAM_HSYNC invert enable signal, valid in high level.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_VSYNC_INV</name>
              <description>CAM_VSYNC invert enable signal, valid in high level.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_VH_DE_MODE_EN</name>
              <description>1: Input control signals are CAM_DE CAM_HSYNC and CAM_VSYNC. 0: Input control signals are CAM_DE and CAM_VSYNC.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_START</name>
              <description>Camera module start signal.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_RESET</name>
              <description>Camera module reset signal.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CAM_AFIFO_RESET</name>
              <description>Camera AFIFO reset signal.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAM_RGB_YUV</name>
          <description>CAM YUV/RGB converter configuration register.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0xc00000</resetValue>
          <fields>
            <field>
              <name>CAM_CONV_HOR_PIXEL_NUM</name>
              <description>the horizontal pixel number when rgb trans to yuv420</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CONV_8BITS_DATA_INV</name>
              <description>1:invert every two 8bits input data. 2. disabled.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CONV_YUV2YUV_MODE</name>
              <description>0: to yuv422. 1: to yuv420. 2: to yuv411. 3: disabled.  To enable yuv2yuv mode, trans_mode must be set to 1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CONV_YUV_MODE</name>
              <description>0: yuv422. 1: yuv420. 2: yuv411.The format that Data_in should be converted to.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CONV_PROTOCOL_MODE</name>
              <description>0:BT601. 1:BT709.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CONV_DATA_OUT_MODE</name>
              <description>LIMIT or FULL mode of Data out. 0: limit. 1: full</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CONV_DATA_IN_MODE</name>
              <description>LIMIT or FULL mode of Data in. 0: limit. 1: full</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CONV_MODE_8BITS_ON</name>
              <description>0: 16bits mode. 1: 8bits mode.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CONV_TRANS_MODE</name>
              <description>0: YUV to RGB. 1: RGB to YUV.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CONV_ENABLE</name>
              <description>0: Bypass converter. 1: Enable converter.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD_RGB_YUV</name>
          <description>LCD YUV/RGB converter configuration register.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0xe00000</resetValue>
          <fields>
            <field>
              <name>LCD_CONV_HOR_PIXEL_NUM</name>
              <description>the horizontal pixel number when rgb trans to yuv420</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_MEM_CLK_EN</name>
              <description>0:Open the clock gate for lcd convert memory.1: Close the clock gate for lcd convert memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_8BITS_DATA_INV</name>
              <description>1:invert every two 8bits input data. 2. disabled.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_TXTORX</name>
              <description>0: txtorx mode off. 1: txtorx mode on.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_RGB_MODE</name>
              <description>0:rgb565.1:rgb888.Determine the rgb format yuv420 trans to.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_RGB2RGB_MODE</name>
              <description>0: to rgb565. 1: to rgb888. Others: disabled.To enable rgb2rgb mode, trans_mode must be set to 0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_YUV2YUV_MODE</name>
              <description>0: to yuv422. 1: to yuv420. 2: to yuv411. 3: disabled.  To enable yuv2yuv mode, trans_mode must be set to 1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_YUV_MODE</name>
              <description>0: yuv422. 1: yuv420. 2: yuv411. When in yuv2yuv mode, yuv_mode decides the yuv mode of Data_in</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_PROTOCOL_MODE</name>
              <description>0:BT601. 1:BT709.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_DATA_OUT_MODE</name>
              <description>LIMIT or FULL mode of Data out. 0: limit. 1: full</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_DATA_IN_MODE</name>
              <description>LIMIT or FULL mode of Data in. 0: limit. 1: full</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_MODE_8BITS_ON</name>
              <description>0: 16bits mode. 1: 8bits mode.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_TRANS_MODE</name>
              <description>0: YUV to RGB. 1: RGB to YUV.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CONV_ENABLE</name>
              <description>0: Bypass converter. 1: Enable converter.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
