esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="LEDC0">
      <name>LEDC1</name>
      <baseAddress>0x2039c000</baseAddress>
      <description>LEDC1 Peripheral</description>
      <interrupt>
        <name>LEDC1</name>
        <value>32</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>LP_ADI</name>
      <description>LP_ADI Peripheral</description>
      <groupName>LP_ADI</groupName>
      <baseAddress>0x20805000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VER_DATE</name>
          <description>need_des</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x250704</resetValue>
          <fields>
            <field>
              <name>VER_DATE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDC_TOP_2_STS</name>
          <description>ANALOG DCDC 2 related status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DCDC_TOP_2_CAL_DONE</name>
              <description>cali done signal from dcdc 2 top</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_TOP_2_IN_VCM</name>
              <description>in vcm signal from dcdc 2 top</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_TOP_2_IN_CCM</name>
              <description>in ccm signal from dcdc 2 top</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_TOP_2_VCM_READY</name>
              <description>vcm_ready signal from dcdc 2 top</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDC_TOP_2_CFG</name>
          <description>ANALOG DCDC 2 related CONFIG</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>DCDC_TOP_2_DREG_MODE</name>
              <description>DCDC 2 dreg mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_TOP_2_CLEAR_VCM_RDY</name>
              <description>1: clear vcm rdy signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_TOP_2_IFSM_PCUR_LIMIT</name>
              <description>Current limit config</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PM_TOP_STS</name>
          <description>ANALOG PM TOP related status</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PM_TOP_CAL_DONE</name>
              <description>cali done signal from PM TOP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PM_TOP_DCDC_VCM_RDY</name>
              <description>vcm_ready signal from PM TOP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PM_TOP_CFG</name>
          <description>ANALOG PM TOP related CONFIG</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>PM_TOP_DREG_MODE</name>
              <description>PM TOP dreg mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PM_TOP_DCDC_CLR_VCM_RDY</name>
              <description>1: clear vcm rdy signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PM_TOP_DIG_REG_DSFMOS</name>
              <description>Current limit config</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_AHB_DMA</name>
      <description>LP_AHB_DMA Peripheral</description>
      <groupName>LP_AHB_DMA</groupName>
      <baseAddress>0x20819000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x178</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_AHB_PDMA_IN_CH0</name>
        <value>164</value>
      </interrupt>
      <interrupt>
        <name>LP_AHB_PDMA_IN_CH1</name>
        <value>165</value>
      </interrupt>
      <interrupt>
        <name>LP_AHB_PDMA_OUT_CH0</name>
        <value>166</value>
      </interrupt>
      <interrupt>
        <name>LP_AHB_PDMA_OUT_CH1</name>
        <value>167</value>
      </interrupt>
      <registers>
        <register>
          <dim>2</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>AHB_DMA_IN_INT_RAW_CH%s</name>
          <description>Raw interrupt status of RX channel %s</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_IN_DONE_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_SUC_EOF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_ERR_EOF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_DSCR_ERR_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_DSCR_EMPTY_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_INFIFO_OVF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_INFIFO_UDF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_AHBINF_RESP_ERR_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_RESP_ERR_CH%s_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>AHB_DMA_IN_INT_ST_CH%s</name>
          <description>Masked interrupt status of RX channel %s</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_IN_DONE_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_SUC_EOF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_ERR_EOF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_DSCR_ERR_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_DSCR_EMPTY_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_INFIFO_OVF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_INFIFO_UDF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_AHBINF_RESP_ERR_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_RESP_ERR_CH%s_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>AHB_DMA_IN_INT_ENA_CH%s</name>
          <description>Interrupt enable bits of RX channel %s</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_IN_DONE_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_SUC_EOF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_ERR_EOF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_DSCR_ERR_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_DSCR_EMPTY_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_INFIFO_OVF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_INFIFO_UDF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_AHBINF_RESP_ERR_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_RESP_ERR_CH%s_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>AHB_DMA_IN_INT_CLR_CH%s</name>
          <description>Interrupt clear bits of RX channel %s</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_IN_DONE_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_SUC_EOF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_ERR_EOF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_DSCR_ERR_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_DSCR_EMPTY_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_INFIFO_OVF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_INFIFO_UDF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_AHBINF_RESP_ERR_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_RESP_ERR_CH%s_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>AHB_DMA_OUT_INT_RAW_CH%s</name>
          <description>Raw interrupt status of TX channel %s</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUT_DONE_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_EOF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_DSCR_ERR_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_TOTAL_EOF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUTFIFO_OVF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUTFIFO_UDF_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_AHBINF_RESP_ERR_CH_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_RESP_ERR_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>AHB_DMA_OUT_INT_ST_CH%s</name>
          <description>Masked interrupt status of TX channel %s</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUT_DONE_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_EOF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_DSCR_ERR_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_TOTAL_EOF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUTFIFO_OVF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUTFIFO_UDF_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_AHBINF_RESP_ERR_CH_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_RESP_ERR_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
