esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <dim>2</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>AHB_DMA_OUT_INT_ENA_CH%s</name>
          <description>Interrupt enable bits of TX channel %s</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUT_DONE_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_EOF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_DSCR_ERR_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_TOTAL_EOF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUTFIFO_OVF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUTFIFO_UDF_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_AHBINF_RESP_ERR_CH_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_RESP_ERR_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>AHB_DMA_OUT_INT_CLR_CH%s</name>
          <description>Interrupt clear bits of TX channel %s</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUT_DONE_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_DONE_CH%s_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_EOF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_EOF_CH%s_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_DSCR_ERR_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_TOTAL_EOF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUTFIFO_OVF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUTFIFO_UDF_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_AHBINF_RESP_ERR_CH_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_RESP_ERR_CH%s_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_DMA_AHB_TEST</name>
          <description>reserved</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_AHB_TESTMODE</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_AHB_TESTADDR</name>
              <description>reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_DMA_MISC_CONF</name>
          <description>Miscellaneous register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_AHBM_RST_INTER</name>
              <description>Write 1 and then 0 to reset the internal AHB FSM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_ARB_PRI_DIS</name>
              <description>Configures whether to disable the fixed-priority channel arbitration.\\0: Enable\\1: Disable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_CLK_EN</name>
              <description>Configures clock gating.\\0: Support clock only when the application writes registers.\\ 1: Always force the clock on for registers.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_DMA_DATE</name>
          <description>Version control register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0x2505230</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_CONF0_CH%s</name>
          <description>Configuration register 0 of RX channel %s</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_IN_RST_CH</name>
              <description>Write 1 and then 0 to reset AHB_DMA channel 0 RX FSM and RX FIFO pointer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_LOOP_TEST_CH</name>
              <description>Reserved.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_INDSCR_BURST_EN_CH</name>
              <description>Configures whether to enable INCR burst transfer for RX channel %s to read descriptors.\\0: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_MEM_TRANS_EN_CH</name>
              <description>Configures whether to enable memory-to-memory data transfer.\\0: Disable\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_ETM_EN_CH</name>
              <description>Configures whether to enable ETM control for RX channel%s.\\0: Disable\\1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_DATA_BURST_MODE_SEL_CH</name>
              <description>Configures max burst size for Rx channel%s.\\2'b00: single\\ 2'b01: incr4\\ 2'b10: incr8\\ 2'b11: incr16\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_CONF1_CH%s</name>
          <description>Configuration register 1 of RX channel %s</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_IN_CHECK_OWNER_CH</name>
              <description>Configures whether to enable owner bit check for RX channel %s.\\0: Disable\\1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_INFIFO_STATUS_CH%s</name>
          <description>Receive FIFO status of RX channel %s</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0x7800003</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_INFIFO_FULL_CH</name>
              <description>Represents whether L1 RX FIFO is full.\\0: Not Full\\1: Full\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_INFIFO_EMPTY_CH</name>
              <description>Represents whether L1 RX FIFO is empty.\\0: Not empty\\1: Empty\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_INFIFO_CNT_CH</name>
              <description>Represents the number of data bytes in L1 RX FIFO for RX channel %s.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_REMAIN_UNDER_1B_CH</name>
              <description>reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_REMAIN_UNDER_2B_CH</name>
              <description>reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_REMAIN_UNDER_3B_CH</name>
              <description>reserved</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_REMAIN_UNDER_4B_CH</name>
              <description>reserved</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_BUF_HUNGRY_CH</name>
              <description>reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_POP_CH%s</name>
          <description>Pop control register of RX channel %s</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0x800</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_INFIFO_RDATA_CH</name>
              <description>Represents the data popped from AHB_DMA FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_INFIFO_POP_CH</name>
              <description>Configures whether to pop data from AHB_DMA FIFO.\\0: Invalid. No effect\\1: Pop\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_LINK_CH%s</name>
          <description>Linked list descriptor configuration and control register of RX channel %s</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_INLINK_AUTO_RET_CH</name>
              <description>Configures whether to return to current receive descriptor's address when there are some errors in current receiving data.\\0: Not return\\1: Return\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_INLINK_STOP_CH</name>
              <description>Configures whether to stop AHB_DMA's RX channel %s from receiving data.\\0: Invalid. No effect\\1: Stop\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_INLINK_START_CH</name>
              <description>Configures whether to enable AHB_DMA's RX channel %s for data transfer.\\0: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_INLINK_RESTART_CH</name>
              <description>Configures whether to restart RX channel %s for AHB_DMA transfer.\\0: Invalid. No effect\\1: Restart\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_INLINK_PARK_CH</name>
              <description>Represents the status of the receive descriptor's FSM.\\0: Running\\1: Idle\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_LINK_ADDR_CH%s</name>
          <description>Link list descriptor address configuration of RX channel %s</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_INLINK_ADDR_CH</name>
              <description>Configures the 32 bits of the first receive descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_STATE_CH%s</name>
          <description>Receive status of RX channel %s</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_INLINK_DSCR_ADDR_CH</name>
              <description>Represents the address of the lower 18 bits of the next receive descriptor to be processed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_DSCR_STATE_CH</name>
              <description>reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_IN_STATE_CH</name>
              <description>reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_SUC_EOF_DES_ADDR_CH%s</name>
          <description>Receive descriptor address when EOF occurs on RX channel %s</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_IN_SUC_EOF_DES_ADDR_CH</name>
              <description>Represents the address of the receive descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_ERR_EOF_DES_ADDR_CH%s</name>
          <description>Receive descriptor address when errors occur of RX channel %s</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_IN_ERR_EOF_DES_ADDR_CH</name>
              <description>Represents the address of the receive descriptor when there are some errors in the currently received data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_DONE_DES_ADDR_CH%s</name>
          <description>RX_done inlink descriptor address of RX channel %s</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_IN_DONE_DES_ADDR_CH</name>
              <description>Represents the address of the inlink descriptor when  this descriptor is completed .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_DSCR_CH%s</name>
          <description>Current receive descriptor address of RX channel %s</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_INLINK_DSCR_CH</name>
              <description>Represents the address of the next receive descriptor x+1 pointed by the current receive descriptor that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_DSCR_BF0_CH%s</name>
          <description>The last receive descriptor address of RX channel %s</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_INLINK_DSCR_BF0_CH</name>
              <description>Represents the address of the current receive descriptor x that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_DSCR_BF1_CH%s</name>
          <description>The second-to-last receive descriptor address of RX channel %s</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_INLINK_DSCR_BF1_CH</name>
              <description>Represents the address of the previous receive descriptor x-1 that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_PRI_CH%s</name>
          <description>Priority register of RX channel %s</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_RX_PRI_CH</name>
              <description>Configures the priority of RX channel %s.The larger of the value, the higher of the priority.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
