esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_IN_PERI_SEL_CH%s</name>
          <description>Peripheral selection register of RX channel %s</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0x3f</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_PERI_IN_SEL_CH</name>
              <description>Configures the peripheral connected to RX channel %s.\\ 0: ADC\\ 1: DAC\\ 2~15: DUMMY \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_RX_CH_ARB_WEIGH_CH%s</name>
          <description>RX channel %s arbitration weight configuration register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_RX_CH_ARB_WEIGH_CH</name>
              <description>Configures the weight(i.e the number of tokens) of RX channel%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH%s</name>
          <description>RX channel %s weight arbitration optimization enable register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_DMA_OUT_CONF0_CH0</name>
          <description>Configuration register 0 of TX channel 0</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_OUT_RST_CH0</name>
              <description>Configures the reset state of AHB_DMA channel 0 TX FSM and TX FIFO pointer.\\0: Release reset\\1: Reset\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_LOOP_TEST_CH0</name>
              <description>Reserved.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_AUTO_WRBACK_CH0</name>
              <description>Configures whether to enable automatic outlink write-back when all the data in TX FIFO has been transmitted.\\0: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_EOF_MODE_CH0</name>
              <description>Configures when to generate EOF flag.\\0: EOF flag for TX channel 0 is generated when data to be transmitted has been pushed into FIFO in AHB_DMA.\\ 1: EOF flag for TX channel 0 is generated when data to be transmitted has been popped from FIFO in AHB_DMA.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUTDSCR_BURST_EN_CH0</name>
              <description>Configures whether to enable INCR burst transfer for TX channel 0 reading descriptors.\\0: Disable\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_ETM_EN_CH0</name>
              <description>Configures whether to enable ETM control for TX channel 0.\\0: Disable\\1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH0</name>
              <description>Configures max burst size for TX channel0.\\2'b00: single\\ 2'b01: incr4\\ 2'b10: incr8\\ 2'b11: incr16\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_CONF1_CH%s</name>
          <description>Configuration register 1 of TX channel %s</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUT_CHECK_OWNER_CH</name>
              <description>Configures whether to enable owner bit check for TX channel %s.\\0: Disable\\1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUTFIFO_STATUS_CH%s</name>
          <description>Transmit FIFO status of TX channel %s</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <resetValue>0x7800002</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_OUTFIFO_FULL_CH</name>
              <description>Represents whether L1 TX FIFO is full.\\0: Not Full\\1: Full\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUTFIFO_EMPTY_CH</name>
              <description>Represents whether L1 TX FIFO is empty.\\0: Not empty\\1: Empty\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUTFIFO_CNT_CH</name>
              <description>Represents the number of data bytes in L1 TX FIFO for TX channel %s.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_REMAIN_UNDER_1B_CH</name>
              <description>Reserved.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_REMAIN_UNDER_2B_CH</name>
              <description>Reserved.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_REMAIN_UNDER_3B_CH</name>
              <description>Reserved.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_REMAIN_UNDER_4B_CH</name>
              <description>Reserved.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_PUSH_CH%s</name>
          <description>Push control register of TX channel %s</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUTFIFO_WDATA_CH</name>
              <description>Configures the data that need to be pushed into AHB_DMA FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUTFIFO_PUSH_CH</name>
              <description>Configures whether to push data into AHB_DMA FIFO.\\0: Invalid. No effect\\1: Push\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_LINK_CH%s</name>
          <description>Linked list descriptor configuration and control register of TX channel %s</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_OUTLINK_STOP_CH</name>
              <description>Configures whether to stop AHB_DMA's TX channel %s from transmitting data.\\0: Invalid. No effect\\1: Stop\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUTLINK_START_CH</name>
              <description>Configures whether to enable AHB_DMA's TX channel %s for data transfer.\\0: Disable\\1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUTLINK_RESTART_CH</name>
              <description>Configures whether to restart TX channel %s for AHB_DMA transfer.\\0: Invalid. No effect\\1: Restart\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUTLINK_PARK_CH</name>
              <description>Represents the status of the transmit descriptor's FSM.\\0: Running\\1: Idle\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_LINK_ADDR_CH%s</name>
          <description>Link list descriptor address configuration of TX channel %s</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUTLINK_ADDR_CH</name>
              <description>Configures the 32 bits of the first receive descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_STATE_CH%s</name>
          <description>Transmit status of TX channel %s</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUTLINK_DSCR_ADDR_CH</name>
              <description>Represents the lower 18 bits of the address of the next transmit descriptor to be processed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_DSCR_STATE_CH</name>
              <description>reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_STATE_CH</name>
              <description>reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_EOF_DES_ADDR_CH%s</name>
          <description>Transmit descriptor address when EOF occurs on TX channel %s</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUT_EOF_DES_ADDR_CH</name>
              <description>Represents the address of the transmit descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH%s</name>
          <description>The last transmit descriptor address when EOF occurs on TX channel %s</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH</name>
              <description>Represents the address of the transmit descriptor before the last transmit descriptor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_DONE_DES_ADDR_CH%s</name>
          <description>TX done outlink descriptor address of TX channel %s</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUT_DONE_DES_ADDR_CH</name>
              <description>Represents the address of the outlink descriptor when this descriptor is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_DSCR_CH%s</name>
          <description>Current transmit descriptor address of TX channel %s</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUTLINK_DSCR_CH</name>
              <description>Represents the address of the next transmit descriptor y+1 pointed by the current transmit descriptor that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_DSCR_BF0_CH%s</name>
          <description>The last transmit descriptor address of TX channel %s</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUTLINK_DSCR_BF0_CH</name>
              <description>Represents the address of the current transmit descriptor y that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_DSCR_BF1_CH%s</name>
          <description>The second-to-last transmit descriptor address of TX channel %s</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_OUTLINK_DSCR_BF1_CH</name>
              <description>Represents the address of the previous transmit descriptor y-1 that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_PRI_CH%s</name>
          <description>Priority register of TX channel %s</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_TX_PRI_CH</name>
              <description>Configures the priority of TX channel %s.The larger of the value, the higher of the priority.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_OUT_PERI_SEL_CH%s</name>
          <description>Peripheral selection register of TX channel %s</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <resetValue>0x3f</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_PERI_OUT_SEL_CH</name>
              <description>Configures the peripheral connected to TX channel %s.\\ 0: ADC\\ 1: DAC\\ 2~15: DUMMY \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_TX_CH_ARB_WEIGH_CH%s</name>
          <description>TX channel %s arbitration weight configuration register</description>
          <addressOffset>0x1bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_TX_CH_ARB_WEIGH_CH</name>
              <description>Configures the weight(i.e the number of tokens) of TX channel%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH%s</name>
          <description>TX channel %s weight arbitration optimization enable register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_DMA_OUT_CONF0_CH1</name>
          <description>Configuration register 0 of TX channel 1</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_OUT_RST_CH</name>
              <description>Configures the reset state of AHB_DMA channel %s TX FSM and TX FIFO pointer.\\0: Release reset\\1: Reset\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_LOOP_TEST_CH</name>
              <description>Reserved.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_AUTO_WRBACK_CH</name>
              <description>Configures whether to enable automatic outlink write-back when all the data in TX FIFO has been transmitted.\\0: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_EOF_MODE_CH</name>
              <description>Configures when to generate EOF flag.\\0: EOF flag for TX channel %s is generated when data to be transmitted has been pushed into FIFO in AHB_DMA.\\ 1: EOF flag for TX channel %s is generated when data to be transmitted has been popped from FIFO in AHB_DMA.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUTDSCR_BURST_EN_CH</name>
              <description>Configures whether to enable INCR burst transfer for TX channel %s reading descriptors.\\0: Disable\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_ETM_EN_CH</name>
              <description>Configures whether to enable ETM control for TX channel %s.\\0: Disable\\1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH</name>
              <description>Configures max burst size for TX channel%s.\\2'b00: single\\ 2'b01: incr4\\ 2'b10: incr8\\ 2'b11: incr16\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_DMA_INTR_MEM_START_ADDR</name>
          <description>Accessible address space start address configuration register</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_ACCESS_INTR_MEM_START_ADDR</name>
              <description>Configures the start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_DMA_INTR_MEM_END_ADDR</name>
          <description>Accessible address space end address configuration register</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_ACCESS_INTR_MEM_END_ADDR</name>
              <description>Configures the end address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
