esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>AHB_DMA_ARB_TIMEOUT</name>
          <description>TX arbitration timeout configuration register</description>
          <addressOffset>0x608</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_ARB_TIMEOUT</name>
              <description>Configures the time slot. Measurement unit: AHB bus clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_DMA_WEIGHT_EN</name>
          <description>TX weight arbitration enable register</description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_WEIGHT_EN</name>
              <description>Configures whether to enable weight arbitration.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_DMA_MODULE_CLK_EN</name>
          <description>Module clock force on register</description>
          <addressOffset>0x618</addressOffset>
          <size>32</size>
          <resetValue>0x18318c63</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_AHB_APB_SYNC_CLK_EN</name>
              <description>Configures whether to force on ahb_apb_sync 1~0 module clock. For bit n:\\0 : Not force on ahb_apb_sync n clock \\1 : Force on ahb_apb_sync n clock\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_DSCR_CLK_EN</name>
              <description>Configures whether to force on out_dscr 1~0 module clock. For bit n:\\0 : Not force on out_dscr n clock \\1 : Force on out_dscr n clock\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_OUT_CTRL_CLK_EN</name>
              <description>Configures whether to force on out_ctrl 1~0 module clock. For bit n:\\0 : Not force on out_ctrl n clock \\1 : Force on out_ctrl n clock\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_DSCR_CLK_EN</name>
              <description>Configures whether to force on in_dscr 1~0 module clock. For bit n:\\0 : Not force on in_dscr n clock \\1 : Force on in_dscr n clock\\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_IN_CTRL_CLK_EN</name>
              <description>Configures whether to force on in_ctrl 1~0 module clock. For bit n:\\0 : Not force on in_ctrl n clock \\1 : Force on in_ctrl n clock\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_CMD_ARB_CLK_EN</name>
              <description>Configures whether to force on cmd_arb module clock. \\0 : Not force on cmd_arb clock \\1 : Force on cmd_arb clock\\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_DMA_AHBINF_CLK_EN</name>
              <description>Configures whether to force on ahbinf module clock. \\0 : Not force on ahbinf clock \\1 : Force on ahbinf clock\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_DMA_AHBINF_RESP_ERR_STATUS0</name>
          <description>AHB response error status 0 register</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DMA_AHBINF_RESP_ERR_ADDR</name>
              <description>Represents the address of the AHB response error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_DMA_AHBINF_RESP_ERR_STATUS1</name>
          <description>AHB response error status 1 register</description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <resetValue>0x3e</resetValue>
          <fields>
            <field>
              <name>AHB_DMA_AHBINF_RESP_ERR_WR</name>
              <description>Represents the AHB response error is write request.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_AHBINF_RESP_ERR_ID</name>
              <description>Represents the AHB response error request id.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_AHBINF_RESP_ERR_CH_ID</name>
              <description>Represents the AHB response error request channel id.bit[1]=1:TX channel.\\bit[1]=0:RX channel.\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
