esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_ANA_PERI</name>
      <description>LP_ANA_PERI Peripheral</description>
      <groupName>LP_ANA_PERI</groupName>
      <baseAddress>0x20702000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x38</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_ANA</name>
        <value>143</value>
      </interrupt>
      <registers>
        <register>
          <name>LP_ANA_BOD_MODE0_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0xffc0100</resetValue>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_CLOSE_FLASH_ENA</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_PD_RF_ENA</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_INTR_WAIT</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_RESET_WAIT</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_CNT_CLR</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_INTR_ENA</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_RESET_SEL</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_RESET_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_BOD_MODE1_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE1_RESET_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_VDD_SOURCE_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x3f</resetValue>
          <fields>
            <field>
              <name>LP_ANA_DETMODE_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_PG_GLITCH_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_POWER_GLITCH_RESET_ENA</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_FIB_ENABLE</name>
          <description>need_des</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>LP_ANA_ANA_FIB_ENA</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_INT_RAW</name>
          <description>need_des</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_INT_ST</name>
          <description>need_des</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_INT_ST</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_INT_ENA</name>
          <description>need_des</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_INT_CLR</name>
          <description>need_des</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_LP_INT_RAW</name>
          <description>need_des</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_LP_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_LP_INT_ST</name>
          <description>need_des</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_LP_INT_ST</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_LP_INT_ENA</name>
          <description>need_des</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_LP_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_LP_INT_CLR</name>
          <description>need_des</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_LP_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_DATE</name>
          <description>need_des</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2505140</resetValue>
          <fields>
            <field>
              <name>LP_ANA_LP_ANA_DATE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
