esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_AON_CLKRST</name>
      <description>LP_AON_CLKRST Peripheral</description>
      <groupName>LP_AON_CLKRST</groupName>
      <baseAddress>0x20701000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LP_AONCLKRST_ROOT_CLK_CONF</name>
          <description>need_des</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x4000000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_SLOW_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_FAST_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_PLL80M_CLK_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_XTAL_CLK_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_FOSC_CLK_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_ANA_SEL_REF_PLL8M</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_LP_CLK_PO_EN</name>
          <description>need_des</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_CLK_CORE_EFUSE_OEN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_LP_BUS_OEN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_AON_SLOW_OEN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_AON_FAST_OEN</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_SLOW_OEN</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_FAST_OEN</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_FOSC_OEN</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_RC32K_OEN</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_SXTAL_OEN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_SOSC_OEN</name>
              <description>1'b1: probe sosc clk on
1'b0: probe sosc clk off</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_MISC</name>
          <description>need_des</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_ETM_EVENT_TICK_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_TIMER</name>
          <description>need_des</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_LP_TIMER_RST_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_WDT</name>
          <description>need_des</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_LP_WDT_RST_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_CLOCKCALI</name>
          <description>need_des</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_LP_CLK_CALI_XTAL_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LP_CLK_CALI_FOSC_RST_EN</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LP_CLK_CALI_SOSC_RST_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_ANAPERI</name>
          <description>need_des</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_LP_ANAPERI_RST_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HUK</name>
          <description>need_des</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_LP_HUK_RST_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_FOSC_DFREQ</name>
          <description>need_des</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x41400000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_FOSC_DFREQ</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_RC32K_DFREQ</name>
          <description>need_des</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x28a</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_RC32K_DFREQ</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_SOSC_DFREQ</name>
          <description>need_des</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x2b000000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_SOSC_DFREQ</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_XTAL32K</name>
          <description>need_des</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x66c00000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_DRES_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_DGM_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_DBUF_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_DAC_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HPCORE0_RESET_CAUSE</name>
          <description>need_des</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_HPCORE0_RESET_FLAG</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_RESET_CAUSE</name>
              <description>6'h1: POR reset
6'h3: digital system software reset
6'h5: PMU HP system power down reset
6'h7: HP system reset from HP watchdog0
6'h8: HP system reset from HP watchdog1
6'h9: HP system reset from LP watchdog
6'hb: HP core reset from HP watchdog
6'hc: HP core software reset
6'hd: HP core reset from LP watchdog
6'hf: brown out reset
6'h10: LP watchdog chip reset
6'h12: super watch dog reset
6'h13: glitch reset
6'h14: efuse crc error reset
6'h16: HP usb jtag chip reset
6'h17: HP usb uart chip reset
6'h18: HP jtag reset
6'h1a: HP core lockup</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HPCORE1_RESET_CAUSE</name>
          <description>need_des</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_HPCORE1_RESET_FLAG</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_RESET_CAUSE</name>
              <description>6'h1: POR reset
6'h3: digital system software reset
6'h5: PMU HP system power down reset
6'h7: HP system reset from HP watchdog0
6'h8: HP system reset from HP watchdog1
6'h9: HP system reset from LP watchdog
6'hb: HP core reset from HP watchdog
6'hc: HP core software reset
6'hd: HP core reset from LP watchdog
6'hf: brown out reset
6'h10: LP watchdog chip reset
6'h12: super watch dog reset
6'h13: glitch reset
6'h14: efuse crc error reset
6'h16: HP usb jtag chip reset
6'h17: HP usb uart chip reset
6'h18: HP jtag reset
6'h1a: HP core lockup</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_LPCORE_RESET_CAUSE</name>
          <description>need_des</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_LPCORE_RESET_FLAG</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LPCORE_RESET_CAUSE</name>
              <description>6'h1: POR reset
6'h9: PMU LP PERI power down reset
6'ha: PMU LP CPU reset
6'hf: brown out reset
6'h10: LP watchdog chip reset
6'h12: super watch dog reset
6'h13: glitch reset
6'h14: software reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_LP_CPU_MASK</name>
              <description>1'b0: enable lpcore pmu_lp_cpu_reset reset_cause, 1'b1: disable lpcore pmu_lp_cpu_reset reset_cause</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LPCORE_RESET_FLAG_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HPCORE0_RESET_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x40010000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_HPCORE0_SW_STALL_CODE</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_STALL_WAIT</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_STALL_EN</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_RESET_LENGTH</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_ENABLE_LP_WDT_RESET</name>
              <description>write 1 to enable lp_wdt reset hpcore0 feature, write 0 to disable lp_wdt reset hpcore0 feature</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_SW_RESET</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL</name>
              <description>1'b1: boot from HP TCM ROM: 0x4FC00000
1'b0: boot from LP TCM RAM:  0x50108000</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN</name>
              <description>write 1 to enable hpcore0 lockup reset feature, write 0 to disable hpcore0 lockup reset feature</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HPCORE1_RESET_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x40010000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_HPCORE1_SW_STALL_CODE</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_STALL_WAIT</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_STALL_EN</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_RESET_LENGTH</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_ENABLE_LP_WDT_RESET</name>
              <description>write 1 to enable lp_wdt reset hpcore1 feature, write 0 to disable lp_wdt reset hpcore1 feature</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_SW_RESET</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL</name>
              <description>1'b1: boot from HP TCM ROM: 0x4FC00000
1'b0: boot from LP TCM RAM:  0x50108000</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN</name>
              <description>write 1 to enable hpcore1 lockup reset feature, write 0 to disable hpcore1 lockup reset feature</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_TOUCH_AON</name>
          <description>need_des</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RST_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
