esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>LP_AONCLKRST_HP_CLK_CTRL</name>
          <description>HP Clock Control Register.</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x28</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_CLK_XTAL_FREQ</name>
              <description>XTAL Clock Freq Indication. 7'd40: xtal_40m, 7'd48: xtal_48m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_CPLL_DIV</name>
          <description>need_des</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0xf2</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_CPLL_REF_DIV</name>
              <description>cpll ref div value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CPLL_FB_DIV</name>
              <description>cpll fb div value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_APLL_DIV</name>
          <description>need_des</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x85</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_APLL_REF_DIV</name>
              <description>apll ref div value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_APLL_OUT_DIV</name>
              <description>apll out div value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_MSPI_DIV</name>
          <description>need_des</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0xc1</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_MSPI_REF_DIV</name>
              <description>MSPI ref div value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_MSPI_FB_DIV</name>
              <description>MSPI fb div value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_MSPI_CHGP_DCUR</name>
              <description>MSPI chgp_dcur value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_MSPI_LF_RES</name>
              <description>MSPI lf_res value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_LP_ADI</name>
          <description>need_des</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RST_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_LPROOT_CLK_DIV</name>
          <description>need_des</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_LPAON_CLK_DIV_NUM</name>
              <description>lp aon clock divide num</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LPPERI_CLK_DIV_NUM</name>
              <description>lp peri clock divide num</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_CPLL_CFG</name>
          <description>need_des</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_CPLL_DBIAS</name>
              <description>cpll dbias value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CPLL_DCHGP</name>
              <description>cpll dchgp value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CPLL_DR1</name>
              <description>cpll dr1 value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CPLL_DR3</name>
              <description>cpll dr3 value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_APLL_SDM</name>
          <description>need_des</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_APLL_SDM</name>
              <description>apll sdm value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_RTC_SAR2_PWDET_CCT</name>
          <description>need_des</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_RTC_SAR2_PWDET_CCT</name>
              <description>rtc_sar2_pwdet_cct value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_DATE</name>
          <description>need_des</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2507300</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_DATE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
