esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_PERI_PMS</name>
      <description>LP_PERI_PMS Peripheral</description>
      <groupName>LP_PERI_PMS</groupName>
      <baseAddress>0x20706000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x94</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_PERI0_PMS</name>
        <value>160</value>
      </interrupt>
      <interrupt>
        <name>LP_PERI1_PMS</name>
        <value>161</value>
      </interrupt>
      <registers>
        <register>
          <name>LP_SYSREG_CTRL</name>
          <description>lp_sysreg read/write control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_SYSREG</name>
              <description>Configures lp_sysreg registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_SYSREG</name>
              <description>Configures lp_sysreg registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_SYSREG</name>
              <description>Configures lp_sysreg registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_SYSREG</name>
              <description>Configures lp_sysreg registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_SYSREG</name>
              <description>Configures lp_sysreg registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_SYSREG</name>
              <description>Configures lp_sysreg registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_SYSREG</name>
              <description>Configures lp_sysreg registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_SYSREG</name>
              <description>Configures lp_sysreg registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SYSREG_LOCK</name>
              <description>Set 1 to lock lp_sysreg peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_CTRL</name>
          <description>lp_aonclkrst read/write control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_AONCLKRST</name>
              <description>Configures lp_aonclkrst registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_AONCLKRST</name>
              <description>Configures lp_aonclkrst registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_AONCLKRST</name>
              <description>Configures lp_aonclkrst registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_AONCLKRST</name>
              <description>Configures lp_aonclkrst registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_AONCLKRST</name>
              <description>Configures lp_aonclkrst registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_AONCLKRST</name>
              <description>Configures lp_aonclkrst registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_AONCLKRST</name>
              <description>Configures lp_aonclkrst registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_AONCLKRST</name>
              <description>Configures lp_aonclkrst registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LOCK</name>
              <description>Set 1 to lock lp_aonclkrst peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANAPERI_CTRL</name>
          <description>lp_anaperi read/write control register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_ANAPERI</name>
              <description>Configures lp_anaperi registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_ANAPERI</name>
              <description>Configures lp_anaperi registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_ANAPERI</name>
              <description>Configures lp_anaperi registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_ANAPERI</name>
              <description>Configures lp_anaperi registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_ANAPERI</name>
              <description>Configures lp_anaperi registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_ANAPERI</name>
              <description>Configures lp_anaperi registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_ANAPERI</name>
              <description>Configures lp_anaperi registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_ANAPERI</name>
              <description>Configures lp_anaperi registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANAPERI_LOCK</name>
              <description>Set 1 to lock lp_anaperi peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_HUK_CTRL</name>
          <description>lp_huk read/write control register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_HUK</name>
              <description>Configures lp_huk registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_HUK</name>
              <description>Configures lp_huk registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_HUK</name>
              <description>Configures lp_huk registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_HUK</name>
              <description>Configures lp_huk registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_HUK</name>
              <description>Configures lp_huk registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_HUK</name>
              <description>Configures lp_huk registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_HUK</name>
              <description>Configures lp_huk registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_HUK</name>
              <description>Configures lp_huk registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_HUK_LOCK</name>
              <description>Set 1 to lock lp_huk peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_PMU_CTRL</name>
          <description>lp_pmu read/write control register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_PMU</name>
              <description>Configures lp_pmu registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_PMU</name>
              <description>Configures lp_pmu registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_PMU</name>
              <description>Configures lp_pmu registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_PMU</name>
              <description>Configures lp_pmu registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_PMU</name>
              <description>Configures lp_pmu registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_PMU</name>
              <description>Configures lp_pmu registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_PMU</name>
              <description>Configures lp_pmu registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_PMU</name>
              <description>Configures lp_pmu registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_PMU_LOCK</name>
              <description>Set 1 to lock lp_pmu peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TOUCH_AON_CTRL</name>
          <description>lp_touch_aon read/write control register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_TOUCH_AON</name>
              <description>Configures lp_touch_aon registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_TOUCH_AON</name>
              <description>Configures lp_touch_aon registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_TOUCH_AON</name>
              <description>Configures lp_touch_aon registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_TOUCH_AON</name>
              <description>Configures lp_touch_aon registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_TOUCH_AON</name>
              <description>Configures lp_touch_aon registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_TOUCH_AON</name>
              <description>Configures lp_touch_aon registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_TOUCH_AON</name>
              <description>Configures lp_touch_aon registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_TOUCH_AON</name>
              <description>Configures lp_touch_aon registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_TOUCH_AON_LOCK</name>
              <description>Set 1 to lock lp_touch_aon peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
