esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>LP_PERI_PMS_CTRL</name>
          <description>lp_peri_pms read/write control register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_PERI_PMS</name>
              <description>Configures lp_peri_pms registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_PERI_PMS</name>
              <description>Configures lp_peri_pms registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE1_LP_PERI_PMS</name>
              <description>Configures lp_peri_pms registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE2_LP_PERI_PMS</name>
              <description>Configures lp_peri_pms registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_PERI_PMS</name>
              <description>Configures lp_peri_pms registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_PERI_PMS</name>
              <description>Configures lp_peri_pms registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_PERI_PMS</name>
              <description>Configures lp_peri_pms registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_PERI_PMS</name>
              <description>Configures lp_peri_pms registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_PERI_PMS_LOCK</name>
              <description>Set 1 to lock lp_peri_pms peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TEE_CTRL</name>
          <description>lp_tee read/write control register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_TEE</name>
              <description>Configures lp_tee registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_TEE</name>
              <description>Configures lp_tee registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE1_LP_TEE</name>
              <description>Configures lp_tee registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE2_LP_TEE</name>
              <description>Configures lp_tee registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_TEE</name>
              <description>Configures lp_tee registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_TEE</name>
              <description>Configures lp_tee registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_TEE</name>
              <description>Configures lp_tee registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_TEE</name>
              <description>Configures lp_tee registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_TEE_LOCK</name>
              <description>Set 1 to lock lp_tee peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_APM_CTRL</name>
          <description>lp_apm read/write control register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_APM</name>
              <description>Configures lp_apm registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_APM</name>
              <description>Configures lp_apm registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE1_LP_APM</name>
              <description>Configures lp_apm registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE2_LP_APM</name>
              <description>Configures lp_apm registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_APM</name>
              <description>Configures lp_apm registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_APM</name>
              <description>Configures lp_apm registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_APM</name>
              <description>Configures lp_apm registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_APM</name>
              <description>Configures lp_apm registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_APM_LOCK</name>
              <description>Set 1 to lock lp_apm peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TIMER_CTRL</name>
          <description>lp_timer read/write control register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_TIMER</name>
              <description>Configures lp_timer registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_TIMER</name>
              <description>Configures lp_timer registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_TIMER</name>
              <description>Configures lp_timer registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_TIMER</name>
              <description>Configures lp_timer registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_TIMER</name>
              <description>Configures lp_timer registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_TIMER</name>
              <description>Configures lp_timer registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_TIMER</name>
              <description>Configures lp_timer registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_TIMER</name>
              <description>Configures lp_timer registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_TIMER_LOCK</name>
              <description>Set 1 to lock lp_timer peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_WDT_CTRL</name>
          <description>lp_wdt read/write control register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_WDT</name>
              <description>Configures lp_wdt registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_WDT</name>
              <description>Configures lp_wdt registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_WDT</name>
              <description>Configures lp_wdt registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_WDT</name>
              <description>Configures lp_wdt registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_WDT</name>
              <description>Configures lp_wdt registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_WDT</name>
              <description>Configures lp_wdt registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_WDT</name>
              <description>Configures lp_wdt registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_WDT</name>
              <description>Configures lp_wdt registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_WDT_LOCK</name>
              <description>Set 1 to lock lp_wdt peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CLK_CALI_SOSC_CTRL</name>
          <description>lp_clk_cali_sosc read/write control register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_CLK_CALI_SOSC</name>
              <description>Configures lp_clk_cali_sosc registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_CLK_CALI_SOSC</name>
              <description>Configures lp_clk_cali_sosc registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_CLK_CALI_SOSC</name>
              <description>Configures lp_clk_cali_sosc registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_CLK_CALI_SOSC</name>
              <description>Configures lp_clk_cali_sosc registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_CLK_CALI_SOSC</name>
              <description>Configures lp_clk_cali_sosc registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_CLK_CALI_SOSC</name>
              <description>Configures lp_clk_cali_sosc registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_CLK_CALI_SOSC</name>
              <description>Configures lp_clk_cali_sosc registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_CLK_CALI_SOSC</name>
              <description>Configures lp_clk_cali_sosc registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CLK_CALI_SOSC_LOCK</name>
              <description>Set 1 to lock lp_clk_cali_sosc peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CLK_CALI_FOSC_CTRL</name>
          <description>lp_clk_cali_fosc read/write control register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_CLK_CALI_FOSC</name>
              <description>Configures lp_clk_cali_fosc registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_CLK_CALI_FOSC</name>
              <description>Configures lp_clk_cali_fosc registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_CLK_CALI_FOSC</name>
              <description>Configures lp_clk_cali_fosc registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_CLK_CALI_FOSC</name>
              <description>Configures lp_clk_cali_fosc registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_CLK_CALI_FOSC</name>
              <description>Configures lp_clk_cali_fosc registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_CLK_CALI_FOSC</name>
              <description>Configures lp_clk_cali_fosc registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_CLK_CALI_FOSC</name>
              <description>Configures lp_clk_cali_fosc registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_CLK_CALI_FOSC</name>
              <description>Configures lp_clk_cali_fosc registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CLK_CALI_FOSC_LOCK</name>
              <description>Set 1 to lock lp_clk_cali_fosc peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
