esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>LP_AHB_PDMA_CTRL</name>
          <description>lp_ahb_pdma read/write control register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_AHB_PDMA</name>
              <description>Configures lp_ahb_pdma registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_AHB_PDMA</name>
              <description>Configures lp_ahb_pdma registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_AHB_PDMA</name>
              <description>Configures lp_ahb_pdma registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_AHB_PDMA</name>
              <description>Configures lp_ahb_pdma registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_AHB_PDMA</name>
              <description>Configures lp_ahb_pdma registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_AHB_PDMA</name>
              <description>Configures lp_ahb_pdma registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_AHB_PDMA</name>
              <description>Configures lp_ahb_pdma registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_AHB_PDMA</name>
              <description>Configures lp_ahb_pdma registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AHB_PDMA_LOCK</name>
              <description>Set 1 to lock lp_ahb_pdma peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_DAC_CTRL</name>
          <description>lp_dac read/write control register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_DAC</name>
              <description>Configures lp_dac registers read permission in tee mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_DAC</name>
              <description>Configures lp_dac registers read permission in ree0 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_DAC</name>
              <description>Configures lp_dac registers read permission in ree1 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_DAC</name>
              <description>Configures lp_dac registers read permission in ree2 mode.\\
0: can not be read \\
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_DAC</name>
              <description>Configures lp_dac registers write permission in tee mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_DAC</name>
              <description>Configures lp_dac registers write permission in ree0 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_DAC</name>
              <description>Configures lp_dac registers write permission in ree1 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_DAC</name>
              <description>Configures lp_dac registers write permission in ree2 mode.\\
0: can not be write \\
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_DAC_LOCK</name>
              <description>Set 1 to lock lp_dac peri_apm configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_PERI0_0</name>
          <description>LP_PERI0 PMS configuration &amp; info register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_PERI0_PMS_EXCEPTION_CLR</name>
              <description>Configures whether or not to clear lp_peri0 peri_pms_record_reg.\\
0: No clear\\
1: Clear peri_pms_record_reg\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_PERI0_PMS_EXCEPTION_DET</name>
              <description>Represents whether the lp_peri0 pms has been triggered.\\
0: No triggered\\
1: Has been triggered\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_PERI0_PMS_EXCEPTION_ID</name>
              <description>Represents the master id when lp_peri0 pms has been triggered.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_PERI0_PMS_EXCEPTION_MODE</name>
              <description>Represents the security mode when lp_peri0 pms has been triggered.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_PERI0_1</name>
          <description>LP_PERI0 PMS exception addr record register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>LP_PERI0_PMS_EXCEPTION_ADDR</name>
              <description>Represents the access address (bit27~bit0) when lp_peri0 pms has been triggered.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_PERI0_PMS_EXCEPTION_ADDR_CONST</name>
              <description>Represents the access address (bit31~bit28) when lp_peri0 pms has been triggered.\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_PERI1_0</name>
          <description>LP_PERI1 PMS configuration &amp; info register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_PERI1_PMS_EXCEPTION_CLR</name>
              <description>Configures whether or not to clear lp_peri1 peri_pms_record_reg.\\
0: No clear\\
1: Clear peri_pms_record_reg\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_PERI1_PMS_EXCEPTION_DET</name>
              <description>Represents whether the lp_peri1 pms has been triggered.\\
0: No triggered\\
1: Has been triggered\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_PERI1_PMS_EXCEPTION_ID</name>
              <description>Represents the master id when lp_peri1 pms has been triggered.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_PERI1_PMS_EXCEPTION_MODE</name>
              <description>Represents the security mode when lp_peri1 pms has been triggered.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_PERI1_1</name>
          <description>LP_PERI1 PMS exception addr record register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>LP_PERI1_PMS_EXCEPTION_ADDR</name>
              <description>Represents the access address (bit27~bit0) when lp_peri1 pms has been triggered.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_PERI1_PMS_EXCEPTION_ADDR_CONST</name>
              <description>Represents the access address (bit31~bit28) when lp_peri1 pms has been triggered.\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EN</name>
          <description>APM interrupt enable register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_PERI1_PMS_INT_EN</name>
              <description>Configures to enable lp_peri1 pms interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_PERI0_PMS_INT_EN</name>
              <description>Configures to enable lp_peri0 pms interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_ERR_CONF</name>
          <description>Clock gating register</description>
          <addressOffset>0x7f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUS_ERR_RESP_EN</name>
              <description>Configures whether return error response to cpu when access blocked
0: disable error response \\
1: enable error response  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gating register</description>
          <addressOffset>0x7f8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to keep the clock always on.\\
0: enable automatic clock gating \\
1: keep the clock always on  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x7fc</addressOffset>
          <size>32</size>
          <resetValue>0x2509240</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
