esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_PWR</name>
      <description>LP_PWR Peripheral</description>
      <groupName>LP_PWR</groupName>
      <baseAddress>0x20804000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xa8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LPCPU_CFG</name>
          <description>config register for lpcpu power control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x700</resetValue>
          <fields>
            <field>
              <name>LPCPU_STALL_WAIT_TIMER</name>
              <description>stall wait timer for lpcpu during lpcpu power off sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCPU_STALL_FLAG_EN</name>
              <description>1: wait for stall rdy input during lpcpu power off sequence
0:do not wait for stall rdy during lpcpu power off sequence</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCPU_STALL_EN</name>
              <description>1: enable lpcpu stall during lpcpu power off sequence
0: disable lpcpu stall during lpcpu power off sequence</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCPU_RESET_EN</name>
              <description>1: enable lpcpu reset during lpcpu power off sequence
0: disable lpcpu reset during lpcpu power off sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCPU_SLP_WAITI_FLAG_EN</name>
              <description>1: validates lp cpu waiti rdy signal during lpcpu power off sequence
0: invalidates lp cpu waiti rdy signal during lpcpu power off sequence</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCPU_SLP_BYPASS_INTR_EN</name>
              <description>1: enable interrupt bypass signal for lpcpu during lpcpu power off sequence
0: disable interrupt bypass signal for lpcpu during lpcpu power off sequence</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPCPU_STS</name>
          <description>status register for LPCPU PWR</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>LPCPU_CUR_ST</name>
              <description>current power state register for lpcpu</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPCPU_IN_POWER_ON</name>
              <description>1:lpcpu current in power on mode
0:lpcpu not in power on mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPCPU_STALL_RDY</name>
              <description>1:lpcpu stall not ready
0:lpcpu stall ready</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPCPU_WAITI_RDY</name>
              <description>1:lpcpu stall waiti ready
0:lpcpu stall waiti ready</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPCPU_CTRL</name>
          <description>ctrl register for lpcpu power control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPCPU_SW_SLEEP_REQ</name>
              <description>software sleep request config for lpcpu</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LPCPU_SW_WAKEUP_REQ</name>
              <description>software wakeup request config for lpcpu</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LPCPU_FORCE_STALL</name>
              <description>1: force stall lpcpu
0: no change</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCPU_FORCE_RESET</name>
              <description>1: force reset lpcpu
0: no change</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCPU_FORCE_NO_RESET</name>
              <description>1: force no reset lpcpu
0: no change</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPCPU_WAKEUP_SRC</name>
          <description>wakeup source register for lpcpu</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPCPU_WAKEUP_SOURCE_EN</name>
              <description>wakeup source enable signal for lpcpu</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPCPU_REJECT_SRC</name>
          <description>reject source register for lpcpu</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPCPU_REJECT_SOURCE_EN</name>
              <description>reject source enable signal for lpcpu</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCPU_SLEEP_REJECT_EN</name>
              <description>1: sleep request can be rejected
0: sleep request cannot be rejected</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPCPU_WAKEUP_CAUSE</name>
          <description>wakeup cause register for lpcpu</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPCPU_WAKEUP_CAUSE</name>
              <description>wakeup cause for lpcpu</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPCPU_REJECT_CAUSE</name>
          <description>reject cause register for lpcpu</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPCPU_REJECT_CAUSE</name>
              <description>reject cause for lpcpu</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPCPU_CAUSE_CLR</name>
          <description>cause clear register for lpcpu</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPCPU_REJECT_CAUSE_CLR</name>
              <description>reject cause clear signal for lpcpu</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LPCPU_WAKEUP_CAUSE_CLR</name>
              <description>wakeup cause clear signal for lpcpu</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APPWR_PWR_CFG</name>
          <description>config register for apsys pwr and clk mode</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0xaaaa</resetValue>
          <fields>
            <field>
              <name>CPU_PWR_MODE</name>
              <description>cpu pwr mode config register for apsys</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOP_PWR_MODE</name>
              <description>top pwr mode config register for apsys</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNNT_PWR_MODE</name>
              <description>cnnt pwr mode config register for apsys</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPALIVE_PWR_MODE</name>
              <description>hpalive pwr mode config register for apsys</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_0_PWR_MODE</name>
              <description>mem_0 pwr mode config register for apsys</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_1_PWR_MODE</name>
              <description>mem_1 pwr mode config register for apsys</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_2_PWR_MODE</name>
              <description>mem_2 pwr mode config register for apsys</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_3_PWR_MODE</name>
              <description>mem_3 pwr mode config register for apsys</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APPWR_CLK_CFG</name>
          <description>config register for apsys pwr and clk mode</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0xffff</resetValue>
          <fields>
            <field>
              <name>CPU_CLK_MODE</name>
              <description>cpu clk mode config register for apsys</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOP_CLK_MODE</name>
              <description>top clk mode config register for apsys</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNNT_CLK_MODE</name>
              <description>cnnt clk mode config register for apsys</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPALIVE_CLK_MODE</name>
              <description>hpalive clk mode config register for apsys</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_0_CLK_MODE</name>
              <description>mem_0 clk mode config register for apsys</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_1_CLK_MODE</name>
              <description>mem_1 clk mode config register for apsys</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_2_CLK_MODE</name>
              <description>mem_2 clk mode config register for apsys</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_3_CLK_MODE</name>
              <description>mem_3 clk mode config register for apsys</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APPWR_CFG</name>
          <description>config register for apsys pwr</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x80000</resetValue>
          <fields>
            <field>
              <name>STALL_WAIT_TIMER</name>
              <description>the wait timer config for ap sys</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_EN</name>
              <description>the backup enable config register for ap sys</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESTORE_MODE</name>
              <description>restore mode config register for apsys</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_MODE</name>
              <description>backup mode config register for apsys</description>
              <bitOffset>14</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPCPU_STALL_EN</name>
              <description>1: enable hpcpu stall
0: disable hpcpu stall</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APPWR_STS</name>
          <description>status register for apsys pwr</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>APPWR_CUR_ST</name>
              <description>current power state register for apsys</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APSYS_IN_POWER_ON</name>
              <description>1:apsys current in power on mode
0:apsys not in power on mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APPWR_CTRL</name>
          <description>ctrl register for appwr power control</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APPWR_SW_SLEEP_REQ</name>
              <description>software sleep request config for appwr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APPWR_SW_WAKEUP_REQ</name>
              <description>software wakeup request config for appwr</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HPCPU_FORCE_STALL</name>
              <description>1: force stall hpcpu
0: no change</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APPWR_WAKEUP_SRC</name>
          <description>wakeup source register for appwr</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APPWR_WAKEUP_SOURCE_EN</name>
              <description>wakeup enable signal for appwr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APPWR_REJECT_SRC</name>
          <description>reject source register for appwr</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APPWR_REJECT_SOURCE_EN</name>
              <description>reject enable signal for appwr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APPWR_SLEEP_REJECT_EN</name>
              <description>1: sleep request can be rejected
0: sleep request cannot be rejected</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APPWR_WAKEUP_CAUSE</name>
          <description>wakeup cause register for appwr</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APPWR_WAKEUP_CAUSE</name>
              <description>wakeup cause for appwr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APPWR_REJECT_CAUSE</name>
          <description>reject cause register for appwr</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APPWR_REJECT_CAUSE</name>
              <description>reject cause for appwr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APPWR_CAUSE_CLR</name>
          <description>cause clear register for appwr</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APPWR_REJECT_CAUSE_CLR</name>
              <description>reject cause clear signal for appwr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APPWR_WAKEUP_CAUSE_CLR</name>
              <description>wakeup cause clear signal for appwr</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WIFI_CTRL</name>
          <description>ctrl register for wifi power control</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WIFI_SW_SLEEP_REQ</name>
              <description>software sleep request config for wifi</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WIFI_SW_WAKEUP_REQ</name>
              <description>software wakeup request config for wifi</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WIFI_WAKEUP_SRC</name>
          <description>wakeup source register for wifi</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WIFI_WAKEUP_SOURCE_EN</name>
              <description>wakeup enable signal for wifi</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_CTRL</name>
          <description>ctrl register for ble power control</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLE_SW_SLEEP_REQ</name>
              <description>software sleep request config for ble</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BLE_SW_WAKEUP_REQ</name>
              <description>software wakeup request config for ble</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
