esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>BLE_WAKEUP_SRC</name>
          <description>wakeup source register for ble</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLE_WAKEUP_SOURCE_EN</name>
              <description>wakeup enable signal for ble</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZB_CTRL</name>
          <description>ctrl register for zb power control</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ZB_SW_SLEEP_REQ</name>
              <description>software sleep request config for zb</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ZB_SW_WAKEUP_REQ</name>
              <description>software wakeup request config for zb</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZB_WAKEUP_SRC</name>
          <description>wakeup source register for zb</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ZB_WAKEUP_SOURCE_EN</name>
              <description>wakeup enazb signal for zb</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEMPWR_CTRL</name>
          <description>ctrl register for modempwr power control</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODEMPWR_SW_SLEEP_REQ</name>
              <description>software sleep request config for modempwr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEMPWR_SW_WAKEUP_REQ</name>
              <description>software wakeup request config for modempwr</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEMPWR_WAKEUP_SRC</name>
          <description>wakeup source register for modempwr</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODEMPWR_WAKEUP_SOURCE_EN</name>
              <description>wakeup enable signal for modempwr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERI_PAD_WAKE_SLP_EN</name>
          <description>used for future potential eco, others don't care</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_WAKEUP_EN</name>
              <description>1:enables uart wakeup after hpcpu stall
0:disables uart wakeup after hpcpu stall</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_PAD_SLP_SEL</name>
              <description>1:hppad will sleep after hpcpu stall
0:hppad will not sleep after hpcpu stall</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_PAD_SLP_SEL</name>
              <description>1:hppad will sleep after hpcpu stall
0:hppad will not sleep after hpcpu stall</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOUCH_CTRL</name>
          <description>ctrl register for touch power control</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_SW_SLEEP_REQ</name>
              <description>software sleep request config for touch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TOUCH_SW_WAKEUP_REQ</name>
              <description>software wakeup request config for touch</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOUCH_CFG</name>
          <description>ctrl register for touch power control</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x64</resetValue>
          <fields>
            <field>
              <name>TOUCH_SLEEP_CYCLES</name>
              <description>sleep cycles config for touch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_SLEEP_TIMER_EN</name>
              <description>1:enables touch timer wakeup source
0:disables touch timer wakeup source</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_FORCE_DONE</name>
              <description>1: force touch task to done state, turn off touch
0: no effect</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOUCH_STS</name>
          <description>status register for TOUCH PWR</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>TOUCH_CUR_ST</name>
              <description>current power state register for touch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_IN_POWER_ON</name>
              <description>1:touch current in power on mode
0:touch not in power on mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALI_CTRL</name>
          <description>ctrl register for cali power control</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CALI_SW_SLEEP_REQ</name>
              <description>software sleep request config for cali</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CALI_SW_WAKEUP_REQ</name>
              <description>software wakeup request config for cali</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALI_STS</name>
          <description>status register for CALI PWR</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>CALI_CUR_ST</name>
              <description>current power state register for cali</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CALI_IN_POWER_ON</name>
              <description>1:cali current in power on mode
0:cali not in power on mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPPERI_PWR_CLK_CFG</name>
          <description>ctrl register for lpcpu power clock mode control</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0xb</resetValue>
          <fields>
            <field>
              <name>LPPERI_SW_CLK_MODE</name>
              <description>software configs LPPERI clk mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPERI_SW_PWR_MODE</name>
              <description>software configs LPPERI pwr mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPPERI_CTRL</name>
          <description>ctrl register for lpperi power control</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>LPPERI_SW_FORCE_ON</name>
              <description>1: software wake lpperi</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPERI_SW_REQ</name>
              <description>software req  pulse for following mode register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_PAD_CFG</name>
          <description>config register for lppad hold signal</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPPAD_HOLD_CPU_PAUSE_EN</name>
              <description>1: hold lppad when hpcpu stalls
0: not hold lppad when hpcpu stalls</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HIGH_LP_PAD_HOLD</name>
              <description>1:force pull up lppad hold signal
0:no effect</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_LOW_LP_PAD_HOLD</name>
              <description>1:force pull low lppad hold signal
0:no effect</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNT_PAD_CFG</name>
          <description>config register for cnntpad hold signal</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNNT_PAD_HOLD_CPU_PAUSE_EN</name>
              <description>1: hold cnntpad when hpcpu stalls
0: not hold cnntpad when hpcpu stalls</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HIGH_CNNT_PAD_HOLD</name>
              <description>1:force pull up cnntpad hold signal
0:no effect</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_LOW_CNNT_PAD_HOLD</name>
              <description>1:force pull low cnntpad hold signal
0:no effect</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PAD_CFG</name>
          <description>config register for hppad hold signal</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HPPAD_HOLD_CPU_PAUSE_EN</name>
              <description>1: hold hppad when hpcpu stalls
0: not hold hppad when hpcpu stalls</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HIGH_HP_PAD_HOLD</name>
              <description>1:force pull up hppad hold signal
0:no effect</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_LOW_HP_PAD_HOLD</name>
              <description>1:force pull low hppad hold signal
0:no effect</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>need_des</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ZB_WAKE_PROCESS_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEMPWR_WAKE_PROCESS_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_WAKE_PROCESS_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIFI_WAKE_PROCESS_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_CALI_WAKE_PROCESS_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_WAKE_PROCESS_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCPU_WAKE_PROCESS_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APPWR_WAKE_PROCESS_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>need_des</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ZB_WAKE_PROCESS_INT_ST</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODEMPWR_WAKE_PROCESS_INT_ST</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLE_WAKE_PROCESS_INT_ST</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WIFI_WAKE_PROCESS_INT_ST</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XTAL_CALI_WAKE_PROCESS_INT_ST</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_WAKE_PROCESS_INT_ST</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPCPU_WAKE_PROCESS_INT_ST</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APPWR_WAKE_PROCESS_INT_ST</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>need_des</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ZB_WAKE_PROCESS_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEMPWR_WAKE_PROCESS_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_WAKE_PROCESS_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIFI_WAKE_PROCESS_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_CALI_WAKE_PROCESS_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_WAKE_PROCESS_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCPU_WAKE_PROCESS_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APPWR_WAKE_PROCESS_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>need_des</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ZB_WAKE_PROCESS_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEMPWR_WAKE_PROCESS_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BLE_WAKE_PROCESS_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WIFI_WAKE_PROCESS_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>XTAL_CALI_WAKE_PROCESS_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TOUCH_WAKE_PROCESS_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LPCPU_WAKE_PROCESS_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APPWR_WAKE_PROCESS_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
