esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>VER_DATE</name>
          <description>need_des</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0x250718</resetValue>
          <fields>
            <field>
              <name>VER_DATE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_TEE</name>
      <description>Low-power Trusted Execution Environment</description>
      <groupName>LP_TEE</groupName>
      <baseAddress>0x20706800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>M2_MODE_CTRL</name>
          <description>TEE mode control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>M2_MODE</name>
              <description>Configures M0 security level mode.\\
0: tee_mode \\
1: ree_mode0 \\
2: ree_mode1 \\
3: ree_mode2  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M2_LOCK</name>
              <description>Set 1 to lock m2 tee configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M16_MODE_CTRL</name>
          <description>TEE mode control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>M16_MODE</name>
              <description>Configures M0 security level mode.\\
0: tee_mode \\
1: ree_mode0 \\
2: ree_mode1 \\
3: ree_mode2  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M16_LOCK</name>
              <description>Set 1 to lock m16 tee configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M17_MODE_CTRL</name>
          <description>TEE mode control register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>M17_MODE</name>
              <description>Configures M0 security level mode.\\
0: tee_mode \\
1: ree_mode0 \\
2: ree_mode1 \\
3: ree_mode2  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M17_LOCK</name>
              <description>Set 1 to lock m17 tee configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M18_MODE_CTRL</name>
          <description>TEE mode control register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>M18_MODE</name>
              <description>Configures M0 security level mode.\\
0: tee_mode \\
1: ree_mode0 \\
2: ree_mode1 \\
3: ree_mode2  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M18_LOCK</name>
              <description>Set 1 to lock m18 tee configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M19_MODE_CTRL</name>
          <description>TEE mode control register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>M19_MODE</name>
              <description>Configures M0 security level mode.\\
0: tee_mode \\
1: ree_mode0 \\
2: ree_mode1 \\
3: ree_mode2  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M19_LOCK</name>
              <description>Set 1 to lock m19 tee configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCE_ACC_HP</name>
          <description>Force access to hpmem configuration register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FORCE_ACC_HPMEM_EN</name>
              <description>Configures whether to allow LP CPU to force access to HP_MEM regardless of permission management.\\
0x5a: enable force access HP_MEM \\
other: disable force access HP_MEM \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_GPIO_SECURITY</name>
          <description>need des</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_GPIO_LOCK</name>
              <description>This field decides whether lp_gpio_config can be locked, or not. 0 (default): unlocked. 1: locked.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_GPIO_SECURITY_1</name>
          <description>need des</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_GPIO_LOCK_P1</name>
              <description>This field decides whether hp_gpio_config of PIN0~31 can be locked, or not. 0 (default): unlocked. 1: locked.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_GPIO_SECURITY_2</name>
          <description>need des</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_GPIO_LOCK_P2</name>
              <description>This field decides whether hp_gpio_config of PIN32~62 can be locked, or not. 0 (default): unlocked. 1: locked.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gating register</description>
          <addressOffset>0x3f8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to keep the clock always on.\\
0: enable automatic clock gating \\
1: keep the clock always on  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2506240</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
