esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>STATUS</name>
          <description>LP UART status register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0xe000c000</resetValue>
          <fields>
            <field>
              <name>RXFIFO_CNT</name>
              <description>Represents the number of valid data bytes in RX FIFO.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DSRN</name>
              <description>Represents the level of the internal LP UART DSR signal.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTSN</name>
              <description>Represents the level of the internal LP UART CTS signal.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXD</name>
              <description>Represents the  level of the internal LP UART RXD signal.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFIFO_CNT</name>
              <description>Represents the number of valid data bytes in RX FIFO.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DTRN</name>
              <description>Represents the level of the internal LP UART DTR signal.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTSN</name>
              <description>Represents the level of the internal LP UART RTS signal.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXD</name>
              <description>Represents the  level of the internal LP UART TXD signal.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF0_SYNC</name>
          <description>Configuration register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x1c</resetValue>
          <fields>
            <field>
              <name>PARITY</name>
              <description>Configures the parity check mode.\\
0: Even parity\\
1: Odd parity\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARITY_EN</name>
              <description>Configures whether or not to enable LP UART parity check.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT_NUM</name>
              <description>Configures the number of data bits.\\
0: 5 bits\\
1: 6 bits\\
2: 7 bits\\
3: 8 bits\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP_BIT_NUM</name>
              <description>Configures the number of stop bits.\\
0: Invalid. No effect\\
1: 1 bits\\
2: 1.5 bits\\
3: 2 bits\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXD_BRK</name>
              <description>Configures whether or not to send NULL characters when finishing data transmission.\\
0: Not send\\
1: Send\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPBACK</name>
              <description>Configures whether or not to enable LP UART loopback test.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_FLOW_EN</name>
              <description>Configures whether or not to enable flow control for the transmitter.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXD_INV</name>
              <description>Configures whether or not to invert the level of LP UART RXD signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXD_INV</name>
              <description>Configures whether or not to invert the level of LP UART TXD signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_RX_DAT_OVF</name>
              <description>Configures whether or not to disable data overflow detection for the LP UART receiver.\\
0: Enable\\
1: Disable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_WR_MASK</name>
              <description>Configures whether or not to store the received data with errors into FIFO.\\
0: Store\\
1: Not store\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CLK_EN</name>
              <description>Configures whether or not to enable clock gating for LP UART memory.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_RTS</name>
              <description>Configures the RTS signal used in software flow control.\\
0: The LP UART transmitter is allowed to send data.\\
1: The LP UART transmitted is not allowed to send data.\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_RST</name>
              <description>Configures whether or not to reset the LP UART RX FIFO.\\
0: Not reset\\
1: Reset\\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFO_RST</name>
              <description>Configures whether or not to reset the LP UART TX FIFO.\\
0: Not reset\\
1: Reset\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF1</name>
          <description>Configuration register 1</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x6060</resetValue>
          <fields>
            <field>
              <name>RXFIFO_FULL_THRHD</name>
              <description>Configures the threshold for RX FIFO being full.\\Measurement unit: byte.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFO_EMPTY_THRHD</name>
              <description>Configures the threshold for TX FIFO being empty.\\Measurement unit: byte.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTS_INV</name>
              <description>Configures whether or not to invert the level of LP UART CTS signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSR_INV</name>
              <description>Configures whether or not to invert the level of LP UART DSR signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS_INV</name>
              <description>Configures whether or not to invert the level of LP UART RTS signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTR_INV</name>
              <description>Configures whether or not to invert the level of LP UART DTR signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_DTR</name>
              <description>Configures the DTR signal used in software flow control.\\
0: Data to be transmitted is not ready.\\
1: Data to be transmitted is ready.\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Configures clock gating.\\
0: Support clock only when the application writes registers.\\
1: Always force the clock on for registers.\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWFC_CONF_SYNC</name>
          <description>Hardware flow control configuration</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_FLOW_THRHD</name>
              <description>Configures the maximum number of data bytes that can be received  during hardware flow control.\\Measurement unit: byte.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FLOW_EN</name>
              <description>Configures whether or not to enable the LP UART receiver.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEP_CONF0</name>
          <description>LP UART sleep configuration register 0</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WK_CHAR1</name>
              <description>Configures wakeup character 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WK_CHAR2</name>
              <description>Configures wakeup character 2.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WK_CHAR3</name>
              <description>Configures wakeup character 3.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WK_CHAR4</name>
              <description>Configures wakeup character 4.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEP_CONF1</name>
          <description>LP UART sleep configuration register 1</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WK_CHAR0</name>
              <description>Configures wakeup character 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEP_CONF2</name>
          <description>LP UART sleep configuration register 2</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x1420f0</resetValue>
          <fields>
            <field>
              <name>ACTIVE_THRESHOLD</name>
              <description>Configures the number of RXD edge changes to wake up the chip in wakeup mode 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_WAKE_UP_THRHD</name>
              <description>Configures the number of received data bytes to wake up the chip in wakeup mode 1.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WK_CHAR_NUM</name>
              <description>Configures the number of wakeup characters.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WK_CHAR_MASK</name>
              <description>Configures whether or not to mask wakeup characters.\\
0: Not mask\\
1: Mask\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WK_MODE_SEL</name>
              <description>Configures which wakeup mode to select.\\
0: Mode 0\\
1: Mode 1\\
2: Mode 2\\
3: Mode 3\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWFC_CONF0_SYNC</name>
          <description>Software flow control character configuration</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x1311</resetValue>
          <fields>
            <field>
              <name>XON_CHAR</name>
              <description>Configures the XON character for flow control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XOFF_CHAR</name>
              <description>Configures the XOFF character for flow control.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XON_XOFF_STILL_SEND</name>
              <description>Configures whether the LP UART transmitter can send XON or XOFF characters when it is disabled.\\
0: Cannot send\\
1: Can send\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_FLOW_CON_EN</name>
              <description>Configures whether or not to enable software flow control.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XONOFF_DEL</name>
              <description>Configures whether or not to remove flow control characters from the received data.\\
0: Not move\\
1: Move\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_XON</name>
              <description>Configures whether the transmitter continues to sending data.\\
0: Not send\\
1: Send\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_XOFF</name>
              <description>Configures whether or not to stop the transmitter from sending data.\\
0: Not stop\\
1: Stop\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEND_XON</name>
              <description>Configures whether or not to send XON characters.\\
0: Not send\\
1: Send\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEND_XOFF</name>
              <description>Configures whether or not to send XOFF characters.\\
0: Not send\\
1: Send\\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWFC_CONF1</name>
          <description>Software flow control character configuration</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x6000</resetValue>
          <fields>
            <field>
              <name>XON_THRESHOLD</name>
              <description>Configures the threshold for data in RX FIFO to send XON characters in software flow control.\\Measurement unit: byte.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XOFF_THRESHOLD</name>
              <description>Configures the threshold for data in RX FIFO to send XOFF characters in software flow control.\\Measurement unit: byte.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBRK_CONF_SYNC</name>
          <description>TX break character configuration</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0xa</resetValue>
          <fields>
            <field>
              <name>TX_BRK_NUM</name>
              <description>Configures the number of NULL characters to be sent after finishing data transmission.\\Valid only when LP_UART_TXD_BRK is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDLE_CONF_SYNC</name>
          <description>Frame end idle time configuration</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x40100</resetValue>
          <fields>
            <field>
              <name>RX_IDLE_THRHD</name>
              <description>Configures the threshold to generate a frame end signal when the receiver takes more time to receive one data byte data.\\Measurement unit: bit time (the time to transmit 1 bit).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_IDLE_NUM</name>
              <description>Configures the interval between two data transfers.\\Measurement unit: bit time (the time to transmit 1 bit).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DELAY_CONF_SYNC</name>
          <description>RS485 mode configuration</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DL0_EN</name>
              <description>Configures whether or not to add a turnaround delay of 1 bit before the start bit.\\
0: Not add\\
1: Add\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DL1_EN</name>
              <description>Configures whether or not to add a turnaround delay of 1 bit after the stop bit.\\
0: Not add\\
1: Add\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AT_CMD_PRECNT_SYNC</name>
          <description>Pre-sequence timing configuration</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x901</resetValue>
          <fields>
            <field>
              <name>PRE_IDLE_NUM</name>
              <description>Configures the idle time before the receiver receives the first AT_CMD.\\Measurement unit: bit time (the time to transmit 1 bit).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AT_CMD_POSTCNT_SYNC</name>
          <description>Post-sequence timing configuration</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x901</resetValue>
          <fields>
            <field>
              <name>POST_IDLE_NUM</name>
              <description>Configures the interval between the last AT_CMD and subsequent data.\\Measurement unit: bit time (the time to transmit 1 bit).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
