esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>FAULT_DETECT</name>
          <description>Fault detection configuration and status register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>F0_EN</name>
              <description>Configures whether or not to enable event_f0 generation.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F1_EN</name>
              <description>Configures whether or not to enable event_f1 generation.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F2_EN</name>
              <description>Configures whether or not to enable event_f2 generation.\\0: Disable\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F0_POLE</name>
              <description>Configures event_f0 trigger polarity on FAULT0 source from GPIO matrix.\\0: Level low\\1: Level high</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F1_POLE</name>
              <description>Configures event_f1 trigger polarity on FAULT1 source from GPIO matrix.\\0: Level low\\1: Level high</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F2_POLE</name>
              <description>Configures event_f2 trigger polarity on FAULT2 source from GPIO matrix.\\0: Level low\\1: Level high</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVENT_F0</name>
              <description>Represents whether or not an event_f0 is on going.\\0: No action\\1: On going</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EVENT_F1</name>
              <description>Represents whether or not an event_f1 is on going.\\0: No action\\1: On going</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EVENT_F2</name>
              <description>Represents whether or not an event_f2 is on going.\\0: No action\\1: On going</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_TIMER_CFG</name>
          <description>Capture timer configuration register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAP_TIMER_EN</name>
              <description>Configures whether or not to enable capture timer increment.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_SYNCI_EN</name>
              <description>Configures whether or not to enable capture timer sync.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_SYNCI_SEL</name>
              <description>Configures the selection of capture module sync input.\\0: None\\1: Timer0 sync_out\\2: Timer1 sync_out\\3: Timer2 sync_out\\4: SYNC0 from GPIO matrix\\5: SYNC1 from GPIO matrix\\6: SYNC2 from GPIO matrix\\7: None</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_SYNC_SW</name>
              <description>Configures the generation of a capture timer sync when reg_cap_synci_en is 1.\\0: Invalid, No effect\\1: Trigger a capture timer sync, capture timer is loaded with value in phase register</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_TIMER_PHASE</name>
          <description>Capture timer sync phase register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAP_PHASE</name>
              <description>Configures phase value for capture timer sync operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CAP_CH%s_CFG</name>
          <description>Capture channel %s configuration register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAP_EN</name>
              <description>Configures whether or not to enable capture on channel %s.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_MODE</name>
              <description>Configures which edge of capture on channel %s after prescaling is used.\\0: None\\Bit0 is set to 1: Rnable capture on the negative edge\\Bit1 is set to 1: Enable capture on the positive edge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_PRESCALE</name>
              <description>Configures prescale value on possitive edge of CAP%s. Prescale value = PWM_CAP%s_PRESCALE + 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_IN_INVERT</name>
              <description>Configures whether or not to invert CAP%s from GPIO matrix before prescale.\\0: Normal\\1: Invert</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_SW</name>
              <description>Configures the generation of software capture.\\0: Invalid, No effect\\1: Trigger a software forced capture on channel %s</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CAP_CH%s</name>
          <description>CAP%s capture value register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAP_VALUE</name>
              <description>Represents value of last capture on CAP%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_STATUS</name>
          <description>Last capture trigger edge information register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAP0_EDGE</name>
              <description>Represents edge of last capture trigger on channel0.\\0: Posedge\\1: Negedge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP1_EDGE</name>
              <description>Represents edge of last capture trigger on channel1.\\0: Posedge\\1: Negedge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP2_EDGE</name>
              <description>Represents edge of last capture trigger on channel2.\\0: Posedge\\1: Negedge</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPDATE_CFG</name>
          <description>Generator Update configuration register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>GLOBAL_UP_EN</name>
              <description>Configures whether or not to enable global update for all active registers in MCPWM module.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLOBAL_FORCE_UP</name>
              <description>Configures the generation of global forced update for all active registers in MCPWM module. A toggle (software invert its value) will trigger a global forced update. Valid only when MCPWM_GLOBAL_UP_EN and MCPWM_OP0/1/2_UP_EN are both set to 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP0_UP_EN</name>
              <description>Configures whether or not to enable update of active registers in PWM operator0. Valid only when PWM_GLOBAL_UP_EN is set to 1.\\0: Disable\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP0_FORCE_UP</name>
              <description>Configures the generation of forced update for active registers in PWM operator0. A toggle (software invert its value) will trigger a forced update. Valid only when MCPWM_GLOBAL_UP_EN and MCPWM_OP0_UP_EN are both set to 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP1_UP_EN</name>
              <description>Configures whether or not to enable update of active registers in PWM operator1. Valid only when PWM_GLOBAL_UP_EN is set to 1.\\0: Disable\\1: Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP1_FORCE_UP</name>
              <description>Configures the generation of forced update for active registers in PWM operator1. A toggle (software invert its value) will trigger a forced update. Valid only when MCPWM_GLOBAL_UP_EN and MCPWM_OP1_UP_EN are both set to 1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP2_UP_EN</name>
              <description>Configures whether or not to enable update of active registers in PWM operator2. Valid only when PWM_GLOBAL_UP_EN is set to 1.\\0: Disable\\1: Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP2_FORCE_UP</name>
              <description>Configures the generation of forced update for active registers in PWM operator2. A toggle (software invert its value) will trigger a forced update. Valid only when MCPWM_GLOBAL_UP_EN and MCPWM_OP2_UP_EN are both set to 1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER0_STOP_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered when the timer 0 stops.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_STOP_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered when the timer 1 stops.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_STOP_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered when the timer 2 stops.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_TEZ_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a PWM timer 0 TEZ event.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_TEZ_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a PWM timer 1 TEZ event.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_TEZ_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a PWM timer 2 TEZ event.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_TEP_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a PWM timer 0 TEP event.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_TEP_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a PWM timer 1 TEP event.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_TEP_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a PWM timer 2 TEP event.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT0_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered when event_f0 starts.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered when event_f1 starts.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT2_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered when event_f2 starts.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT0_CLR_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered when event_f0 clears.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1_CLR_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered when event_f1 clears.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT2_CLR_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered when event_f2 clears.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR0_TEA_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a PWM operator 0 TEA event.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR1_TEA_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a PWM operator 1 TEA event.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR2_TEA_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a PWM operator 2 TEA event.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR0_TEB_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a PWM operator 0 TEB event.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR1_TEB_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a PWM operator 1 TEB event.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR2_TEB_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a PWM operator 2 TEB event.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ0_CBC_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a cycle-by-cycle mode action on PWM0.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ1_CBC_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a cycle-by-cycle mode action on PWM1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ2_CBC_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a cycle-by-cycle mode action on PWM2.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ0_OST_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a one-shot mode action on PWM0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ1_OST_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a one-shot mode action on PWM1.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ2_OST_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by a one-shot mode action on PWM2.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by capture on CAP0.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by capture on CAP1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2_INT_ENA</name>
              <description>Enable bit: Write 1 to enable the interrupt triggered by capture on CAP2.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
