esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>TASK_EN</name>
          <description>Task enable register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TASK_CMPR0_A_UP_EN</name>
              <description>Configures whether or not to enable PWM generator0 timer stamp A's shadow register update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CMPR1_A_UP_EN</name>
              <description>Configures whether or not to enable PWM generator1 timer stamp A's shadow register update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CMPR2_A_UP_EN</name>
              <description>Configures whether or not to enable PWM generator2 timer stamp A's shadow register update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CMPR0_B_UP_EN</name>
              <description>Configures whether or not to enable PWM generator0 timer stamp B's shadow register update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CMPR1_B_UP_EN</name>
              <description>Configures whether or not to enable PWM generator1 timer stamp B's shadow register update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CMPR2_B_UP_EN</name>
              <description>Configures whether or not to enable PWM generator2 timer stamp B's shadow register update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GEN_STOP_EN</name>
              <description>Configures whether or not to enable all PWM generate stop task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_SYNC_EN</name>
              <description>Configures whether or not to enable timer0 sync task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_SYNC_EN</name>
              <description>Configures whether or not to enable timer1 sync task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_SYNC_EN</name>
              <description>Configures whether or not to enable timer2 sync task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_PERIOD_UP_EN</name>
              <description>Configures whether or not to enable timer0 period update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_PERIOD_UP_EN</name>
              <description>Configures whether or not to enable timer1 period update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_PERIOD_UP_EN</name>
              <description>Configures whether or not to enable timer2 period update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TZ0_OST_EN</name>
              <description>Configures whether or not to enable one shot trip0 task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TZ1_OST_EN</name>
              <description>Configures whether or not to enable one shot trip1 task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TZ2_OST_EN</name>
              <description>Configures whether or not to enable one shot trip2 task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CLR0_OST_EN</name>
              <description>Configures whether or not to enable one shot trip0 clear task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CLR1_OST_EN</name>
              <description>Configures whether or not to enable one shot trip1 clear task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CLR2_OST_EN</name>
              <description>Configures whether or not to enable one shot trip2 clear task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CAP0_EN</name>
              <description>Configures whether or not to enable capture0 task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CAP1_EN</name>
              <description>Configures whether or not to enable capture1 task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CAP2_EN</name>
              <description>Configures whether or not to enable capture2 task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_A_UP_EN</name>
              <description>Configures whether or not to enable timer0 timestamp a update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_A_UP_EN</name>
              <description>Configures whether or not to enable timer1 timestamp a update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_A_UP_EN</name>
              <description>Configures whether or not to enable timer2 timestamp a update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_B_UP_EN</name>
              <description>Configures whether or not to enable timer0 timestamp b update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_B_UP_EN</name>
              <description>Configures whether or not to enable timer1 timestamp b update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_B_UP_EN</name>
              <description>Configures whether or not to enable timer2 timestamp b update task receive.\\0: Disable\\1: Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_EN2</name>
          <description>Event enable register2</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EVT_OP0_TEE1_EN</name>
              <description>Configures whether or not to enable PWM generator0 timer equal OP0_TSTMP_E1_REG event generate.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OP1_TEE1_EN</name>
              <description>Configures whether or not to enable PWM generator1 timer equal OP1_TSTMP_E1_REG event generate.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OP2_TEE1_EN</name>
              <description>Configures whether or not to enable PWM generator2 timer equal OP2_TSTMP_E1_REG event generate.\\0: Disable\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OP0_TEE2_EN</name>
              <description>Configures whether or not to enable PWM generator0 timer equal OP0_TSTMP_E2_REG event generate.\\0: Disable\\1: Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OP1_TEE2_EN</name>
              <description>Configures whether or not to enable PWM generator1 timer equal OP1_TSTMP_E2_REG event generate.\\0: Disable\\1: Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OP2_TEE2_EN</name>
              <description>Configures whether or not to enable PWM generator2 timer equal OP2_TSTMP_E2_REG event generate.\\0: Disable\\1: Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER0_TEA_EN</name>
              <description>Configures whether or not to enable timer0 equal tea event generate.\\0: Disable\\1: Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER1_TEA_EN</name>
              <description>Configures whether or not to enable timer1 equal tea event generate.\\0: Disable\\1: Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER2_TEA_EN</name>
              <description>Configures whether or not to enable timer2 equal tea event generate.\\0: Disable\\1: Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER0_TEB_EN</name>
              <description>Configures whether or not to enable timer0 equal teb event generate.\\0: Disable\\1: Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER1_TEB_EN</name>
              <description>Configures whether or not to enable timer1 equal teb event generate.\\0: Disable\\1: Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER2_TEB_EN</name>
              <description>Configures whether or not to enable timer2 equal teb event generate.\\0: Disable\\1: Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>OP%s_TSTMP_E1</name>
          <description>Generator%s timer stamp E1 value register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OP_TSTMP_E1</name>
              <description>Configures generator%s timer stamp E1 value register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>OP%s_TSTMP_E2</name>
          <description>Generator%s timer stamp E2 value register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OP_TSTMP_E2</name>
              <description>Configures generator%s timer stamp E2 value register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK</name>
          <description>Global configuration register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open register clock gate.\\0: Open the clock gate only when application writes registers\\1: Force open the clock gate for register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Version register.</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <resetValue>0x2403190</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Configures the version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>TIMER%s_CFG2</name>
          <description>PWM timer%s timestamp a configuration register.</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <resetValue>0xff</resetValue>
          <fields>
            <field>
              <name>TIMER_A</name>
              <description>Configures the timestamp a shadow of PWM timer%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_A_UPMETHOD</name>
              <description>Configures the update method for active register of PWM timer%s timestamp a.\\0: Immediate\\1: TEZ\\2: Sync\\3: TEZ or sync\\TEZ here and below means timer equal zero event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_A_DIR</name>
              <description>Configures the direction of the timer when timer%s value equal a value for event trigger.\\0: up \\1: down</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>TIMER%s_CFG3</name>
          <description>PWM timer%s timestamp b configuration register.</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0xff</resetValue>
          <fields>
            <field>
              <name>TIMER_B</name>
              <description>Configures the timestamp b shadow of PWM timer%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_B_UPMETHOD</name>
              <description>Configures the update method for active register of PWM timer%s timestamp b.\\0: Immediate\\1: TEZ\\2: Sync\\3: TEZ or sync\\TEZ here and below means timer equal zero event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_B_DIR</name>
              <description>Configures the direction of the timer when timer%s value equal b value for event trigger.\\0: up \\1: down</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
