esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PCNT0</name>
      <description>PCNT0 Peripheral</description>
      <groupName>PCNT</groupName>
      <baseAddress>0x20389000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PCNT0</name>
        <value>114</value>
      </interrupt>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>U%s_CONF0</name>
          <description>Configuration register 0 for unit %s</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x3c10</resetValue>
          <fields>
            <field>
              <name>FILTER_THRES_U</name>
              <description>Configures the maximum threshold for the filter. Any pulses with width less than this will be ignored when the filter is enabled. \\
Measurement unit: APB_CLK cycles.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_EN_U</name>
              <description>This is the enable bit for unit %s's input filter.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_ZERO_EN_U</name>
              <description>This is the enable bit for unit %s's zero comparator.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_H_LIM_EN_U</name>
              <description>This is the enable bit for unit %s's thr_h_lim comparator. Configures it to enable the high limit interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_L_LIM_EN_U</name>
              <description>This is the enable bit for unit %s's thr_l_lim comparator. Configures it to enable the low limit interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES0_EN_U</name>
              <description>This is the enable bit for unit %s's thres0 comparator.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES1_EN_U</name>
              <description>This is the enable bit for unit %s's thres1 comparator.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_NEG_MODE_U</name>
              <description>Configures the behavior when the signal input of channel 0 detects a negative edge.\\
1: Increment the counter\\
2: Decrement the counter\\
0, 3: No effect \\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_POS_MODE_U</name>
              <description>Configures the behavior when the signal input of channel 0 detects a positive edge. \\
1: Increment the counter\\
2: Decrement the counter\\
0, 3: No effect \\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_HCTRL_MODE_U</name>
              <description>Configures how the CH%s_POS_MODE/CH%s_NEG_MODE settings will be modified when the control signal is high. \\
0: No modification\\
1: Invert behavior (increase -&gt; decrease, decrease -&gt; increase)\\
2, 3: Inhibit counter modification \\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_LCTRL_MODE_U</name>
              <description>Configures how the CH%s_POS_MODE/CH%s_NEG_MODE settings will be modified when the control signal is low. \\
0: No modification\\
1: Invert behavior (increase -&gt; decrease, decrease -&gt; increase)\\
2, 3: Inhibit counter modification\\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_NEG_MODE_U</name>
              <description>Configures the behavior when the signal input of channel 1 detects a negative edge. \\
1: Increment the counter\\
2: Decrement the counter\\
0, 3: No effect \\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_POS_MODE_U</name>
              <description>Configures the behavior when the signal input of channel 1 detects a positive edge. \\
1: Increment the counter\\
2: Decrement the counter\\
0, 3: No effect \\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_HCTRL_MODE_U</name>
              <description>Configures how the CH%s_POS_MODE/CH%s_NEG_MODE settings will be modified when the control signal is high. \\
0: No modification\\
1: Invert behavior (increase -&gt; decrease, decrease -&gt; increase)\\
2, 3: Inhibit counter modification \\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_LCTRL_MODE_U</name>
              <description>Configures how the CH%s_POS_MODE/CH%s_NEG_MODE settings will be modified when the control signal is low. \\
0: No modification\\
1: Invert behavior (increase -&gt; decrease, decrease -&gt; increase)\\
2, 3: Inhibit counter modification \\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>U%s_CONF1</name>
          <description>Configuration register 1 for unit %s</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_THRES0_U</name>
              <description>Configures the thres0 value for unit %s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THRES1_U</name>
              <description>Configures the thres1 value for unit %s.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>U%s_CONF2</name>
          <description>Configuration register 2 for unit %s</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_H_LIM_U</name>
              <description>Configures the thr_h_lim value for unit %s. When pulse_cnt reaches this value, the counter will be cleared to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_LIM_U</name>
              <description>Configures the thr_l_lim value for unit %s. When pulse_cnt reaches this value, the counter will be cleared to 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U0_CONF3</name>
          <description>Configuration register for unit $n's step value.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_H_STEP_U0</name>
              <description>Configures the forward rotation step value for unit 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_STEP_U0</name>
              <description>Configures the reverse rotation step value for unit 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U1_CONF3</name>
          <description>Configuration register for unit $n's step value.</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_H_STEP_U1</name>
              <description>Configures the forward rotation step value for unit 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_STEP_U1</name>
              <description>Configures the reverse rotation step value for unit 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U2_CONF3</name>
          <description>Configuration register for unit $n's step value.</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_H_STEP_U2</name>
              <description>Configures the forward rotation step value for unit 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_STEP_U2</name>
              <description>Configures the reverse rotation step value for unit 2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U3_CONF3</name>
          <description>Configuration register for unit $n's step value.</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_H_STEP_U3</name>
              <description>Configures the forward rotation step value for unit 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_STEP_U3</name>
              <description>Configures the reverse rotation step value for unit 3.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>U%s_CNT</name>
          <description>Counter value for unit %s</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PULSE_CNT_U</name>
              <description>Represents the current pulse count value for unit %s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Interrupt raw status register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_THR_EVENT_U0_INT_RAW</name>
              <description>The raw interrupt status bit for the PCNT_CNT_THR_EVENT_U0_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THR_EVENT_U1_INT_RAW</name>
              <description>The raw interrupt status bit for the PCNT_CNT_THR_EVENT_U1_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THR_EVENT_U2_INT_RAW</name>
              <description>The raw interrupt status bit for the PCNT_CNT_THR_EVENT_U2_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THR_EVENT_U3_INT_RAW</name>
              <description>The raw interrupt status bit for the PCNT_CNT_THR_EVENT_U3_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Interrupt status register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_THR_EVENT_U0_INT_ST</name>
              <description>The masked interrupt status bit for the PCNT_CNT_THR_EVENT_U0_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_THR_EVENT_U1_INT_ST</name>
              <description>The masked interrupt status bit for the PCNT_CNT_THR_EVENT_U1_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_THR_EVENT_U2_INT_ST</name>
              <description>The masked interrupt status bit for the PCNT_CNT_THR_EVENT_U2_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_THR_EVENT_U3_INT_ST</name>
              <description>The masked interrupt status bit for the PCNT_CNT_THR_EVENT_U3_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_THR_EVENT_U0_INT_ENA</name>
              <description>The interrupt enable bit for the PCNT_CNT_THR_EVENT_U0_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THR_EVENT_U1_INT_ENA</name>
              <description>The interrupt enable bit for the PCNT_CNT_THR_EVENT_U1_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THR_EVENT_U2_INT_ENA</name>
              <description>The interrupt enable bit for the PCNT_CNT_THR_EVENT_U2_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THR_EVENT_U3_INT_ENA</name>
              <description>The interrupt enable bit for the PCNT_CNT_THR_EVENT_U3_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_THR_EVENT_U0_INT_CLR</name>
              <description>Set this bit to clear the PCNT_CNT_THR_EVENT_U0_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CNT_THR_EVENT_U1_INT_CLR</name>
              <description>Set this bit to clear the PCNT_CNT_THR_EVENT_U1_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CNT_THR_EVENT_U2_INT_CLR</name>
              <description>Set this bit to clear the PCNT_CNT_THR_EVENT_U2_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CNT_THR_EVENT_U3_INT_CLR</name>
              <description>Set this bit to clear the PCNT_CNT_THR_EVENT_U3_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>U%s_STATUS</name>
          <description>PNCT UNIT%s status register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNT_THR_ZERO_MODE_U</name>
              <description>Represents the pulse counter status of PCNT_U%s corresponding to 0. \\
0: pulse counter decreases from positive to 0\\
1: pulse counter increases from negative to 0\\
2: pulse counter is negative\\
3: pulse counter is positive \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_THR_THRES1_LAT_U</name>
              <description>Represents the latched value of thres1 event of PCNT_U%s when threshold event interrupt is valid. \\
0: others\\
1: the current pulse counter equals to thres1 and thres1 event is valid \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_THR_THRES0_LAT_U</name>
              <description>Represents the latched value of thres0 event of PCNT_U%s when threshold event interrupt is valid. \\
0: others\\
1: the current pulse counter equals to thres0 and thres0 event is valid \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_THR_L_LIM_LAT_U</name>
              <description>Represents the latched value of low limit event of PCNT_U%s when threshold event interrupt is valid. \\
0: others\\
1: the current pulse counter equals to thr_l_lim and low limit event is valid. \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_THR_H_LIM_LAT_U</name>
              <description>Represents the latched value of high limit event of PCNT_U%s when threshold event interrupt is valid. \\
0: others\\
1: the current pulse counter equals to thr_h_lim and high limit event is valid. \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_THR_ZERO_LAT_U</name>
              <description>Represents the latched value of zero threshold event of PCNT_U%s when threshold event interrupt is valid. \\
0: others\\
1: the current pulse counter equals to 0 and zero threshold event is valid. \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_THR_H_STEP_LAT_U</name>
              <description>Represents the latched value of step counter event of PCNT_U%s when step counter event interrupt is valid. 1: the current pulse counter decrement equals to reg_cnt_step and step counter event is valid. 0: others</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_THR_L_STEP_LAT_U</name>
              <description>Represents the latched value of step counter event of PCNT_U%s when step counter event interrupt is valid. 1: the current pulse counter increment equals to reg_cnt_step and step counter event is valid. 0: others</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
