esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>HP_ACTIVE_HP_REGULATOR0</name>
          <description>need_des</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0xc667f180</resetValue>
          <fields>
            <field>
              <name>DIG_DBIAS_INIT</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_DBIAS_VOL</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_DBIAS_VOL</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIG_REGULATOR0_DBIAS_SEL</name>
              <description>need_des</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE_HP_REGULATOR_SLP_CONNECT_EN</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE_HP_REGULATOR_SLP_MEM_XPD</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE_HP_REGULATOR_SLP_LOGIC_XPD</name>
              <description>need_des</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE_HP_REGULATOR_XPD</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE_HP_REGULATOR_SLP_MEM_DBIAS</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE_HP_REGULATOR_SLP_LOGIC_DBIAS</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE_HP_REGULATOR_DBIAS</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_ACTIVE_HP_REGULATOR1</name>
          <description>need_des</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_ACTIVE_HP_REGULATOR_DRV_B</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_ACTIVE_XTAL</name>
          <description>need_des</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>HP_ACTIVE_XPD_XTAL</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_DIG_POWER</name>
          <description>need_des</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_MODEM_VDD_SPI_PD_EN</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_PD_HP_ALIVE_PD_EN</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_HP_MEM_DSLP</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_PD_HP_MEM_PD_EN</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_PD_MODEM_TOP_PD_EN</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_PD_HP_CNNT_PD_EN</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_PD_HP_CPU_PD_EN</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_PD_MODEM_PWR_PD_EN</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_PD_TOP_PD_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_ICG_HP_FUNC</name>
          <description>need_des</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_MODEM_DIG_ICG_FUNC_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_ICG_HP_APB</name>
          <description>need_des</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_MODEM_DIG_ICG_APB_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_ICG_HP_FUNC1</name>
          <description>need_des</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_MODEM_DIG_ICG_FUNC1_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_ICG_HP_APB1</name>
          <description>need_des</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_MODEM_DIG_ICG_APB1_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_ICG_MODEM</name>
          <description>need_des</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_MODEM_DIG_ICG_MODEM_CODE</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_HP_SYS_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_MODEM_C_CHANNEL</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_UART_WAKEUP_EN</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_LP_PAD_HOLD_ALL</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_HP_PAD_HOLD_ALL</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_DIG_PAD_SLP_SEL</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_DIG_PAUSE_WDT</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_DIG_CPU_STALL</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_HP_CK_POWER</name>
          <description>need_des</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_MODEM_XPD_XTALX2</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_I2C_ISO_EN</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_I2C_RETENTION</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_XPD_BB_I2C</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_XPD_PLL_I2C</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_XPD_PLL</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_BIAS</name>
          <description>need_des</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_MODEM_XPD_BIAS</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_DBG_ATTEN</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_PD_CUR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEP</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_BACKUP</name>
          <description>need_des</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SLEEP2MODEM_BACKUP_MODEM_CLK_CODE</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_RETENTION_MODE</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP2MODEM_RETENTION_EN</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP2MODEM_BACKUP_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP2MODEM_BACKUP_MODE</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP2MODEM_BACKUP_EN</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_BACKUP_CLK</name>
          <description>need_des</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_MODEM_BACKUP_ICG_FUNC_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_BACKUP1_CLK</name>
          <description>need_des</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_MODEM_BACKUP_ICG_FUNC1_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_SYSCLK</name>
          <description>need_des</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_MODEM_DIG_SYS_CLK_NO_DIV</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_ICG_SYS_CLOCK_EN</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_SYS_CLK_SLP_SEL</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_ICG_SLP_SEL</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_DIG_SYS_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_HP_REGULATOR0</name>
          <description>need_des</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0xc6678000</resetValue>
          <fields>
            <field>
              <name>HP_MODEM_HP_REGULATOR_SLP_CONNECT_EN</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_HP_REGULATOR_SLP_MEM_XPD</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_HP_REGULATOR_SLP_LOGIC_XPD</name>
              <description>need_des</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_HP_REGULATOR_XPD</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_HP_REGULATOR_SLP_MEM_DBIAS</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_HP_REGULATOR_SLP_LOGIC_DBIAS</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM_HP_REGULATOR_DBIAS</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_HP_REGULATOR1</name>
          <description>need_des</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_MODEM_HP_REGULATOR_DRV_B</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MODEM_XTAL</name>
          <description>need_des</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>HP_MODEM_XPD_XTAL</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
