esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>HP_SLEEP_DIG_POWER</name>
          <description>need_des</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SLEEP_VDD_SPI_PD_EN</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_PD_HP_ALIVE_PD_EN</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_MEM_DSLP</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_PD_HP_MEM_PD_EN</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_PD_MODEM_TOP_PD_EN</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_PD_HP_CNNT_PD_EN</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_PD_HP_CPU_PD_EN</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_PD_MODEM_PWR_PD_EN</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_PD_TOP_PD_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_ICG_HP_FUNC</name>
          <description>need_des</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_DIG_ICG_FUNC_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_ICG_HP_APB</name>
          <description>need_des</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_DIG_ICG_APB_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_ICG_HP_FUNC1</name>
          <description>need_des</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_DIG_ICG_FUNC1_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_ICG_HP_APB1</name>
          <description>need_des</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_DIG_ICG_APB1_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_ICG_MODEM</name>
          <description>need_des</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SLEEP_DIG_ICG_MODEM_CODE</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_HP_SYS_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SLEEP_C_CHANNEL</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_UART_WAKEUP_EN</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_LP_PAD_HOLD_ALL</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_PAD_HOLD_ALL</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_DIG_PAD_SLP_SEL</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_DIG_PAUSE_WDT</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_DIG_CPU_STALL</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_HP_CK_POWER</name>
          <description>need_des</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SLEEP_XPD_XTALX2</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_I2C_ISO_EN</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_I2C_RETENTION</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_XPD_BB_I2C</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_XPD_PLL_I2C</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_XPD_PLL</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_BIAS</name>
          <description>need_des</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SLEEP_XPD_BIAS</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_DBG_ATTEN</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_PD_CUR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEP</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_BACKUP</name>
          <description>need_des</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_MODEM2SLEEP_BACKUP_MODEM_CLK_CODE</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE2SLEEP_BACKUP_MODEM_CLK_CODE</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_RETENTION_MODE</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM2SLEEP_RETENTION_EN</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE2SLEEP_RETENTION_EN</name>
              <description>need_des</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM2SLEEP_BACKUP_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE2SLEEP_BACKUP_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM2SLEEP_BACKUP_MODE</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE2SLEEP_BACKUP_MODE</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM2SLEEP_BACKUP_EN</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE2SLEEP_BACKUP_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_BACKUP_CLK</name>
          <description>need_des</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SLEEP_BACKUP_ICG_FUNC_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_BACKUP1_CLK</name>
          <description>need_des</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SLEEP_BACKUP_ICG_FUNC1_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_SYSCLK</name>
          <description>need_des</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SLEEP_DIG_SYS_CLK_NO_DIV</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_ICG_SYS_CLOCK_EN</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_SYS_CLK_SLP_SEL</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_ICG_SLP_SEL</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_DIG_SYS_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_HP_REGULATOR0</name>
          <description>need_des</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0xc6678000</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_SLP_CONNECT_EN</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_SLP_MEM_XPD</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_SLP_LOGIC_XPD</name>
              <description>need_des</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_XPD</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_SLP_MEM_DBIAS</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_SLP_LOGIC_DBIAS</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_DBIAS</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_HP_REGULATOR1</name>
          <description>need_des</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_DRV_B</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_XTAL</name>
          <description>need_des</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_XPD_XTAL</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_LP_REGULATOR0</name>
          <description>need_des</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0xc6600000</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_LP_REGULATOR_SLP_XPD</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_LP_REGULATOR_XPD</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_LP_REGULATOR_SLP_DBIAS</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_LP_REGULATOR_DBIAS</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_LP_REGULATOR1</name>
          <description>need_des</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SLEEP_LP_REGULATOR_DRV_B</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_LP_DCDC_RESERVE</name>
          <description>need_des</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PMU_HP_SLEEP_LP_DCDC_RESERVE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_LP_DIG_POWER</name>
          <description>need_des</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_SLEEP_LP_MEM_DSLP</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_PD_LP_PERI_PD_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_LP_CK_POWER</name>
          <description>need_des</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_XPD_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_XPD_RC32K</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_XPD_FOSC_CLK</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_PD_OSC_CLK</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
