esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>LP_SLEEP_LP_BIAS_RESERVE</name>
          <description>need_des</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PMU_LP_SLEEP_LP_BIAS_RESERVE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_LP_REGULATOR0</name>
          <description>need_des</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0xc6600000</resetValue>
          <fields>
            <field>
              <name>LP_SLEEP_LP_REGULATOR_SLP_XPD</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_LP_REGULATOR_XPD</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_LP_REGULATOR_SLP_DBIAS</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_LP_REGULATOR_DBIAS</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_LP_REGULATOR1</name>
          <description>need_des</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_SLEEP_LP_REGULATOR_DRV_B</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_XTAL</name>
          <description>need_des</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>LP_SLEEP_XPD_XTAL</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_LP_DIG_POWER</name>
          <description>need_des</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_SLEEP_LP_MEM_DSLP</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_PD_LP_PERI_PD_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_LP_CK_POWER</name>
          <description>need_des</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>LP_SLEEP_XPD_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_XPD_RC32K</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_XPD_FOSC_CLK</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_PD_OSC_CLK</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_BIAS</name>
          <description>need_des</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_SLEEP_XPD_BIAS</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_DBG_ATTEN</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_PD_CUR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEP</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMM_HP_CK_POWER_0</name>
          <description>need_des</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIE_LOW_GLOBAL_XTALX2_ICG</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_LOW_GLOBAL_XTAL_ICG</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_LOW_I2C_RETENTION</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_LOW_XPD_BB_I2C</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_LOW_XPD_XTALX2</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_LOW_XPD_XTAL</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_HIGH_GLOBAL_XTALX2_ICG</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_HIGH_GLOBAL_XTAL_ICG</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_HIGH_I2C_RETENTION</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_HIGH_XPD_BB_I2C</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_HIGH_XPD_XTALX2</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_HIGH_XPD_XTAL</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMM_HP_CK_POWER_1</name>
          <description>need_des</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIE_LOW_XPD_PLL_I2C</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_LOW_XPD_PLL</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_LOW_GLOBAL_PLL_ICG</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_HIGH_GLOBAL_PLL_ICG</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_HIGH_XPD_PLL_I2C</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_HIGH_XPD_PLL</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMM_SLEEP_SYSCLK</name>
          <description>need_des</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UPDATE_DIG_ICG_SWITCH</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_LOW_ICG_SLP_SEL</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_HIGH_ICG_SLP_SEL</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UPDATE_DIG_SYS_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMM_HP_FUNC_ICG</name>
          <description>need_des</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UPDATE_DIG_ICG_FUNC_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMM_HP_APB_ICG</name>
          <description>need_des</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UPDATE_DIG_ICG_APB_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMM_MODEM_ICG</name>
          <description>need_des</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UPDATE_DIG_ICG_MODEM_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMM_LP_ICG</name>
          <description>need_des</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIE_LOW_LP_ROOTCLK_SEL</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_HIGH_LP_ROOTCLK_SEL</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMM_PAD_HOLD_ALL</name>
          <description>need_des</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIE_HIGH_LP_PAD_HOLD_ALL</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_LOW_LP_PAD_HOLD_ALL</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_HIGH_HP_PAD_HOLD_ALL</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_LOW_HP_PAD_HOLD_ALL</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMM_I2C_ISO</name>
          <description>need_des</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIE_HIGH_I2C_ISO_EN</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIE_LOW_I2C_ISO_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_WAIT_TIMER0</name>
          <description>need_des</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0x7fbfdfe0</resetValue>
          <fields>
            <field>
              <name>DG_HP_POWERDOWN_TIMER</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DG_HP_POWERUP_TIMER</name>
              <description>need_des</description>
              <bitOffset>14</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DG_HP_PD_WAIT_TIMER</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_WAIT_TIMER1</name>
          <description>need_des</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0x7fbf7e00</resetValue>
          <fields>
            <field>
              <name>DG_LP_POWERDOWN_TIMER</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DG_LP_POWERUP_TIMER</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DG_LP_PD_WAIT_TIMER</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_WAIT_TIMER2</name>
          <description>need_des</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>DG_LP_ISO_WAIT_TIMER</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DG_LP_RST_WAIT_TIMER</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DG_HP_ISO_WAIT_TIMER</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DG_HP_RST_WAIT_TIMER</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_PD_TOP_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0x1c</resetValue>
          <fields>
            <field>
              <name>FORCE_TOP_RESET</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_TOP_ISO</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_TOP_PU</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_TOP_NO_RESET</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_TOP_NO_ISO</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_TOP_PD</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_TOP_MASK</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_TOP_PD_MASK</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
