esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>POWER_PD_HP_ALIVE_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0x1c</resetValue>
          <fields>
            <field>
              <name>FORCE_HP_ALIVE_RESET</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_ALIVE_ISO</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_ALIVE_PU</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_ALIVE_NO_RESET</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_ALIVE_NO_ISO</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_ALIVE_PD</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_ALIVE_MASK</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_ALIVE_PD_MASK</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_PD_MODEM_PWR_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0x1c</resetValue>
          <fields>
            <field>
              <name>FORCE_MODEM_PWR_RESET</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MODEM_PWR_ISO</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MODEM_PWR_PU</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MODEM_PWR_NO_RESET</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MODEM_PWR_NO_ISO</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MODEM_PWR_PD</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_MODEM_PWR_MASK</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_MODEM_PWR_PD_MASK</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_PD_HPCPU_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0x1c</resetValue>
          <fields>
            <field>
              <name>FORCE_HP_CPU_RESET</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_CPU_ISO</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_CPU_PU</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_CPU_NO_RESET</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_CPU_NO_ISO</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_CPU_PD</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_CPU_MASK</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_CPU_PD_MASK</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_PD_HPCNNT_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0x1c</resetValue>
          <fields>
            <field>
              <name>FORCE_HP_CNNT_RESET</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_CNNT_ISO</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_CNNT_PU</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_CNNT_NO_RESET</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_CNNT_NO_ISO</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_CNNT_PD</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_CNNT_MASK</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_CNNT_PD_MASK</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_PD_MODEM_TOP_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0x1c</resetValue>
          <fields>
            <field>
              <name>FORCE_MODEM_TOP_RESET</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MODEM_TOP_ISO</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MODEM_TOP_PU</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MODEM_TOP_NO_RESET</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MODEM_TOP_NO_ISO</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MODEM_TOP_PD</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_MODEM_TOP_MASK</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_MODEM_TOP_PD_MASK</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_PD_LPPERI_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0x1c</resetValue>
          <fields>
            <field>
              <name>FORCE_LP_PERI_RESET</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_LP_PERI_ISO</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_LP_PERI_PU</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_LP_PERI_NO_RESET</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_LP_PERI_NO_ISO</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_LP_PERI_PD</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_PD_MEM_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0xff000000</resetValue>
          <fields>
            <field>
              <name>FORCE_HP_MEM_ISO</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_MEM_PD</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_MEM_NO_ISO</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_MEM_PU</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_PD_MEM_MASK</name>
          <description>need_des</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PD_HP_MEM2_PD_MASK</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_MEM1_PD_MASK</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_MEM0_PD_MASK</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_MEM2_MASK</name>
              <description>need_des</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_MEM1_MASK</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_MEM0_MASK</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_HP_PAD</name>
          <description>need_des</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FORCE_HP_PAD_NO_ISO_ALL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_HP_PAD_ISO_ALL</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_VDD_SPI_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <resetValue>0x63fc0000</resetValue>
          <fields>
            <field>
              <name>VDD_SPI_PWR_WAIT</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDD_SPI_PWR_SW</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDD_SPI_PWR_SEL_SW</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_CK_WAIT_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <resetValue>0x1000100</resetValue>
          <fields>
            <field>
              <name>PMU_WAIT_XTL_STABLE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_WAIT_PLL_STABLE</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLP_WAKEUP_CNTL0</name>
          <description>need_des</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SLP_REJECT_EN</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEP_REQ</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLP_WAKEUP_CNTL1</name>
          <description>need_des</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SLEEP_REJECT_ENA</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLP_WAKEUP_CNTL2</name>
          <description>need_des</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WAKEUP_ENA</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLP_WAKEUP_CNTL3</name>
          <description>need_des</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_MIN_SLP_VAL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MIN_SLP_VAL</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEP_PRT_SEL</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLP_WAKEUP_CNTL4</name>
          <description>need_des</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SLP_REJECT_CAUSE_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLP_WAKEUP_CNTL5</name>
          <description>need_des</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <resetValue>0x1000080</resetValue>
          <fields>
            <field>
              <name>MODEM_WAIT_TARGET</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_WAIT_TARGET</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLP_WAKEUP_CNTL6</name>
          <description>need_des</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>SOC_WAKEUP_WAIT</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOC_WAKEUP_WAIT_CFG</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
