esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>LP_INT_CLR</name>
          <description>need_des</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_CPU_WAKEUP_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_SWITCH_ACTIVE_END_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SLEEP_SWITCH_ACTIVE_END_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SLEEP_SWITCH_MODEM_END_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_SWITCH_SLEEP_END_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACTIVE_SWITCH_SLEEP_END_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_SWITCH_ACTIVE_START_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SLEEP_SWITCH_ACTIVE_START_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SLEEP_SWITCH_MODEM_START_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_SWITCH_SLEEP_START_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACTIVE_SWITCH_SLEEP_START_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_SW_TRIGGER_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CPU_PWR0</name>
          <description>need_des</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <resetValue>0x1ff00000</resetValue>
          <fields>
            <field>
              <name>LP_CPU_WAITI_RDY</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_CPU_STALL_RDY</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_CPU_FORCE_STALL</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CPU_SLP_WAITI_FLAG_EN</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CPU_SLP_STALL_FLAG_EN</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CPU_SLP_STALL_WAIT</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CPU_SLP_STALL_EN</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CPU_SLP_RESET_EN</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CPU_SLP_BYPASS_INTR_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CPU_PWR1</name>
          <description>need_des</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_CPU_SLEEP_REQ</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CPU_PWR2</name>
          <description>need_des</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_CPU_WAKEUP_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_LP_CPU_COMM</name>
          <description>need_des</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_TRIGGER_HP</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_TRIGGER_LP</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_REGULATOR_CFG</name>
          <description>need_des</description>
          <addressOffset>0x1bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIG_REGULATOR_EN_CAL</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAIN_STATE</name>
          <description>need_des</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <resetValue>0x8100800</resetValue>
          <fields>
            <field>
              <name>PMU_MAIN_LAST_ST_STATE</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_MAIN_TAR_ST_STATE</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_MAIN_CUR_ST_STATE</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_STATE</name>
          <description>need_des</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <resetValue>0x802000</resetValue>
          <fields>
            <field>
              <name>PMU_BACKUP_ST_STATE</name>
              <description>need_des</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_LP_PWR_ST_STATE</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_HP_PWR_ST_STATE</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_STATE0</name>
          <description>need_des</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>STABLE_XPD_XTAL_STATE</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_SYS_CLK_SLP_SEL_STATE</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_SYS_CLK_SEL_STATE</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_SYS_CLK_NO_DIV_STATE</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ICG_SYS_CLK_EN_STATE</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ICG_MODEM_SWITCH_STATE</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ICG_MODEM_CODE_STATE</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ICG_SLP_SEL_STATE</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ICG_GLOBAL_XTAL_STATE</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ANA_I2C_ISO_EN_STATE</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ANA_I2C_RETENTION_STATE</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ANA_XPD_BB_I2C_STATE</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ANA_XPD_XTAL_STATE</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_STATE1</name>
          <description>need_des</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>PMU_ICG_FUNC_EN_STATE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_STATE2</name>
          <description>need_des</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>PMU_ICG_APB_EN_STATE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_STATE3</name>
          <description>need_des</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <resetValue>0xffff0000</resetValue>
          <fields>
            <field>
              <name>STABLE_XPD_PLL_STATE</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ICG_GLOBAL_PLL_STATE</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ANA_XPD_PLL_I2C_STATE</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ANA_XPD_PLL_STATE</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDD_SPI_STATUS</name>
          <description>need_des</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_POWER_READY</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_POWER_SEL_DONE</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STABLE_VDD_SPI_PWR_DRV</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDD_SPI_CFG</name>
          <description>need_des</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <resetValue>0x28804b0</resetValue>
          <fields>
            <field>
              <name>FLASH_SW_POWER_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_POWER_SEL_SW_CTRL</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_SWITCH_TIME</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_STABLE_TIME</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_COOLDOWN_TIME</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDD_SPI_DISCHARGE_CFG</name>
          <description>need_des</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>FLASH_DISCHARGE_TIME</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDD_SDIO_CFG</name>
          <description>need_des</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <resetValue>0x28</resetValue>
          <fields>
            <field>
              <name>SDIO_SW_POWER_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_POWER_SEL_SW_CTRL</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_SWITCH_TIME</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_CFG</name>
          <description>need_des</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PSRAM_XPD</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_STALL_SW</name>
          <description>need_des</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HPCORE1_SW_STALL_CODE</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPCORE0_SW_STALL_CODE</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_WAKEUP_LV</name>
          <description>need_des</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXT_WAKEUP_LV</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_WAKEUP_SEL</name>
          <description>need_des</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXT_WAKEUP_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_WAKEUP_ST</name>
          <description>need_des</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXT_WAKEUP_STATUS</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_WAKEUP_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXT_WAKEUP_STATUS_CLR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_WAKEUP_FILTER</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
