esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SDIO_WAKEUP_CNTL</name>
          <description>control the wait timer register for sdio wakeup control</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>0x3ff</resetValue>
          <fields>
            <field>
              <name>SDIO_ACT_DNUM</name>
              <description>delay number config for sdio wakeup control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOUCH_PWR_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_SLEEP_CYCLES</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_WAIT_CYCLES</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_SLEEP_TIMER_EN</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_FORCE_DONE</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANA_PERI_PWR_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>XPD_PERIF_I2C</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTB_PERIF_I2C</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO</name>
          <description>used for future potential eco, others don't care</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PMU_RDN_ECO_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUF_MEM_CTRL</name>
          <description>used for future potential eco, others don't care</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>PUF_MEM_PSW</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUF_MEM_ISO</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUF_MEM_DISCHARGE</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLP_WAKEUP_CNTL8</name>
          <description>need_des</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PD_TOP_PU_DELT_TIMER</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_CPU_PU_DELT_TIMER</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_MODEM_TOP_PU_DELT_TIMER</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_MODEM_PWR_PU_DELT_TIMER</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_CNNT_PU_DELT_TIMER</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_HP_ALIVE_PU_DELT_TIMER</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_LDO_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXT_LDO_TIE_HIGH</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_LDO_EN_VDET</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_CUR_LIM</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_LDO_MUL</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_LDO_DREF</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_RO</name>
          <description>used for future potential eco, others don't care</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_PWR_STATE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IO_0P2A_OVDET</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPCPU_WAKEUP_CAUSE</name>
          <description>need_des</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPCPU_WAKEUP_CAUSE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_WAIT_TARGET</name>
          <description>need_des</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0xf</resetValue>
          <fields>
            <field>
              <name>BACKUP_WAIT_TARGET</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>need_des</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x250902</resetValue>
          <fields>
            <field>
              <name>PMU_DATE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
