esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PPA</name>
      <description>PPA Peripheral</description>
      <groupName>PPA</groupName>
      <baseAddress>0x20345000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x94</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PPA</name>
        <value>102</value>
      </interrupt>
      <registers>
        <register>
          <name>BLEND0_CLUT_DATA</name>
          <description>CLUT sram data read/write register in background plane of blender</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWR_WORD_BLEND0_CLUT</name>
              <description>Write and read data to/from CLUT RAM in background plane of blender engine through this field in fifo mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLEND1_CLUT_DATA</name>
          <description>CLUT sram data read/write register in foreground plane of blender</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWR_WORD_BLEND1_CLUT</name>
              <description>Write and read data to/from CLUT RAM in foreground plane of blender engine through this field in fifo mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLUT_CONF</name>
          <description>CLUT configure register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB_FIFO_MASK</name>
              <description>1'b0: fifo mode to wr/rd clut0/clut1 RAM through register PPA_SRM_CLUT_DATA_REG/PPA_BLEND0_CLUT_DATA_REG/PPA_BLEND1_CLUT_DATA_REG. 1'b1: memory mode to wr/rd sr/blend0/blend1 clut RAM. The bit 11 and 10 of the waddr should be 01 to access sr clut and should be 10 to access blend0 clut and should be 11 to access blend 1 clut in memory mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND0_CLUT_MEM_RST</name>
              <description>Write 1 then write 0 to this bit to reset BLEND0 CLUT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND1_CLUT_MEM_RST</name>
              <description>Write 1 then write 0 to this bit to reset BLEND1 CLUT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND0_CLUT_MEM_RDADDR_RST</name>
              <description>Write 1 then write 0 to reset the read address of BLEND0 CLUT in fifo mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND1_CLUT_MEM_RDADDR_RST</name>
              <description>Write 1 then write 0 to reset the read address of BLEND1 CLUT in fifo mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_CLUT_MEM_FORCE_PD</name>
              <description>1: force power down BLEND CLUT memory.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_CLUT_MEM_FORCE_PU</name>
              <description>1: force power up BLEND CLUT memory.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_CLUT_MEM_CLK_ENA</name>
              <description>1: Force clock on for BLEND CLUT memory.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Raw status interrupt</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRM_EOF_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when scaling and rotating engine calculate one frame image.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_EOF_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when blending engine calculate one frame image.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRM_PARAM_CFG_ERR_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the configured scaling and rotating coefficient is wrong. User can check the reasons through register PPA_SRM_PARAM_ERR_ST_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_PARAM_CFG_ERR_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the configured blending coefficient is wrong. User can check the reasons through register PPA_BLEND_ST_REG.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Masked interrupt</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRM_EOF_INT_ST</name>
              <description>The raw interrupt status bit for the PPA_SRM_EOF_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLEND_EOF_INT_ST</name>
              <description>The raw interrupt status bit for the PPA_BLEND_EOF_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRM_PARAM_CFG_ERR_INT_ST</name>
              <description>The raw interrupt status bit for the PPA_SRM_PARAM_CFG_ERR_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLEND_PARAM_CFG_ERR_INT_ST</name>
              <description>The raw interrupt status bit for the PPA_BLEND_PARAM_CFG_ERR_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRM_EOF_INT_ENA</name>
              <description>The interrupt enable bit for the PPA_SRM_EOF_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_EOF_INT_ENA</name>
              <description>The interrupt enable bit for the PPA_BLEND_EOF_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRM_PARAM_CFG_ERR_INT_ENA</name>
              <description>The interrupt enable bit for the PPA_SRM_PARAM_CFG_ERR_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_PARAM_CFG_ERR_INT_ENA</name>
              <description>The interrupt enable bit for the PPA_BLEND_PARAM_CFG_ERR_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRM_EOF_INT_CLR</name>
              <description>Set this bit to clear the PPA_SRM_EOF_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BLEND_EOF_INT_CLR</name>
              <description>Set this bit to clear the PPA_BLEND_EOF_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SRM_PARAM_CFG_ERR_INT_CLR</name>
              <description>Set this bit to clear the PPA_SRM_RX_YSCAL_ERR_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BLEND_PARAM_CFG_ERR_INT_CLR</name>
              <description>Set this bit to clear the PPA_BLEND_PARAM_CFG_ERR_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRM_COLOR_MODE</name>
          <description>Scaling and rotating engine color mode register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRM_RX_CM</name>
              <description>The source image color mode for Scaling and Rotating engine Rx. 0: ARGB8888. 1: RGB888. 2: RGB565. 8: YUV420. 9: YUV422. others: Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRM_TX_CM</name>
              <description>The destination image color mode for Scaling and Rotating engine Tx. 0: ARGB8888. 1: RGB888. 2: RGB565. 8: YUV420. 9: YUV422. others: Reserved.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV_RX_RANGE</name>
              <description>YUV input range when reg_sr_rx_cm is 4'd8. 0: limit range. 1: full range</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV_TX_RANGE</name>
              <description>YUV output range when reg_sr_tx_cm is 4'd8. 0: limit range. 1: full range</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV2RGB_PROTOCAL</name>
              <description>YUV to RGB protocal when reg_sr_rx_cm is 4'd8. 0: BT601. 1: BT709</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RGB2YUV_PROTOCAL</name>
              <description>RGB to YUV protocal when reg_sr_tx_cm is 4'd8. 0: BT601. 1: BT709</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV422_RX_BYTE_ORDER</name>
              <description>YUV422 input byte order when reg_sr_rx_cm is 4'd9. 0: YVYU, 1:YUYV, 2: VYUY, 3: UYVY</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLEND_COLOR_MODE</name>
          <description>blending engine color mode register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLEND0_RX_CM</name>
              <description>The source image color mode for background plane. 0: ARGB8888. 1: RGB888. 2: RGB565. 3: Reserved. 4: L8. 5: L4. 8: YUV420. 9: YUV422</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND1_RX_CM</name>
              <description>The source image color mode for foreground plane. 0: ARGB8888. 1: RGB888. 2: RGB565. 3: Reserved. 4: L8. 5: L4. 6: A8. 7: A4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_TX_CM</name>
              <description>The destination image color mode for output of blender. 0: ARGB8888. 1: RGB888. 2: RGB565. 3: Reserved. 8: YUV420. 9: YUV422.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND0_RX_YUV_RANGE</name>
              <description>YUV input range when blend0 rx cm is yuv. 0: limit range. 1: full range</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_TX_YUV_RANGE</name>
              <description>YUV output range when blend tx cm is yuv. 0: limit range. 1: full range</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND0_RX_YUV2RGB_PROTOCAL</name>
              <description>YUV to RGB protocal when blend0 rx cm is yuv. 0: BT601. 1: BT709</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_TX_RGB2YUV_PROTOCAL</name>
              <description>RGB to YUV protocal when blend tx cm is yuv. 0: BT601. 1: BT709</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND0_RX_YUV422_BYTE_ORDER</name>
              <description>YUV422 input byte order when reg_sr_rx_cm is 4'd9. 0: YVYU, 1:YUYV, 2: VYUY, 3: UYVY</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRM_BYTE_ORDER</name>
          <description>Scaling and rotating engine byte order register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRM_RX_BYTE_SWAP_EN</name>
              <description>Set this bit to 1  the data into Rx channel 0 would be swapped in byte. The Byte0 and Byte1 would be swapped while byte 2 and byte 3 would be swappped.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRM_RX_RGB_SWAP_EN</name>
              <description>Set this bit to 1  the data into Rx channel 0 would be swapped in rgb. It means rgb would be swap to bgr.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRM_MACRO_BK_RO_BYPASS</name>
              <description>Set this bit to 1 to bypass the macro block order function. This function is used to improve efficient accessing external memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRM_BK_SIZE_SEL</name>
              <description>sel srm pix_blk size, 0:32x32, 1:16x16</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLEND_BYTE_ORDER</name>
          <description>Blending engine byte order register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLEND0_RX_BYTE_SWAP_EN</name>
              <description>Set this bit to 1  the data into Rx channel 0 would be swapped in byte. The Byte0 and Byte1 would be swapped while byte 2 and byte 3 would be swappped.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND1_RX_BYTE_SWAP_EN</name>
              <description>Set this bit to 1  the data into Rx channel 0 would be swapped in byte. The Byte0 and Byte1 would be swapped while byte 2 and byte 3 would be swappped.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND0_RX_RGB_SWAP_EN</name>
              <description>Set this bit to 1  the data into Rx channel 0 would be swapped in rgb. It means rgb would be swap to bgr.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND1_RX_RGB_SWAP_EN</name>
              <description>Set this bit to 1  the data into Rx channel 0 would be swapped in rgb. It means rgb would be swap to bgr.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLEND_TRANS_MODE</name>
          <description>Blending engine mode configure register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLEND_EN</name>
              <description>Set this bit to enable alpha blending.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_BYPASS</name>
              <description>Set this bit to bypass blender. Then background date would be output.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_FIX_PIXEL_FILL_EN</name>
              <description>This bit is used to enable fix pixel filling. When this mode is enable  only Tx channel is work and the output pixel is configured by PPA_OUT_FIX_PIXEL.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE</name>
              <description>Set this bit to update the transfer mode. Only the bit is set  the transfer mode is valid.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BLEND_RST</name>
              <description>write 1 then write 0 to reset blending engine.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND_TX_INF_SEL</name>
              <description>Configures blend tx interface. 0: dma2d only, 1: le_enc only, 2: dma2d and ls_enc</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRM_FIX_ALPHA</name>
          <description>Scaling and rotating engine alpha override register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>SRM_RX_FIX_ALPHA</name>
              <description>The value would replace the alpha value in received pixel for Scaling and Rotating engine when PPA_SRM_RX_ALPHA_CONF_EN is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRM_RX_ALPHA_MOD</name>
              <description>Alpha mode. 0/3: not replace alpha. 1: replace alpha with PPA_SRM_FIX_ALPHA. 2: Original alpha multiply with PPA_SRM_FIX_ALPHA/256.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRM_RX_ALPHA_INV</name>
              <description>Set this bit to invert the original alpha value. When RX color mode is RGB565/RGB88. The original alpha value is 255.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
