esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SRM_STATUS</name>
          <description>SR FSM register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRM_RX_DSCR_SAMPLE_STATE</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRM_RX_SCAN_STATE</name>
              <description>Reserved.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRM_TX_DSCR_SAMPLE_STATE</name>
              <description>Reserved.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRM_TX_SCAN_STATE</name>
              <description>Reserved.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_LOW</name>
          <description>Reserved.</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RND_ECO_LOW</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_HIGH</name>
          <description>Reserved.</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>RND_ECO_HIGH</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_CELL_CTRL</name>
          <description>Reserved.</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_RESULT</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDN_ENA</name>
              <description>Reserved.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM_CTRL</name>
          <description>PPA SRAM Control Register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x1320</resetValue>
          <fields>
            <field>
              <name>MEM_AUX_CTRL</name>
              <description>Control signals</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_CTRL0</name>
          <description>debug register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DBG_REPLACE_SEL</name>
              <description>Configures the data replace location. 0: not replace, 1: srm rx input, 2: srm rx bilin interpolation, 3: srm tx output, 4: blend fg input, 5: blend bg input, 6: blend output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_CTRL1</name>
          <description>debug register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DBG_REPLACE_DATA</name>
              <description>Configures the replace data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RGB2GRAY</name>
          <description>rgb2gray register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x555655</resetValue>
          <fields>
            <field>
              <name>B</name>
              <description>Configures the b parameter for rgb2gray</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>G</name>
              <description>Configures the g parameter for rgb2gray</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R</name>
              <description>Configures the r parameter for rgb2gray</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>PPA Version register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x20241220</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
