esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>PWR_GLITCH_CONF</name>
          <description>needs field desc</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0x1fe01</resetValue>
          <fields>
            <field>
              <name>GLITCH_EFUSE_CTRL</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLITCH_EN</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLITCH_CELL_SEL</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLITCH_LIMIT</name>
              <description>needs field desc</description>
              <bitOffset>9</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_ACTIVE_TIME</name>
          <description>needs field desc</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <resetValue>0xffff</resetValue>
          <fields>
            <field>
              <name>DBIAS_ACTIVE_TIME</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_IDLE_TIME</name>
          <description>needs field desc</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>DBIAS_IDLE_TIME</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>version register</description>
          <addressOffset>0xffc</addressOffset>
          <size>32</size>
          <resetValue>0x2112130</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>version register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RMA</name>
      <description>RMA Peripheral</description>
      <groupName>RMA</groupName>
      <baseAddress>0x2050f000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4c</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RMA</name>
        <value>60</value>
      </interrupt>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>Configures RMA algorithm</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WORK_MODE</name>
              <description>Configures the RMA module. \\
00: REQUEST CERTIFICATE\\
01: VERIFICATION CERTIFICATE\\
10: FAST VERIFICATION\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REUSE_JTAG</name>
              <description>Whether enable JTAG after RMA pass. \\
0: Do not enable JTAG \\
1: Enable JTAG \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REUSE_DOWNLOAD</name>
              <description>Whether enable DOWNLOAD_MODE after RMA pass. \\
0: Do not enable DOWNLOAD mode\\
1: Enable DOWNLOAD\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_SPI</name>
              <description>Whether enable FORCE_SPI_BOOT after RMA pass. \\
0: Do not enable FORCE_SPI_BOOT mode\\
1: Enable FORCE_SPI_BOOT\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USE_NONCE</name>
              <description>Whether use  NONCE. \\
0: Do not use  NONCE\\
1: Use  NONCE\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USE_KM</name>
              <description>Whether use km to gnerate NONCE. \\
0: Do not use KM to generate NONCE \\
1: Use KM to generate NONCE\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USC_BLOCK_NUM</name>
              <description>The length of USC.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGGER</name>
          <description>Starts the RMA module.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>START</name>
              <description>Start tigger typical rma. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOAD</name>
              <description>Rma load done. \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GAIN</name>
              <description>Rma gain done. \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USC</name>
              <description>Rma usc done. \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>query state in rma</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATE</name>
              <description>The status bits of RMA Accelerator. RMA is at 0: IDLE, 1: LOAD, 2: GAIN, 3: USC, 4: LOCK, others: BUSY state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG</name>
          <description>Query result in rma</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CERT_STATE</name>
              <description>Marks state of rma cert verification result.  \\
1: pass\\
0: failed\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PUBLIC_KEY_STATE</name>
              <description>Marks state of rma public key verification result.  \\
1: pass\\
0: failed\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SIGN_STATE</name>
              <description>Marks state of rma sign verification result.  \\
1: pass\\
0: failed\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NONCE_STATE</name>
              <description>Marks error nonce config .  \\
0 : Use efuse_hash_sg in CERT_REQ or FAST_VEF but key invalid\\
1 : Nonce config pass.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KM_STATE</name>
              <description>Marks error KM config .  \\
0 : Use km but km key invalid\\
1 : KM config pass\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE_STATE</name>
              <description>Marks error mode config .  \\
0 : Invalid mode config\\
1  : MODE config pass\\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSE_STATE</name>
              <description>Marks efuse state .  \\
0 : Efuse disable RMA module\\
1  : Efuse pass\\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>RMA interrupt raw register, valid in level.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROC_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the rma_proc_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>RMA interrupt status register.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROC_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the rma_proc_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>RMA interrupt enable register.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROC_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the rma_proc_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>RMA interrupt clear register.</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROC_DONE_INT_CLR</name>
              <description>Set this bit to clear the rma_proc_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT_ST</name>
          <description>RMA result reg.</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REUSE_JTAG_ST</name>
              <description>The state of reuse jtag register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REUSE_DOWNLOAD_ST</name>
              <description>The state of reuse download register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_SPI_BOOT_ST</name>
              <description>The state of force spi boot reg register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT_CLR</name>
          <description>RMA clr result reg.</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REUSE_JTAG_CLR</name>
              <description>Set this bit to clear the reuse jtag state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>REUSE_DOWNLOAD_CLR</name>
              <description>Set this bit to clear the reuse download state.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FORCE_SPI_BOOT_CLR</name>
              <description>Set this bit to clear the force spi boot state.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_LIMIT</name>
          <description>RMA timeout limit configurate register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>TIMEOUT_LIMIT</name>
              <description>The timeout limitation for waiting sub-IP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x20250819</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>CHIP_INFO_SOURCE_MEM[%s]</name>
          <description>RMA chip info memory.</description>
          <addressOffset>0x80</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>NONCE_MEM[%s]</name>
          <description>RMA nonce memory.</description>
          <addressOffset>0x84</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>USC_MEM[%s]</name>
          <description>RMA USC memory.</description>
          <addressOffset>0x88</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PUBLIC_KEY_MEM[%s]</name>
          <description>RMA public key memory .</description>
          <addressOffset>0x8c</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>SIGN_MEM[%s]</name>
          <description>RMA signature r memory .</description>
          <addressOffset>0x90</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>CERT_HASH_MEM[%s]</name>
          <description>RMA cert hash memory.</description>
          <addressOffset>0x94</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>CHIP_INFO_MEM[%s]</name>
          <description>RMA chip info memory .</description>
          <addressOffset>0x98</addressOffset>
          <size>8</size>
        </register>
