esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0_TX_END_INT_ENA</name>
              <description>The interrupt enable bit for CH0_TX_END_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_TX_END_INT_ENA</name>
              <description>The interrupt enable bit for CH1_TX_END_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_TX_END_INT_ENA</name>
              <description>The interrupt enable bit for CH2_TX_END_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_TX_END_INT_ENA</name>
              <description>The interrupt enable bit for CH3_TX_END_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_ERR_INT_ENA</name>
              <description>The interrupt enable bit for CH0_ERR_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_ERR_INT_ENA</name>
              <description>The interrupt enable bit for CH1_ERR_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ERR_INT_ENA</name>
              <description>The interrupt enable bit for CH2_ERR_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ERR_INT_ENA</name>
              <description>The interrupt enable bit for CH3_ERR_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_TX_THR_EVENT_INT_ENA</name>
              <description>The interrupt enable bit for CH0_TX_THR_EVENT_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_TX_THR_EVENT_INT_ENA</name>
              <description>The interrupt enable bit for CH1_TX_THR_EVENT_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_TX_THR_EVENT_INT_ENA</name>
              <description>The interrupt enable bit for CH2_TX_THR_EVENT_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_TX_THR_EVENT_INT_ENA</name>
              <description>The interrupt enable bit for CH3_TX_THR_EVENT_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_TX_LOOP_INT_ENA</name>
              <description>The interrupt enable bit for CH0_TX_LOOP_INT.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_TX_LOOP_INT_ENA</name>
              <description>The interrupt enable bit for CH1_TX_LOOP_INT.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_TX_LOOP_INT_ENA</name>
              <description>The interrupt enable bit for CH2_TX_LOOP_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_TX_LOOP_INT_ENA</name>
              <description>The interrupt enable bit for CH3_TX_LOOP_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_RX_END_INT_ENA</name>
              <description>The interrupt enable bit for CH4_RX_END_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5_RX_END_INT_ENA</name>
              <description>The interrupt enable bit for CH5_RX_END_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6_RX_END_INT_ENA</name>
              <description>The interrupt enable bit for CH6_RX_END_INT.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7_RX_END_INT_ENA</name>
              <description>The interrupt enable bit for CH7_RX_END_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_ERR_INT_ENA</name>
              <description>The interrupt enable bit for CH4_ERR_INT.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5_ERR_INT_ENA</name>
              <description>The interrupt enable bit for CH5_ERR_INT.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6_ERR_INT_ENA</name>
              <description>The interrupt enable bit for CH6_ERR_INT.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7_ERR_INT_ENA</name>
              <description>The interrupt enable bit for CH7_ERR_INT.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_RX_THR_EVENT_INT_ENA</name>
              <description>The interrupt enable bit for CH4_RX_THR_EVENT_INT.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5_RX_THR_EVENT_INT_ENA</name>
              <description>The interrupt enable bit for CH5_RX_THR_EVENT_INT.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6_RX_THR_EVENT_INT_ENA</name>
              <description>The interrupt enable bit for CH6_RX_THR_EVENT_INT.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7_RX_THR_EVENT_INT_ENA</name>
              <description>The interrupt enable bit for CH7_RX_THR_EVENT_INT.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_DMA_ACCESS_FAIL_INT_ENA</name>
              <description>The interrupt enable bit for CH3_DMA_ACCESS_FAIL_INT.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7_DMA_ACCESS_FAIL_INT_ENA</name>
              <description>The interrupt enable bit for CH7_DMA_ACCESS_FAIL_INT.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0_TX_END_INT_CLR</name>
              <description>Set this bit to clear theCH0_TX_END_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1_TX_END_INT_CLR</name>
              <description>Set this bit to clear theCH1_TX_END_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_TX_END_INT_CLR</name>
              <description>Set this bit to clear theCH2_TX_END_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3_TX_END_INT_CLR</name>
              <description>Set this bit to clear theCH3_TX_END_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH0_ERR_INT_CLR</name>
              <description>Set this bit to clear theCH0_ERR_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1_ERR_INT_CLR</name>
              <description>Set this bit to clear theCH1_ERR_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_ERR_INT_CLR</name>
              <description>Set this bit to clear theCH2_ERR_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3_ERR_INT_CLR</name>
              <description>Set this bit to clear theCH3_ERR_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH0_TX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear theCH0_TX_THR_EVENT_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1_TX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear theCH1_TX_THR_EVENT_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_TX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear theCH2_TX_THR_EVENT_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3_TX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear theCH3_TX_THR_EVENT_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH0_TX_LOOP_INT_CLR</name>
              <description>Set this bit to clear theCH0_TX_LOOP_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1_TX_LOOP_INT_CLR</name>
              <description>Set this bit to clear theCH1_TX_LOOP_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_TX_LOOP_INT_CLR</name>
              <description>Set this bit to clear theCH2_TX_LOOP_INT interrupt.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3_TX_LOOP_INT_CLR</name>
              <description>Set this bit to clear theCH3_TX_LOOP_INT interrupt.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH4_RX_END_INT_CLR</name>
              <description>Set this bit to clear theCH4_RX_END_INT interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH5_RX_END_INT_CLR</name>
              <description>Set this bit to clear theCH5_RX_END_INT interrupt.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH6_RX_END_INT_CLR</name>
              <description>Set this bit to clear theCH6_RX_END_INT interrupt.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH7_RX_END_INT_CLR</name>
              <description>Set this bit to clear theCH7_RX_END_INT interrupt.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH4_ERR_INT_CLR</name>
              <description>Set this bit to clear theCH4_ERR_INT interrupt.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH5_ERR_INT_CLR</name>
              <description>Set this bit to clear theCH5_ERR_INT interrupt.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH6_ERR_INT_CLR</name>
              <description>Set this bit to clear theCH6_ERR_INT interrupt.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH7_ERR_INT_CLR</name>
              <description>Set this bit to clear theCH7_ERR_INT interrupt.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH4_RX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear theCH4_RX_THR_EVENT_INT interrupt.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH5_RX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear theCH5_RX_THR_EVENT_INT interrupt.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH6_RX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear theCH6_RX_THR_EVENT_INT interrupt.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH7_RX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear theCH7_RX_THR_EVENT_INT interrupt.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3_DMA_ACCESS_FAIL_INT_CLR</name>
              <description>Set this bit to clear the CH3_DMA_ACCESS_FAIL_INT interrupt.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH7_DMA_ACCESS_FAIL_INT_CLR</name>
              <description>Set this bit to clear the CH7_DMA_ACCESS_FAIL_INT interrupt.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sCARRIER_DUTY</name>
          <description>Channel %s duty cycle configuration register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x400040</resetValue>
          <fields>
            <field>
              <name>CARRIER_LOW_CH</name>
              <description>This register is used to configure carrier wave 's low level clock period for CHANNEL%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH_CH</name>
              <description>This register is used to configure carrier wave 's high level clock period for CHANNEL%s.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%s_RX_CARRIER_RM</name>
          <description>Channel %s carrier remove register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CARRIER_LOW_THRES_CH</name>
              <description>The low level period in a carrier modulation mode is (REG_RMT_REG_CARRIER_LOW_THRES_CH%s + 1) for channel %s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH_THRES_CH</name>
              <description>The high level period in a carrier modulation mode is (REG_RMT_REG_CARRIER_HIGH_THRES_CH%s + 1) for channel %s.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%s_TX_LIM</name>
          <description>Channel %s Tx event configuration register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>TX_LIM_CH</name>
              <description>This register is used to configure the maximum entries that CHANNEL%s can send out.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_LOOP_NUM_CH</name>
              <description>This register is used to configure the maximum loop count when tx_conti_mode is valid.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_LOOP_CNT_EN_CH</name>
              <description>This register is the enabled bit for loop count.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP_COUNT_RESET_CH</name>
              <description>This register is used to reset the loop count when tx_conti_mode is valid.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOOP_STOP_EN_CH</name>
              <description>This bit is used to enable the loop send stop function after the loop counter counts to  loop number for CHANNEL%s.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%s_RX_LIM</name>
          <description>Channel %s Rx event configuration register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>RX_LIM_CH</name>
              <description>This register is used to configure the maximum entries that CHANNEL%s can receive.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
