esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SHA</name>
      <description>SHA (Secure Hash Algorithm) Accelerator</description>
      <groupName>SHA</groupName>
      <baseAddress>0x20509000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x290</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SHA</name>
        <value>56</value>
      </interrupt>
      <registers>
        <register>
          <name>MODE</name>
          <description>Configures SHA algorithm</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>Configures the SHA algorithm. \\
0: SHA-1\\
1: SHA2-224\\
2: SHA2-256\\
3: SHA2-384\\
4: SHA2-512\\
5: SHA2-512/224\\
6: SHA2-512/256\\
7: SHA2-512/t\\
8: SHA3-224\\
9: SHA3-256\\
10: SHA3-384\\
11: SHA3-512\\
12: SHAKE128\\
13: SHAKE256\\
14: SM3\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T_STRING</name>
          <description>SHA 512/t configuration register 0.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_STRING</name>
              <description>Sha t_string (used if and only if mode == SHA_512/t).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T_LENGTH</name>
          <description>SHA 512/t configuration register 1.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_LENGTH</name>
              <description>Sha t_length (used if and only if mode == SHA_512/t).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_BLOCK_NUM</name>
          <description>Block number register (only effective for DMA-SHA)</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_BLOCK_NUM</name>
              <description>Configures the DMA-SHA block number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>START</name>
          <description>Starts the SHA accelerator for Typical SHA operation</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>START</name>
              <description>Write 1 to start Typical SHA calculation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTINUE</name>
          <description>Continues SHA operation (only effective in Typical SHA mode)</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CONTINUE</name>
              <description>Write 1 to continue Typical SHA calculation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUSY</name>
          <description>Represents if SHA Accelerator is busy or not</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATE</name>
              <description>Represents the states of SHA accelerator. \\
0: idle\\
1: busy\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_START</name>
          <description>Starts the SHA accelerator for DMA-SHA operation</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_START</name>
              <description>Write 1 to start DMA-SHA calculation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CONTINUE</name>
          <description>Continues SHA operation (only effective in DMA-SHA mode)</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_CONTINUE</name>
              <description>Write 1 to continue DMA-SHA calculation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEAR_IRQ</name>
          <description>DMA-SHA interrupt clear register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLEAR_INTERRUPT</name>
              <description>Write 1 to clear DMA-SHA interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_ENA</name>
          <description>DMA-SHA interrupt enable register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTERRUPT_ENA</name>
              <description>Write 1 to enable DMA-SHA interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x20250623</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RX_RESET</name>
          <description>DMA RX FIFO Reset Signal</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_RX_RESET</name>
              <description>Write 1 to reset DMA RX FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_TX_RESET</name>
          <description>DMA TX FIFO Reset Signal</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_TX_RESET</name>
              <description>Write 1 to reset DMA TX FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FREE</name>
          <description>SHA free state</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>FREE</name>
              <description>Represents if SHA Accelerator is free or not. \\
0: non-free\\
1: free\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_SHAKE_LENGTH</name>
          <description>DMA configuration register 3.</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x32</resetValue>
          <fields>
            <field>
              <name>_3_SHAKE_LENGTH</name>
              <description>SHAKE output hash word length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>_2_SM_3_H_MEM[%s]</name>
          <description>SHA1, SHA2-256, SM3 H memory which contains intermediate hash or final hash. \\
SHA1, SHA2-256, SM3 : 0x00~0x20 (R/W) \\
SHA2-512 : 0x00~0x40 (R/W) \\</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>128</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>_2_SM_3_M_MEM[%s]</name>
          <description>SHA1, SHA2-256, SM3 M memory which contains message. \\
SHA1, SHA2-256, SM3 : 0x00~0x40 \\
SHA2-512 : 0x00~0x80 \\</description>
          <addressOffset>0x80</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>200</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>_3_H_MEM[%s]</name>
          <description>SHA3, SHAKE H memory which contains intermediate hash or final hash.</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>200</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>_3_M_MEM[%s]</name>
          <description>SHA3, SHAKE M memory which contains message.</description>
          <addressOffset>0x200</addressOffset>
          <size>8</size>
        </register>
