esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>EVT_ST0_CLR</name>
          <description>Events trigger status clear register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EVT_CH0_RISE_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch0_rise_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH1_RISE_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch1_rise_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH2_RISE_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch2_rise_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH3_RISE_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch3_rise_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH4_RISE_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch4_rise_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH5_RISE_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch5_rise_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH6_RISE_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch6_rise_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH7_RISE_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch7_rise_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH0_FALL_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch0_fall_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH1_FALL_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch1_fall_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH2_FALL_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch2_fall_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH3_FALL_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch3_fall_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH4_FALL_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch4_fall_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH5_FALL_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch5_fall_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH6_FALL_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch6_fall_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH7_FALL_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch7_fall_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH0_ANY_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch0_any_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH1_ANY_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch1_any_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH2_ANY_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch2_any_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH3_ANY_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch3_any_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH4_ANY_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch4_any_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH5_ANY_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch5_any_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH6_ANY_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch6_any_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EVT_CH7_ANY_EDGE_ST_CLR</name>
              <description>Configures whether or not to clear GPIO_evt_ch7_any_edge trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_DUTY_CHNG_END_CH0_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_duty_chng_end_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_DUTY_CHNG_END_CH1_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_duty_chng_end_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_DUTY_CHNG_END_CH2_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_duty_chng_end_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_DUTY_CHNG_END_CH3_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_duty_chng_end_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_DUTY_CHNG_END_CH4_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_duty_chng_end_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_DUTY_CHNG_END_CH5_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_duty_chng_end_ch5 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_DUTY_CHNG_END_CH6_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_duty_chng_end_ch6 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_DUTY_CHNG_END_CH7_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_duty_chng_end_ch7 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_ST1</name>
          <description>Events trigger status register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH0_ST</name>
              <description>Represents LEDC0_evt_ovf_cnt_pls_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH1_ST</name>
              <description>Represents LEDC0_evt_ovf_cnt_pls_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH2_ST</name>
              <description>Represents LEDC0_evt_ovf_cnt_pls_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH3_ST</name>
              <description>Represents LEDC0_evt_ovf_cnt_pls_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH4_ST</name>
              <description>Represents LEDC0_evt_ovf_cnt_pls_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH5_ST</name>
              <description>Represents LEDC0_evt_ovf_cnt_pls_ch5 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH6_ST</name>
              <description>Represents LEDC0_evt_ovf_cnt_pls_ch6 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH7_ST</name>
              <description>Represents LEDC0_evt_ovf_cnt_pls_ch7 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIME_OVF_TIMER0_ST</name>
              <description>Represents LEDC0_evt_time_ovf_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIME_OVF_TIMER1_ST</name>
              <description>Represents LEDC0_evt_time_ovf_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIME_OVF_TIMER2_ST</name>
              <description>Represents LEDC0_evt_time_ovf_timer2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIME_OVF_TIMER3_ST</name>
              <description>Represents LEDC0_evt_time_ovf_timer3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIMER0_CMP_ST</name>
              <description>Represents LEDC0_evt_timer0_cmp trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIMER1_CMP_ST</name>
              <description>Represents LEDC0_evt_timer1_cmp trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIMER2_CMP_ST</name>
              <description>Represents LEDC0_evt_timer2_cmp trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIMER3_CMP_ST</name>
              <description>Represents LEDC0_evt_timer3_cmp trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH0_ST</name>
              <description>Represents LEDC1_evt_duty_chng_end_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH1_ST</name>
              <description>Represents LEDC1_evt_duty_chng_end_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH2_ST</name>
              <description>Represents LEDC1_evt_duty_chng_end_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH3_ST</name>
              <description>Represents LEDC1_evt_duty_chng_end_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH4_ST</name>
              <description>Represents LEDC1_evt_duty_chng_end_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH5_ST</name>
              <description>Represents LEDC1_evt_duty_chng_end_ch5 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH6_ST</name>
              <description>Represents LEDC1_evt_duty_chng_end_ch6 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH7_ST</name>
              <description>Represents LEDC1_evt_duty_chng_end_ch7 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH0_ST</name>
              <description>Represents LEDC1_evt_ovf_cnt_pls_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH1_ST</name>
              <description>Represents LEDC1_evt_ovf_cnt_pls_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH2_ST</name>
              <description>Represents LEDC1_evt_ovf_cnt_pls_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH3_ST</name>
              <description>Represents LEDC1_evt_ovf_cnt_pls_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH4_ST</name>
              <description>Represents LEDC1_evt_ovf_cnt_pls_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH5_ST</name>
              <description>Represents LEDC1_evt_ovf_cnt_pls_ch5 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH6_ST</name>
              <description>Represents LEDC1_evt_ovf_cnt_pls_ch6 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH7_ST</name>
              <description>Represents LEDC1_evt_ovf_cnt_pls_ch7 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
