esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>EVT_ST1_CLR</name>
          <description>Events trigger status clear register</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH0_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH1_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH2_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH3_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH4_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH5_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch5 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH6_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch6 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_OVF_CNT_PLS_CH7_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_ovf_cnt_pls_ch7 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIME_OVF_TIMER0_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_time_ovf_timer0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIME_OVF_TIMER1_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_time_ovf_timer1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIME_OVF_TIMER2_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_time_ovf_timer2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIME_OVF_TIMER3_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_time_ovf_timer3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIMER0_CMP_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_timer0_cmp trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIMER1_CMP_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_timer1_cmp trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIMER2_CMP_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_timer2_cmp trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_EVT_TIMER3_CMP_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_evt_timer3_cmp trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH0_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_duty_chng_end_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH1_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_duty_chng_end_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH2_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_duty_chng_end_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH3_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_duty_chng_end_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH4_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_duty_chng_end_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH5_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_duty_chng_end_ch5 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH6_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_duty_chng_end_ch6 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_DUTY_CHNG_END_CH7_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_duty_chng_end_ch7 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH0_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH1_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH2_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH3_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH4_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH5_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch5 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH6_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch6 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_EVT_OVF_CNT_PLS_CH7_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_evt_ovf_cnt_pls_ch7 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_ST2</name>
          <description>Events trigger status register</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LEDC1_EVT_TIME_OVF_TIMER0_ST</name>
              <description>Represents LEDC1_evt_time_ovf_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_TIME_OVF_TIMER1_ST</name>
              <description>Represents LEDC1_evt_time_ovf_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_TIME_OVF_TIMER2_ST</name>
              <description>Represents LEDC1_evt_time_ovf_timer2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_TIME_OVF_TIMER3_ST</name>
              <description>Represents LEDC1_evt_time_ovf_timer3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_TIMER0_CMP_ST</name>
              <description>Represents LEDC1_evt_timer0_cmp trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_TIMER1_CMP_ST</name>
              <description>Represents LEDC1_evt_timer1_cmp trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_TIMER2_CMP_ST</name>
              <description>Represents LEDC1_evt_timer2_cmp trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_EVT_TIMER3_CMP_ST</name>
              <description>Represents LEDC1_evt_timer3_cmp trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_EVT_CNT_CMP_TIMER0_ST</name>
              <description>Represents TG0_evt_cnt_cmp_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_EVT_CNT_CMP_TIMER1_ST</name>
              <description>Represents TG0_evt_cnt_cmp_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_EVT_CNT_CMP_TIMER0_ST</name>
              <description>Represents TG1_evt_cnt_cmp_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_EVT_CNT_CMP_TIMER1_ST</name>
              <description>Represents TG1_evt_cnt_cmp_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTIMER_EVT_CNT_CMP0_ST</name>
              <description>Represents SYSTIMER_evt_cnt_cmp0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTIMER_EVT_CNT_CMP1_ST</name>
              <description>Represents SYSTIMER_evt_cnt_cmp1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTIMER_EVT_CNT_CMP2_ST</name>
              <description>Represents SYSTIMER_evt_cnt_cmp2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER0_STOP_ST</name>
              <description>Represents MCPWM0_evt_timer0_stop trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER1_STOP_ST</name>
              <description>Represents MCPWM0_evt_timer1_stop trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER2_STOP_ST</name>
              <description>Represents MCPWM0_evt_timer2_stop trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER0_TEZ_ST</name>
              <description>Represents MCPWM0_evt_timer0_tez trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER1_TEZ_ST</name>
              <description>Represents MCPWM0_evt_timer1_tez trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER2_TEZ_ST</name>
              <description>Represents MCPWM0_evt_timer2_tez trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER0_TEP_ST</name>
              <description>Represents MCPWM0_evt_timer0_tep trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER1_TEP_ST</name>
              <description>Represents MCPWM0_evt_timer1_tep trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER2_TEP_ST</name>
              <description>Represents MCPWM0_evt_timer2_tep trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER0_TEA_ST</name>
              <description>Represents MCPWM0_evt_timer0_tea trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER1_TEA_ST</name>
              <description>Represents MCPWM0_evt_timer1_tea trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER2_TEA_ST</name>
              <description>Represents MCPWM0_evt_timer2_tea trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER0_TEB_ST</name>
              <description>Represents MCPWM0_evt_timer0_teb trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER1_TEB_ST</name>
              <description>Represents MCPWM0_evt_timer1_teb trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_TIMER2_TEB_ST</name>
              <description>Represents MCPWM0_evt_timer2_teb trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_OP0_TEA_ST</name>
              <description>Represents MCPWM0_evt_op0_tea trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_EVT_OP1_TEA_ST</name>
              <description>Represents MCPWM0_evt_op1_tea trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
