esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>EVT_ST7_CLR</name>
          <description>Events trigger status clear register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MCPWM3_EVT_OP1_TEB_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_op1_teb trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_OP2_TEB_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_op2_teb trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_F0_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_f0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_F1_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_f1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_F2_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_f2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_F0_CLR_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_f0_clr trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_F1_CLR_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_f1_clr trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_F2_CLR_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_f2_clr trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_TZ0_CBC_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_tz0_cbc trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_TZ1_CBC_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_tz1_cbc trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_TZ2_CBC_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_tz2_cbc trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_TZ0_OST_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_tz0_ost trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_TZ1_OST_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_tz1_ost trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_TZ2_OST_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_tz2_ost trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_CAP0_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_cap0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_CAP1_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_cap1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_CAP2_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_cap2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_OP0_TEE1_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_op0_tee1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_OP1_TEE1_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_op1_tee1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_OP2_TEE1_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_op2_tee1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_OP0_TEE2_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_op0_tee2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_OP1_TEE2_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_op1_tee2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_EVT_OP2_TEE2_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_evt_op2_tee2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_EVT_EQ_ABOVE_THRESH0_ST_CLR</name>
              <description>Configures whether or not to clear ADC_evt_eq_above_thresh0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_EVT_EQ_ABOVE_THRESH1_ST_CLR</name>
              <description>Configures whether or not to clear ADC_evt_eq_above_thresh1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_EVT_EQ_BELOW_THRESH0_ST_CLR</name>
              <description>Configures whether or not to clear ADC_evt_eq_below_thresh0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_EVT_EQ_BELOW_THRESH1_ST_CLR</name>
              <description>Configures whether or not to clear ADC_evt_eq_below_thresh1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_EVT_ADC1_START_ST_CLR</name>
              <description>Configures whether or not to clear ADC_evt_adc1_start trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_EVT_ADC2_START_ST_CLR</name>
              <description>Configures whether or not to clear ADC_evt_adc2_start trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_EVT_ADC1_DONE_ST_CLR</name>
              <description>Configures whether or not to clear ADC_evt_adc1_done trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_EVT_ADC2_DONE_ST_CLR</name>
              <description>Configures whether or not to clear ADC_evt_adc2_done trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>REGDMA_EVT_DONE0_ST_CLR</name>
              <description>Configures whether or not to clear REGDMA_evt_done0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_ST8</name>
          <description>Events trigger status register</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REGDMA_EVT_DONE1_ST</name>
              <description>Represents REGDMA_evt_done1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_EVT_DONE2_ST</name>
              <description>Represents REGDMA_evt_done2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_EVT_DONE3_ST</name>
              <description>Represents REGDMA_evt_done3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_EVT_FAIL0_ST</name>
              <description>Represents REGDMA_evt_fail0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_EVT_FAIL1_ST</name>
              <description>Represents REGDMA_evt_fail1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_EVT_FAIL2_ST</name>
              <description>Represents REGDMA_evt_fail2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_EVT_FAIL3_ST</name>
              <description>Represents REGDMA_evt_fail3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMPSNSR_EVT_OVER_LIMIT_ST</name>
              <description>Represents TMPSNSR_evt_over_limit trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S0_EVT_RX_DONE_ST</name>
              <description>Represents I2S0_evt_rx_done trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S0_EVT_TX_DONE_ST</name>
              <description>Represents I2S0_evt_tx_done trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S0_EVT_X_WORDS_RECEIVED_ST</name>
              <description>Represents I2S0_evt_x_words_received trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S0_EVT_X_WORDS_SENT_ST</name>
              <description>Represents I2S0_evt_x_words_sent trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1_EVT_RX_DONE_ST</name>
              <description>Represents I2S1_evt_rx_done trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1_EVT_TX_DONE_ST</name>
              <description>Represents I2S1_evt_tx_done trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1_EVT_X_WORDS_RECEIVED_ST</name>
              <description>Represents I2S1_evt_x_words_received trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1_EVT_X_WORDS_SENT_ST</name>
              <description>Represents I2S1_evt_x_words_sent trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_EVT_ERR_INTR_ST</name>
              <description>Represents ULP_evt_err_intr trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_EVT_HALT_ST</name>
              <description>Represents ULP_evt_halt trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_EVT_START_INTR_ST</name>
              <description>Represents ULP_evt_start_intr trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_EVT_TICK_ST</name>
              <description>Represents RTC_evt_tick trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_EVT_OVF_ST</name>
              <description>Represents RTC_evt_ovf trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_EVT_CMP_ST</name>
              <description>Represents RTC_evt_cmp trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_EVT_SLEEP_WEEKUP_ST</name>
              <description>Represents PMU_evt_sleep_weekup trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_EVT_IN_DONE_CH0_ST</name>
              <description>Represents PDMA_AHB_evt_in_done_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_EVT_IN_DONE_CH1_ST</name>
              <description>Represents PDMA_AHB_evt_in_done_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_EVT_IN_DONE_CH2_ST</name>
              <description>Represents PDMA_AHB_evt_in_done_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_EVT_IN_DONE_CH3_ST</name>
              <description>Represents PDMA_AHB_evt_in_done_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_EVT_IN_DONE_CH4_ST</name>
              <description>Represents PDMA_AHB_evt_in_done_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_EVT_IN_SUC_EOF_CH0_ST</name>
              <description>Represents PDMA_AHB_evt_in_suc_eof_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_EVT_IN_SUC_EOF_CH1_ST</name>
              <description>Represents PDMA_AHB_evt_in_suc_eof_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_EVT_IN_SUC_EOF_CH2_ST</name>
              <description>Represents PDMA_AHB_evt_in_suc_eof_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_EVT_IN_SUC_EOF_CH3_ST</name>
              <description>Represents PDMA_AHB_evt_in_suc_eof_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
