esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>EVT_ST11_CLR</name>
          <description>Events trigger status clear register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_in_fifo_full_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_in_fifo_full_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_done_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_done_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_done_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_eof_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_eof_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_eof_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_total_eof_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_total_eof_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_total_eof_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_fifo_empty_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_fifo_empty_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_fifo_empty_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_fifo_full_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_fifo_full_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_evt_out_fifo_full_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_IN_DONE_CH0_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_in_done_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_IN_DONE_CH1_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_in_done_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_IN_DONE_CH2_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_in_done_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_in_suc_eof_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_in_suc_eof_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_IN_SUC_EOF_CH2_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_in_suc_eof_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_DONE_CH0_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_out_done_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_DONE_CH1_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_out_done_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_DONE_CH2_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_out_done_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_DONE_CH3_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_out_done_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_EOF_CH0_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_out_eof_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_EOF_CH1_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_out_eof_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_EOF_CH2_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_out_eof_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_EOF_CH3_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_out_eof_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_out_total_eof_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_ST12</name>
          <description>Events trigger status register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST</name>
              <description>Represents DMA2D_evt_out_total_eof_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST</name>
              <description>Represents DMA2D_evt_out_total_eof_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_TOTAL_EOF_CH3_ST</name>
              <description>Represents DMA2D_evt_out_total_eof_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_EVT_G0_ST</name>
              <description>Represents MODEM_evt_g0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_EVT_G1_ST</name>
              <description>Represents MODEM_evt_g1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_EVT_G2_ST</name>
              <description>Represents MODEM_evt_g2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_EVT_G3_ST</name>
              <description>Represents MODEM_evt_g3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZERO_DET_EVT_DELAY_CHANNEL_1_POS_ST</name>
              <description>Represents ZERO_DET_evt_delay_channel_1_pos trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZERO_DET_EVT_DELAY_CHANNEL_2_POS_ST</name>
              <description>Represents ZERO_DET_evt_delay_channel_2_pos trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZERO_DET_EVT_DELAY_CHANNEL_3_POS_ST</name>
              <description>Represents ZERO_DET_evt_delay_channel_3_pos trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZERO_DET_EVT_DELAY_CHANNEL_1_NEG_ST</name>
              <description>Represents ZERO_DET_evt_delay_channel_1_neg trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZERO_DET_EVT_DELAY_CHANNEL_2_NEG_ST</name>
              <description>Represents ZERO_DET_evt_delay_channel_2_neg trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZERO_DET_EVT_DELAY_CHANNEL_3_NEG_ST</name>
              <description>Represents ZERO_DET_evt_delay_channel_3_neg trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORDIC_EVT_RES_RDY_ST</name>
              <description>Represents CORDIC_evt_res_rdy trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_ST12_CLR</name>
          <description>Events trigger status clear register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_out_total_eof_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_out_total_eof_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_EVT_OUT_TOTAL_EOF_CH3_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_evt_out_total_eof_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_EVT_G0_ST_CLR</name>
              <description>Configures whether or not to clear MODEM_evt_g0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_EVT_G1_ST_CLR</name>
              <description>Configures whether or not to clear MODEM_evt_g1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_EVT_G2_ST_CLR</name>
              <description>Configures whether or not to clear MODEM_evt_g2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_EVT_G3_ST_CLR</name>
              <description>Configures whether or not to clear MODEM_evt_g3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ZERO_DET_EVT_DELAY_CHANNEL_1_POS_ST_CLR</name>
              <description>Configures whether or not to clear ZERO_DET_evt_delay_channel_1_pos trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ZERO_DET_EVT_DELAY_CHANNEL_2_POS_ST_CLR</name>
              <description>Configures whether or not to clear ZERO_DET_evt_delay_channel_2_pos trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ZERO_DET_EVT_DELAY_CHANNEL_3_POS_ST_CLR</name>
              <description>Configures whether or not to clear ZERO_DET_evt_delay_channel_3_pos trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ZERO_DET_EVT_DELAY_CHANNEL_1_NEG_ST_CLR</name>
              <description>Configures whether or not to clear ZERO_DET_evt_delay_channel_1_neg trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ZERO_DET_EVT_DELAY_CHANNEL_2_NEG_ST_CLR</name>
              <description>Configures whether or not to clear ZERO_DET_evt_delay_channel_2_neg trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ZERO_DET_EVT_DELAY_CHANNEL_3_NEG_ST_CLR</name>
              <description>Configures whether or not to clear ZERO_DET_evt_delay_channel_3_neg trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORDIC_EVT_RES_RDY_ST_CLR</name>
              <description>Configures whether or not to clear CORDIC_evt_res_rdy trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
