esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>TASK_ST2</name>
          <description>Tasks trigger status register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LEDC0_TASK_TIMER0_PAUSE_ST</name>
              <description>Represents LEDC0_task_timer0_pause trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_TIMER1_PAUSE_ST</name>
              <description>Represents LEDC0_task_timer1_pause trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_TIMER2_PAUSE_ST</name>
              <description>Represents LEDC0_task_timer2_pause trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_TIMER3_PAUSE_ST</name>
              <description>Represents LEDC0_task_timer3_pause trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH0_ST</name>
              <description>Represents LEDC0_task_gamma_restart_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH1_ST</name>
              <description>Represents LEDC0_task_gamma_restart_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH2_ST</name>
              <description>Represents LEDC0_task_gamma_restart_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH3_ST</name>
              <description>Represents LEDC0_task_gamma_restart_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH4_ST</name>
              <description>Represents LEDC0_task_gamma_restart_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH5_ST</name>
              <description>Represents LEDC0_task_gamma_restart_ch5 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH6_ST</name>
              <description>Represents LEDC0_task_gamma_restart_ch6 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH7_ST</name>
              <description>Represents LEDC0_task_gamma_restart_ch7 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH0_ST</name>
              <description>Represents LEDC0_task_gamma_pause_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH1_ST</name>
              <description>Represents LEDC0_task_gamma_pause_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH2_ST</name>
              <description>Represents LEDC0_task_gamma_pause_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH3_ST</name>
              <description>Represents LEDC0_task_gamma_pause_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH4_ST</name>
              <description>Represents LEDC0_task_gamma_pause_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH5_ST</name>
              <description>Represents LEDC0_task_gamma_pause_ch5 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH6_ST</name>
              <description>Represents LEDC0_task_gamma_pause_ch6 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH7_ST</name>
              <description>Represents LEDC0_task_gamma_pause_ch7 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH0_ST</name>
              <description>Represents LEDC0_task_gamma_resume_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH1_ST</name>
              <description>Represents LEDC0_task_gamma_resume_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH2_ST</name>
              <description>Represents LEDC0_task_gamma_resume_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH3_ST</name>
              <description>Represents LEDC0_task_gamma_resume_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH4_ST</name>
              <description>Represents LEDC0_task_gamma_resume_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH5_ST</name>
              <description>Represents LEDC0_task_gamma_resume_ch5 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH6_ST</name>
              <description>Represents LEDC0_task_gamma_resume_ch6 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH7_ST</name>
              <description>Represents LEDC0_task_gamma_resume_ch7 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER0_RES_UPDATE_ST</name>
              <description>Represents LEDC1_task_timer0_res_update trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER1_RES_UPDATE_ST</name>
              <description>Represents LEDC1_task_timer1_res_update trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER2_RES_UPDATE_ST</name>
              <description>Represents LEDC1_task_timer2_res_update trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER3_RES_UPDATE_ST</name>
              <description>Represents LEDC1_task_timer3_res_update trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_ST2_CLR</name>
          <description>Tasks trigger status clear register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LEDC0_TASK_TIMER0_PAUSE_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_timer0_pause trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_TIMER1_PAUSE_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_timer1_pause trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_TIMER2_PAUSE_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_timer2_pause trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_TIMER3_PAUSE_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_timer3_pause trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH0_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_restart_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH1_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_restart_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH2_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_restart_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH3_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_restart_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH4_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_restart_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH5_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_restart_ch5 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH6_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_restart_ch6 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESTART_CH7_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_restart_ch7 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH0_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_pause_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH1_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_pause_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH2_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_pause_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH3_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_pause_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH4_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_pause_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH5_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_pause_ch5 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH6_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_pause_ch6 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_PAUSE_CH7_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_pause_ch7 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH0_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_resume_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH1_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_resume_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH2_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_resume_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH3_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_resume_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH4_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_resume_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH5_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_resume_ch5 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH6_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_resume_ch6 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC0_TASK_GAMMA_RESUME_CH7_ST_CLR</name>
              <description>Configures whether or not to clear LEDC0_task_gamma_resume_ch7 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER0_RES_UPDATE_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_timer0_res_update trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER1_RES_UPDATE_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_timer1_res_update trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER2_RES_UPDATE_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_timer2_res_update trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER3_RES_UPDATE_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_timer3_res_update trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
