esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>TASK_ST3</name>
          <description>Tasks trigger status register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH0_ST</name>
              <description>Represents LEDC1_task_duty_scale_update_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH1_ST</name>
              <description>Represents LEDC1_task_duty_scale_update_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH2_ST</name>
              <description>Represents LEDC1_task_duty_scale_update_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH3_ST</name>
              <description>Represents LEDC1_task_duty_scale_update_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH4_ST</name>
              <description>Represents LEDC1_task_duty_scale_update_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH5_ST</name>
              <description>Represents LEDC1_task_duty_scale_update_ch5 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH6_ST</name>
              <description>Represents LEDC1_task_duty_scale_update_ch6 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH7_ST</name>
              <description>Represents LEDC1_task_duty_scale_update_ch7 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER0_CAP_ST</name>
              <description>Represents LEDC1_task_timer0_cap trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER1_CAP_ST</name>
              <description>Represents LEDC1_task_timer1_cap trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER2_CAP_ST</name>
              <description>Represents LEDC1_task_timer2_cap trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER3_CAP_ST</name>
              <description>Represents LEDC1_task_timer3_cap trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH0_ST</name>
              <description>Represents LEDC1_task_sig_out_dis_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH1_ST</name>
              <description>Represents LEDC1_task_sig_out_dis_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH2_ST</name>
              <description>Represents LEDC1_task_sig_out_dis_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH3_ST</name>
              <description>Represents LEDC1_task_sig_out_dis_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH4_ST</name>
              <description>Represents LEDC1_task_sig_out_dis_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH5_ST</name>
              <description>Represents LEDC1_task_sig_out_dis_ch5 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH6_ST</name>
              <description>Represents LEDC1_task_sig_out_dis_ch6 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH7_ST</name>
              <description>Represents LEDC1_task_sig_out_dis_ch7 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH0_ST</name>
              <description>Represents LEDC1_task_ovf_cnt_rst_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH1_ST</name>
              <description>Represents LEDC1_task_ovf_cnt_rst_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH2_ST</name>
              <description>Represents LEDC1_task_ovf_cnt_rst_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH3_ST</name>
              <description>Represents LEDC1_task_ovf_cnt_rst_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH4_ST</name>
              <description>Represents LEDC1_task_ovf_cnt_rst_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH5_ST</name>
              <description>Represents LEDC1_task_ovf_cnt_rst_ch5 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH6_ST</name>
              <description>Represents LEDC1_task_ovf_cnt_rst_ch6 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH7_ST</name>
              <description>Represents LEDC1_task_ovf_cnt_rst_ch7 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER0_RST_ST</name>
              <description>Represents LEDC1_task_timer0_rst trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER1_RST_ST</name>
              <description>Represents LEDC1_task_timer1_rst trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER2_RST_ST</name>
              <description>Represents LEDC1_task_timer2_rst trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER3_RST_ST</name>
              <description>Represents LEDC1_task_timer3_rst trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_ST3_CLR</name>
          <description>Tasks trigger status clear register</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH0_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_duty_scale_update_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH1_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_duty_scale_update_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH2_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_duty_scale_update_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH3_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_duty_scale_update_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH4_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_duty_scale_update_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH5_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_duty_scale_update_ch5 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH6_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_duty_scale_update_ch6 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_DUTY_SCALE_UPDATE_CH7_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_duty_scale_update_ch7 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER0_CAP_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_timer0_cap trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER1_CAP_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_timer1_cap trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER2_CAP_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_timer2_cap trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER3_CAP_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_timer3_cap trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH0_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_sig_out_dis_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH1_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_sig_out_dis_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH2_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_sig_out_dis_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH3_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_sig_out_dis_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH4_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_sig_out_dis_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH5_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_sig_out_dis_ch5 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH6_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_sig_out_dis_ch6 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_SIG_OUT_DIS_CH7_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_sig_out_dis_ch7 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH0_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_ovf_cnt_rst_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH1_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_ovf_cnt_rst_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH2_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_ovf_cnt_rst_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH3_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_ovf_cnt_rst_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH4_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_ovf_cnt_rst_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH5_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_ovf_cnt_rst_ch5 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH6_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_ovf_cnt_rst_ch6 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_OVF_CNT_RST_CH7_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_ovf_cnt_rst_ch7 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER0_RST_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_timer0_rst trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER1_RST_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_timer1_rst trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER2_RST_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_timer2_rst trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEDC1_TASK_TIMER3_RST_ST_CLR</name>
              <description>Configures whether or not to clear LEDC1_task_timer3_rst trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
