esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>TASK_ST5</name>
          <description>Tasks trigger status register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TG0_TASK_CNT_START_TIMER0_ST</name>
              <description>Represents TG0_task_cnt_start_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_TASK_ALARM_START_TIMER0_ST</name>
              <description>Represents TG0_task_alarm_start_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_STOP_TIMER0_ST</name>
              <description>Represents TG0_task_cnt_stop_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_RELOAD_TIMER0_ST</name>
              <description>Represents TG0_task_cnt_reload_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_CAP_TIMER0_ST</name>
              <description>Represents TG0_task_cnt_cap_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_START_TIMER1_ST</name>
              <description>Represents TG0_task_cnt_start_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_TASK_ALARM_START_TIMER1_ST</name>
              <description>Represents TG0_task_alarm_start_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_STOP_TIMER1_ST</name>
              <description>Represents TG0_task_cnt_stop_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_RELOAD_TIMER1_ST</name>
              <description>Represents TG0_task_cnt_reload_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_CAP_TIMER1_ST</name>
              <description>Represents TG0_task_cnt_cap_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_START_TIMER0_ST</name>
              <description>Represents TG1_task_cnt_start_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_TASK_ALARM_START_TIMER0_ST</name>
              <description>Represents TG1_task_alarm_start_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_STOP_TIMER0_ST</name>
              <description>Represents TG1_task_cnt_stop_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_RELOAD_TIMER0_ST</name>
              <description>Represents TG1_task_cnt_reload_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_CAP_TIMER0_ST</name>
              <description>Represents TG1_task_cnt_cap_timer0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_START_TIMER1_ST</name>
              <description>Represents TG1_task_cnt_start_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_TASK_ALARM_START_TIMER1_ST</name>
              <description>Represents TG1_task_alarm_start_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_STOP_TIMER1_ST</name>
              <description>Represents TG1_task_cnt_stop_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_RELOAD_TIMER1_ST</name>
              <description>Represents TG1_task_cnt_reload_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_CAP_TIMER1_ST</name>
              <description>Represents TG1_task_cnt_cap_timer1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_TASK_CMPR0_A_UP_ST</name>
              <description>Represents MCPWM0_task_cmpr0_a_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_TASK_CMPR1_A_UP_ST</name>
              <description>Represents MCPWM0_task_cmpr1_a_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_TASK_CMPR2_A_UP_ST</name>
              <description>Represents MCPWM0_task_cmpr2_a_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_TASK_CMPR0_B_UP_ST</name>
              <description>Represents MCPWM0_task_cmpr0_b_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_TASK_CMPR1_B_UP_ST</name>
              <description>Represents MCPWM0_task_cmpr1_b_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_TASK_CMPR2_B_UP_ST</name>
              <description>Represents MCPWM0_task_cmpr2_b_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_TASK_GEN_STOP_ST</name>
              <description>Represents MCPWM0_task_gen_stop trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_TASK_TIMER0_SYN_ST</name>
              <description>Represents MCPWM0_task_timer0_syn trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_TASK_TIMER1_SYN_ST</name>
              <description>Represents MCPWM0_task_timer1_syn trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_TASK_TIMER2_SYN_ST</name>
              <description>Represents MCPWM0_task_timer2_syn trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_TASK_TIMER0_PERIOD_UP_ST</name>
              <description>Represents MCPWM0_task_timer0_period_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM0_TASK_TIMER1_PERIOD_UP_ST</name>
              <description>Represents MCPWM0_task_timer1_period_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_ST5_CLR</name>
          <description>Tasks trigger status clear register</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TG0_TASK_CNT_START_TIMER0_ST_CLR</name>
              <description>Configures whether or not to clear TG0_task_cnt_start_timer0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG0_TASK_ALARM_START_TIMER0_ST_CLR</name>
              <description>Configures whether or not to clear TG0_task_alarm_start_timer0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_STOP_TIMER0_ST_CLR</name>
              <description>Configures whether or not to clear TG0_task_cnt_stop_timer0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_RELOAD_TIMER0_ST_CLR</name>
              <description>Configures whether or not to clear TG0_task_cnt_reload_timer0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_CAP_TIMER0_ST_CLR</name>
              <description>Configures whether or not to clear TG0_task_cnt_cap_timer0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_START_TIMER1_ST_CLR</name>
              <description>Configures whether or not to clear TG0_task_cnt_start_timer1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG0_TASK_ALARM_START_TIMER1_ST_CLR</name>
              <description>Configures whether or not to clear TG0_task_alarm_start_timer1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_STOP_TIMER1_ST_CLR</name>
              <description>Configures whether or not to clear TG0_task_cnt_stop_timer1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_RELOAD_TIMER1_ST_CLR</name>
              <description>Configures whether or not to clear TG0_task_cnt_reload_timer1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG0_TASK_CNT_CAP_TIMER1_ST_CLR</name>
              <description>Configures whether or not to clear TG0_task_cnt_cap_timer1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_START_TIMER0_ST_CLR</name>
              <description>Configures whether or not to clear TG1_task_cnt_start_timer0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG1_TASK_ALARM_START_TIMER0_ST_CLR</name>
              <description>Configures whether or not to clear TG1_task_alarm_start_timer0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_STOP_TIMER0_ST_CLR</name>
              <description>Configures whether or not to clear TG1_task_cnt_stop_timer0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_RELOAD_TIMER0_ST_CLR</name>
              <description>Configures whether or not to clear TG1_task_cnt_reload_timer0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_CAP_TIMER0_ST_CLR</name>
              <description>Configures whether or not to clear TG1_task_cnt_cap_timer0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_START_TIMER1_ST_CLR</name>
              <description>Configures whether or not to clear TG1_task_cnt_start_timer1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG1_TASK_ALARM_START_TIMER1_ST_CLR</name>
              <description>Configures whether or not to clear TG1_task_alarm_start_timer1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_STOP_TIMER1_ST_CLR</name>
              <description>Configures whether or not to clear TG1_task_cnt_stop_timer1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_RELOAD_TIMER1_ST_CLR</name>
              <description>Configures whether or not to clear TG1_task_cnt_reload_timer1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG1_TASK_CNT_CAP_TIMER1_ST_CLR</name>
              <description>Configures whether or not to clear TG1_task_cnt_cap_timer1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM0_TASK_CMPR0_A_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM0_task_cmpr0_a_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM0_TASK_CMPR1_A_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM0_task_cmpr1_a_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM0_TASK_CMPR2_A_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM0_task_cmpr2_a_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM0_TASK_CMPR0_B_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM0_task_cmpr0_b_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM0_TASK_CMPR1_B_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM0_task_cmpr1_b_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM0_TASK_CMPR2_B_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM0_task_cmpr2_b_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM0_TASK_GEN_STOP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM0_task_gen_stop trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM0_TASK_TIMER0_SYN_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM0_task_timer0_syn trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM0_TASK_TIMER1_SYN_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM0_task_timer1_syn trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM0_TASK_TIMER2_SYN_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM0_task_timer2_syn trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM0_TASK_TIMER0_PERIOD_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM0_task_timer0_period_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM0_TASK_TIMER1_PERIOD_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM0_task_timer1_period_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
