esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>TASK_ST7</name>
          <description>Tasks trigger status register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MCPWM1_TASK_CLR0_OST_ST</name>
              <description>Represents MCPWM1_task_clr0_ost trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM1_TASK_CLR1_OST_ST</name>
              <description>Represents MCPWM1_task_clr1_ost trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM1_TASK_CLR2_OST_ST</name>
              <description>Represents MCPWM1_task_clr2_ost trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM1_TASK_CAP0_ST</name>
              <description>Represents MCPWM1_task_cap0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM1_TASK_CAP1_ST</name>
              <description>Represents MCPWM1_task_cap1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM1_TASK_CAP2_ST</name>
              <description>Represents MCPWM1_task_cap2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM1_TASK_TIMER0_A_UP_ST</name>
              <description>Represents MCPWM1_task_timer0_a_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM1_TASK_TIMER1_A_UP_ST</name>
              <description>Represents MCPWM1_task_timer1_a_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM1_TASK_TIMER2_A_UP_ST</name>
              <description>Represents MCPWM1_task_timer2_a_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM1_TASK_TIMER0_B_UP_ST</name>
              <description>Represents MCPWM1_task_timer0_b_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM1_TASK_TIMER1_B_UP_ST</name>
              <description>Represents MCPWM1_task_timer1_b_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM1_TASK_TIMER2_B_UP_ST</name>
              <description>Represents MCPWM1_task_timer2_b_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CMPR0_A_UP_ST</name>
              <description>Represents MCPWM2_task_cmpr0_a_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CMPR1_A_UP_ST</name>
              <description>Represents MCPWM2_task_cmpr1_a_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CMPR2_A_UP_ST</name>
              <description>Represents MCPWM2_task_cmpr2_a_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CMPR0_B_UP_ST</name>
              <description>Represents MCPWM2_task_cmpr0_b_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CMPR1_B_UP_ST</name>
              <description>Represents MCPWM2_task_cmpr1_b_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CMPR2_B_UP_ST</name>
              <description>Represents MCPWM2_task_cmpr2_b_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_GEN_STOP_ST</name>
              <description>Represents MCPWM2_task_gen_stop trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TIMER0_SYN_ST</name>
              <description>Represents MCPWM2_task_timer0_syn trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TIMER1_SYN_ST</name>
              <description>Represents MCPWM2_task_timer1_syn trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TIMER2_SYN_ST</name>
              <description>Represents MCPWM2_task_timer2_syn trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TIMER0_PERIOD_UP_ST</name>
              <description>Represents MCPWM2_task_timer0_period_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TIMER1_PERIOD_UP_ST</name>
              <description>Represents MCPWM2_task_timer1_period_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TIMER2_PERIOD_UP_ST</name>
              <description>Represents MCPWM2_task_timer2_period_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TZ0_OST_ST</name>
              <description>Represents MCPWM2_task_tz0_ost trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TZ1_OST_ST</name>
              <description>Represents MCPWM2_task_tz1_ost trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TZ2_OST_ST</name>
              <description>Represents MCPWM2_task_tz2_ost trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CLR0_OST_ST</name>
              <description>Represents MCPWM2_task_clr0_ost trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CLR1_OST_ST</name>
              <description>Represents MCPWM2_task_clr1_ost trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CLR2_OST_ST</name>
              <description>Represents MCPWM2_task_clr2_ost trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CAP0_ST</name>
              <description>Represents MCPWM2_task_cap0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_ST7_CLR</name>
          <description>Tasks trigger status clear register</description>
          <addressOffset>0x24c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MCPWM1_TASK_CLR0_OST_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM1_task_clr0_ost trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM1_TASK_CLR1_OST_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM1_task_clr1_ost trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM1_TASK_CLR2_OST_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM1_task_clr2_ost trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM1_TASK_CAP0_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM1_task_cap0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM1_TASK_CAP1_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM1_task_cap1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM1_TASK_CAP2_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM1_task_cap2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM1_TASK_TIMER0_A_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM1_task_timer0_a_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM1_TASK_TIMER1_A_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM1_task_timer1_a_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM1_TASK_TIMER2_A_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM1_task_timer2_a_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM1_TASK_TIMER0_B_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM1_task_timer0_b_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM1_TASK_TIMER1_B_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM1_task_timer1_b_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM1_TASK_TIMER2_B_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM1_task_timer2_b_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CMPR0_A_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_cmpr0_a_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CMPR1_A_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_cmpr1_a_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CMPR2_A_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_cmpr2_a_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CMPR0_B_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_cmpr0_b_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CMPR1_B_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_cmpr1_b_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CMPR2_B_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_cmpr2_b_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_GEN_STOP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_gen_stop trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TIMER0_SYN_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_timer0_syn trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TIMER1_SYN_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_timer1_syn trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TIMER2_SYN_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_timer2_syn trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TIMER0_PERIOD_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_timer0_period_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TIMER1_PERIOD_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_timer1_period_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TIMER2_PERIOD_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_timer2_period_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TZ0_OST_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_tz0_ost trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TZ1_OST_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_tz1_ost trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_TZ2_OST_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_tz2_ost trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CLR0_OST_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_clr0_ost trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CLR1_OST_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_clr1_ost trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CLR2_OST_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_clr2_ost trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM2_TASK_CAP0_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM2_task_cap0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
