esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>TASK_ST9</name>
          <description>Tasks trigger status register</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MCPWM3_TASK_TIMER2_A_UP_ST</name>
              <description>Represents MCPWM3_task_timer2_a_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM3_TASK_TIMER0_B_UP_ST</name>
              <description>Represents MCPWM3_task_timer0_b_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM3_TASK_TIMER1_B_UP_ST</name>
              <description>Represents MCPWM3_task_timer1_b_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPWM3_TASK_TIMER2_B_UP_ST</name>
              <description>Represents MCPWM3_task_timer2_b_up trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_TASK_SAMPLE1_ST</name>
              <description>Represents ADC_task_sample1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_TASK_SAMPLE2_ST</name>
              <description>Represents ADC_task_sample2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_TASK_STOP1_ST</name>
              <description>Represents ADC_task_stop1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_TASK_STOP2_ST</name>
              <description>Represents ADC_task_stop2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_TASK_START0_ST</name>
              <description>Represents REGDMA_task_start0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_TASK_START1_ST</name>
              <description>Represents REGDMA_task_start1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_TASK_START2_ST</name>
              <description>Represents REGDMA_task_start2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_TASK_START3_ST</name>
              <description>Represents REGDMA_task_start3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMPSNSR_TASK_START_SAMPLE_ST</name>
              <description>Represents TMPSNSR_task_start_sample trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMPSNSR_TASK_STOP_SAMPLE_ST</name>
              <description>Represents TMPSNSR_task_stop_sample trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S0_TASK_START_RX_ST</name>
              <description>Represents I2S0_task_start_rx trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S0_TASK_START_TX_ST</name>
              <description>Represents I2S0_task_start_tx trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S0_TASK_STOP_RX_ST</name>
              <description>Represents I2S0_task_stop_rx trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S0_TASK_STOP_TX_ST</name>
              <description>Represents I2S0_task_stop_tx trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S0_TASK_SYNC_CHECK_ST</name>
              <description>Represents I2S0_task_sync_check trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1_TASK_START_RX_ST</name>
              <description>Represents I2S1_task_start_rx trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1_TASK_START_TX_ST</name>
              <description>Represents I2S1_task_start_tx trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1_TASK_STOP_RX_ST</name>
              <description>Represents I2S1_task_stop_rx trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1_TASK_STOP_TX_ST</name>
              <description>Represents I2S1_task_stop_tx trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1_TASK_SYNC_CHECK_ST</name>
              <description>Represents I2S1_task_sync_check trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_TASK_WAKEUP_CPU_ST</name>
              <description>Represents ULP_task_wakeup_cpu trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_TASK_INT_CPU_ST</name>
              <description>Represents ULP_task_int_cpu trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_TASK_SLEEP_REQ_ST</name>
              <description>Represents PMU_task_sleep_req trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_IN_START_CH0_ST</name>
              <description>Represents PDMA_AHB_task_in_start_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_IN_START_CH1_ST</name>
              <description>Represents PDMA_AHB_task_in_start_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_IN_START_CH2_ST</name>
              <description>Represents PDMA_AHB_task_in_start_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_IN_START_CH3_ST</name>
              <description>Represents PDMA_AHB_task_in_start_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_IN_START_CH4_ST</name>
              <description>Represents PDMA_AHB_task_in_start_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_ST9_CLR</name>
          <description>Tasks trigger status clear register</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MCPWM3_TASK_TIMER2_A_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_task_timer2_a_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_TASK_TIMER0_B_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_task_timer0_b_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_TASK_TIMER1_B_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_task_timer1_b_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCPWM3_TASK_TIMER2_B_UP_ST_CLR</name>
              <description>Configures whether or not to clear MCPWM3_task_timer2_b_up trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_TASK_SAMPLE1_ST_CLR</name>
              <description>Configures whether or not to clear ADC_task_sample1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_TASK_SAMPLE2_ST_CLR</name>
              <description>Configures whether or not to clear ADC_task_sample2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_TASK_STOP1_ST_CLR</name>
              <description>Configures whether or not to clear ADC_task_stop1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_TASK_STOP2_ST_CLR</name>
              <description>Configures whether or not to clear ADC_task_stop2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>REGDMA_TASK_START0_ST_CLR</name>
              <description>Configures whether or not to clear REGDMA_task_start0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>REGDMA_TASK_START1_ST_CLR</name>
              <description>Configures whether or not to clear REGDMA_task_start1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>REGDMA_TASK_START2_ST_CLR</name>
              <description>Configures whether or not to clear REGDMA_task_start2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>REGDMA_TASK_START3_ST_CLR</name>
              <description>Configures whether or not to clear REGDMA_task_start3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TMPSNSR_TASK_START_SAMPLE_ST_CLR</name>
              <description>Configures whether or not to clear TMPSNSR_task_start_sample trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TMPSNSR_TASK_STOP_SAMPLE_ST_CLR</name>
              <description>Configures whether or not to clear TMPSNSR_task_stop_sample trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2S0_TASK_START_RX_ST_CLR</name>
              <description>Configures whether or not to clear I2S0_task_start_rx trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2S0_TASK_START_TX_ST_CLR</name>
              <description>Configures whether or not to clear I2S0_task_start_tx trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2S0_TASK_STOP_RX_ST_CLR</name>
              <description>Configures whether or not to clear I2S0_task_stop_rx trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2S0_TASK_STOP_TX_ST_CLR</name>
              <description>Configures whether or not to clear I2S0_task_stop_tx trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2S0_TASK_SYNC_CHECK_ST_CLR</name>
              <description>Configures whether or not to clear I2S0_task_sync_check trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2S1_TASK_START_RX_ST_CLR</name>
              <description>Configures whether or not to clear I2S1_task_start_rx trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2S1_TASK_START_TX_ST_CLR</name>
              <description>Configures whether or not to clear I2S1_task_start_tx trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2S1_TASK_STOP_RX_ST_CLR</name>
              <description>Configures whether or not to clear I2S1_task_stop_rx trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2S1_TASK_STOP_TX_ST_CLR</name>
              <description>Configures whether or not to clear I2S1_task_stop_tx trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2S1_TASK_SYNC_CHECK_ST_CLR</name>
              <description>Configures whether or not to clear I2S1_task_sync_check trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ULP_TASK_WAKEUP_CPU_ST_CLR</name>
              <description>Configures whether or not to clear ULP_task_wakeup_cpu trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ULP_TASK_INT_CPU_ST_CLR</name>
              <description>Configures whether or not to clear ULP_task_int_cpu trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TASK_SLEEP_REQ_ST_CLR</name>
              <description>Configures whether or not to clear PMU_task_sleep_req trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_IN_START_CH0_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AHB_task_in_start_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_IN_START_CH1_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AHB_task_in_start_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_IN_START_CH2_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AHB_task_in_start_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_IN_START_CH3_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AHB_task_in_start_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_IN_START_CH4_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AHB_task_in_start_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
