esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>TASK_ST10</name>
          <description>Tasks trigger status register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PDMA_AHB_TASK_OUT_START_CH0_ST</name>
              <description>Represents PDMA_AHB_task_out_start_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_OUT_START_CH1_ST</name>
              <description>Represents PDMA_AHB_task_out_start_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_OUT_START_CH2_ST</name>
              <description>Represents PDMA_AHB_task_out_start_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_OUT_START_CH3_ST</name>
              <description>Represents PDMA_AHB_task_out_start_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_OUT_START_CH4_ST</name>
              <description>Represents PDMA_AHB_task_out_start_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_PDMA_AHB_TASK_IN_START_CH0_ST</name>
              <description>Represents LP_PDMA_AHB_task_in_start_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_PDMA_AHB_TASK_IN_START_CH1_ST</name>
              <description>Represents LP_PDMA_AHB_task_in_start_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_PDMA_AHB_TASK_OUT_START_CH0_ST</name>
              <description>Represents LP_PDMA_AHB_task_out_start_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_PDMA_AHB_TASK_OUT_START_CH1_ST</name>
              <description>Represents LP_PDMA_AHB_task_out_start_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AXI_TASK_IN_START_CH0_ST</name>
              <description>Represents PDMA_AXI_task_in_start_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AXI_TASK_IN_START_CH1_ST</name>
              <description>Represents PDMA_AXI_task_in_start_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AXI_TASK_IN_START_CH2_ST</name>
              <description>Represents PDMA_AXI_task_in_start_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AXI_TASK_OUT_START_CH0_ST</name>
              <description>Represents PDMA_AXI_task_out_start_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AXI_TASK_OUT_START_CH1_ST</name>
              <description>Represents PDMA_AXI_task_out_start_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_AXI_TASK_OUT_START_CH2_ST</name>
              <description>Represents PDMA_AXI_task_out_start_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_IN_START_CH0_ST</name>
              <description>Represents DMA2D_task_in_start_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_IN_START_CH1_ST</name>
              <description>Represents DMA2D_task_in_start_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_IN_START_CH2_ST</name>
              <description>Represents DMA2D_task_in_start_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_IN_DSCR_READY_CH0_ST</name>
              <description>Represents DMA2D_task_in_dscr_ready_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_IN_DSCR_READY_CH1_ST</name>
              <description>Represents DMA2D_task_in_dscr_ready_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_IN_DSCR_READY_CH2_ST</name>
              <description>Represents DMA2D_task_in_dscr_ready_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_START_CH0_ST</name>
              <description>Represents DMA2D_task_out_start_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_START_CH1_ST</name>
              <description>Represents DMA2D_task_out_start_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_START_CH2_ST</name>
              <description>Represents DMA2D_task_out_start_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_START_CH3_ST</name>
              <description>Represents DMA2D_task_out_start_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_DSCR_READY_CH0_ST</name>
              <description>Represents DMA2D_task_out_dscr_ready_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_DSCR_READY_CH1_ST</name>
              <description>Represents DMA2D_task_out_dscr_ready_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_DSCR_READY_CH2_ST</name>
              <description>Represents DMA2D_task_out_dscr_ready_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_DSCR_READY_CH3_ST</name>
              <description>Represents DMA2D_task_out_dscr_ready_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_TASK_G0_ST</name>
              <description>Represents MODEM_task_g0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_TASK_G1_ST</name>
              <description>Represents MODEM_task_g1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_TASK_G2_ST</name>
              <description>Represents MODEM_task_g2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_ST10_CLR</name>
          <description>Tasks trigger status clear register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PDMA_AHB_TASK_OUT_START_CH0_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AHB_task_out_start_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_OUT_START_CH1_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AHB_task_out_start_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_OUT_START_CH2_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AHB_task_out_start_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_OUT_START_CH3_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AHB_task_out_start_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AHB_TASK_OUT_START_CH4_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AHB_task_out_start_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_PDMA_AHB_TASK_IN_START_CH0_ST_CLR</name>
              <description>Configures whether or not to clear LP_PDMA_AHB_task_in_start_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_PDMA_AHB_TASK_IN_START_CH1_ST_CLR</name>
              <description>Configures whether or not to clear LP_PDMA_AHB_task_in_start_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR</name>
              <description>Configures whether or not to clear LP_PDMA_AHB_task_out_start_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR</name>
              <description>Configures whether or not to clear LP_PDMA_AHB_task_out_start_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_TASK_IN_START_CH0_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_task_in_start_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_TASK_IN_START_CH1_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_task_in_start_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_TASK_IN_START_CH2_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_task_in_start_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_TASK_OUT_START_CH0_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_task_out_start_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_TASK_OUT_START_CH1_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_task_out_start_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDMA_AXI_TASK_OUT_START_CH2_ST_CLR</name>
              <description>Configures whether or not to clear PDMA_AXI_task_out_start_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_IN_START_CH0_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_in_start_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_IN_START_CH1_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_in_start_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_IN_START_CH2_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_in_start_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_in_dscr_ready_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_in_dscr_ready_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_IN_DSCR_READY_CH2_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_in_dscr_ready_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_START_CH0_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_out_start_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_START_CH1_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_out_start_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_START_CH2_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_out_start_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_START_CH3_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_out_start_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_out_dscr_ready_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_out_dscr_ready_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_out_dscr_ready_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA2D_TASK_OUT_DSCR_READY_CH3_ST_CLR</name>
              <description>Configures whether or not to clear DMA2D_task_out_dscr_ready_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_TASK_G0_ST_CLR</name>
              <description>Configures whether or not to clear MODEM_task_g0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_TASK_G1_ST_CLR</name>
              <description>Configures whether or not to clear MODEM_task_g1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_TASK_G2_ST_CLR</name>
              <description>Configures whether or not to clear MODEM_task_g2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
