esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SPI_MEM_USER</name>
          <description>SPI0 user register.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_CS_HOLD</name>
              <description>spi cs keep low when spi is in  done  phase. 1: enable 0: disable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_CS_SETUP</name>
              <description>spi cs is enable when spi is in  prepare  phase. 1: enable 0: disable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_CK_OUT_EDGE</name>
              <description>The bit combined with SPI_MEM_CK_IDLE_EDGE bit to control SPI clock mode 0~3.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_USR_DUMMY_IDLE</name>
              <description>spi clock is disable in dummy phase when the bit is enable.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_USR_DUMMY</name>
              <description>This bit enable the dummy phase of an operation.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_USER1</name>
          <description>SPI0 user1 register.</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x5c000047</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_USR_DUMMY_CYCLELEN</name>
              <description>The length in spi_mem_clk cycles of dummy phase. The register value shall be (cycle_num-1).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_USR_DBYTELEN</name>
              <description>SPI0 USR_CMD read or write data byte length -1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_USR_ADDR_BITLEN</name>
              <description>The length in bits of address phase. The register value shall be (bit_num-1).</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_USER2</name>
          <description>SPI0 user2 register.</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x70000000</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_USR_COMMAND_VALUE</name>
              <description>The value of  command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_USR_COMMAND_BITLEN</name>
              <description>The length in bits of command phase. The register value shall be (bit_num-1)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_RD_STATUS</name>
          <description>SPI0 read control register.</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_WB_MODE</name>
              <description>Mode bits in the flash fast read mode  it is combined with spi_mem_fastrd_mode bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_WB_MODE_BITLEN</name>
              <description>Mode bits length for flash fast read mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_WB_MODE_EN</name>
              <description>Mode bits is valid while this bit is enable. 1: enable 0: disable.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_MISC</name>
          <description>SPI0 misc register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x70</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_DQ_OE_CTRL</name>
              <description>For SPI BUS IO,  APB ctrl IO DQ OE func.1: enable 0: disable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_CK_OE_CTRL</name>
              <description>For SPI BUS IO,  APB ctrl IO CK OE func.1: enable 0: disable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_CS_OE_CTRL</name>
              <description>For SPI BUS IO,  APB ctrl IO CS OE func.1: enable 0: disable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_FSUB_PIN</name>
              <description>For SPI0,  flash is connected to SUBPINs.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_SSUB_PIN</name>
              <description>For SPI0,  sram is connected to SUBPINs.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_CK_IDLE_EDGE</name>
              <description>1: SPI_CLK line is high when idle     0: spi clk line is low when idle</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_CS_KEEP_ACTIVE</name>
              <description>SPI_CS line keep low when the bit is set.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_CACHE_FCTRL</name>
          <description>SPI0 bit mode control register.</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0xc0000000</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_AXI_REQ_EN</name>
              <description>For SPI0, AXI master access enable, 1: enable, 0:disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_CACHE_USR_ADDR_4BYTE</name>
              <description>For SPI0,  cache  read flash with 4 bytes address, 1: enable, 0:disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_CACHE_FLASH_USR_CMD</name>
              <description>For SPI0,  cache  read flash for user define command, 1: enable, 0:disable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_FDIN_DUAL</name>
              <description>For SPI0 flash, din phase apply 2 signals. 1: enable 0: disable. The bit is the same with spi_mem_fread_dio.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_FDOUT_DUAL</name>
              <description>For SPI0 flash, dout phase apply 2 signals. 1: enable 0: disable. The bit is the same with spi_mem_fread_dio.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_FADDR_DUAL</name>
              <description>For SPI0 flash, address phase apply 2 signals. 1: enable 0: disable.  The bit is the same with spi_mem_fread_dio.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_FDIN_QUAD</name>
              <description>For SPI0 flash, din phase apply 4 signals. 1: enable 0: disable.  The bit is the same with spi_mem_fread_qio.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_FDOUT_QUAD</name>
              <description>For SPI0 flash, dout phase apply 4 signals. 1: enable 0: disable.  The bit is the same with spi_mem_fread_qio.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_FADDR_QUAD</name>
              <description>For SPI0 flash, address phase apply 4 signals. 1: enable 0: disable.  The bit is the same with spi_mem_fread_qio.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_ARB_WEI_EN</name>
              <description>To enable SPI0 arbiter weight func while AXI read/write access SPI0  1: enable 0: disable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_ARB_REQ0_PRI</name>
              <description>To set AXI read priority in SPI0 arbiter. The larger the value, the greater the priority.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_ARB_REQ1_PRI</name>
              <description>To set AXI write priority in SPI0 arbiter. The larger the value, the greater the priority.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_ARB_REQ0_WEI</name>
              <description>To set AXI read priority weight in SPI0 arbiter. While the priority are same, the larger the value, the greater the weight.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_ARB_REQ1_WEI</name>
              <description>To set AXI write priority weight in SPI0 arbiter. While the priority are same, the larger the value, the greater the weight.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SAME_AW_AR_ADDR_CHK_EN</name>
              <description>Set this bit to check AXI read/write the same address region.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CLOSE_AXI_INF_EN</name>
              <description>Set this bit to close AXI read/write transfer to MSPI, which means that only SLV_ERR will be replied to BRESP/RRESP.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_CACHE_SCTRL</name>
          <description>SPI0 external RAM control register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x55c070</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_CACHE_USR_SADDR_4BYTE</name>
              <description>For SPI0, In the external RAM mode, cache read flash with 4 bytes command, 1: enable, 0:disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_USR_SRAM_DIO</name>
              <description>For SPI0, In the external RAM mode, spi dual I/O mode enable, 1: enable, 0:disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_USR_SRAM_QIO</name>
              <description>For SPI0, In the external RAM mode, spi quad I/O mode enable, 1: enable, 0:disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_USR_WR_SRAM_DUMMY</name>
              <description>For SPI0, In the external RAM mode, it is the enable bit of dummy phase for write operations.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_USR_RD_SRAM_DUMMY</name>
              <description>For SPI0, In the external RAM mode, it is the enable bit of dummy phase for read operations.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_CACHE_SRAM_USR_RCMD</name>
              <description>For SPI0, In the external RAM mode cache read external RAM for user define command.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SRAM_RDUMMY_CYCLELEN</name>
              <description>For SPI0, In the external RAM mode, it is the length in bits of read dummy phase. The register value shall be (bit_num-1).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SRAM_ADDR_BITLEN</name>
              <description>For SPI0, In the external RAM mode, it is the length in bits of address phase. The register value shall be (bit_num-1).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_CACHE_SRAM_USR_WCMD</name>
              <description>For SPI0, In the external RAM mode cache write sram for user define command</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SRAM_OCT</name>
              <description>reserved</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SRAM_WDUMMY_CYCLELEN</name>
              <description>For SPI0, In the external RAM mode, it is the length in bits of write dummy phase. The register value shall be (bit_num-1).</description>
              <bitOffset>22</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
