esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SPI_MEM_SRAM_CMD</name>
          <description>SPI0 external RAM mode control register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x80c00000</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_SCLK_MODE</name>
              <description>SPI clock mode bits. 0: SPI clock is off when CS inactive 1: SPI clock is delayed one cycle after CS inactive 2: SPI clock is delayed two cycles after CS inactive 3: SPI clock is always on.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SWB_MODE</name>
              <description>Mode bits in the external RAM fast read mode  it is combined with spi_mem_fastrd_mode bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SDIN_DUAL</name>
              <description>For SPI0 external RAM , din phase apply 2 signals. 1: enable 0: disable. The bit is the same with spi_mem_usr_sram_dio.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SDOUT_DUAL</name>
              <description>For SPI0 external RAM , dout phase apply 2 signals. 1: enable 0: disable. The bit is the same with spi_mem_usr_sram_dio.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SADDR_DUAL</name>
              <description>For SPI0 external RAM , address phase apply 2 signals. 1: enable 0: disable. The bit is the same with spi_mem_usr_sram_dio.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SDIN_QUAD</name>
              <description>For SPI0 external RAM , din phase apply 4 signals. 1: enable 0: disable. The bit is the same with spi_mem_usr_sram_qio.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SDOUT_QUAD</name>
              <description>For SPI0 external RAM , dout phase apply 4 signals. 1: enable 0: disable. The bit is the same with spi_mem_usr_sram_qio.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SADDR_QUAD</name>
              <description>For SPI0 external RAM , address phase apply 4 signals. 1: enable 0: disable. The bit is the same with spi_mem_usr_sram_qio.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SCMD_QUAD</name>
              <description>For SPI0 external RAM , cmd phase apply 4 signals. 1: enable 0: disable. The bit is the same with spi_mem_usr_sram_qio.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SDIN_OCT</name>
              <description>For SPI0 external RAM , din phase apply 8 signals. 1: enable 0: disable.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SDOUT_OCT</name>
              <description>For SPI0 external RAM , dout phase apply 8 signals. 1: enable 0: disable.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SADDR_OCT</name>
              <description>For SPI0 external RAM , address phase apply 4 signals. 1: enable 0: disable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SCMD_OCT</name>
              <description>For SPI0 external RAM , cmd phase apply 8 signals. 1: enable 0: disable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SDUMMY_RIN</name>
              <description>In the dummy phase of a MSPI read data transfer when accesses to external RAM, the signal level of SPI bus is output by the MSPI controller.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SDUMMY_WOUT</name>
              <description>In the dummy phase of a MSPI write data transfer when accesses to external RAM, the signal level of SPI bus is output by the MSPI controller.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_WDUMMY_DQS_ALWAYS_OUT</name>
              <description>In the dummy phase of an MSPI write data transfer when accesses to external RAM, the level of SPI_DQS is output by the MSPI controller.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_WDUMMY_ALWAYS_OUT</name>
              <description>In the dummy phase of an MSPI write data transfer when accesses to external RAM, the level of SPI_IO[7:0] is output by the MSPI controller.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SDIN_HEX</name>
              <description>For SPI0 external RAM , din phase apply 16 signals. 1: enable 0: disable.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SDOUT_HEX</name>
              <description>For SPI0 external RAM , dout phase apply 16 signals. 1: enable 0: disable.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DQS_IE_ALWAYS_ON</name>
              <description>When accesses to external RAM, 1: the IE signals of pads connected to SPI_DQS are always 1. 0: Others.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DATA_IE_ALWAYS_ON</name>
              <description>When accesses to external RAM, 1: the IE signals of pads connected to SPI_IO[7:0] are always 1. 0: Others.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_SRAM_DRD_CMD</name>
          <description>SPI0 external RAM DDR read command control register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE</name>
              <description>For SPI0,When cache mode is enable it is the read command value of command phase for sram.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN</name>
              <description>For SPI0,When cache mode is enable it is the length in bits of command phase for sram. The register value shall be (bit_num-1).</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_SRAM_DWR_CMD</name>
          <description>SPI0 external RAM DDR write command control register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE</name>
              <description>For SPI0,When cache mode is enable it is the write command value of command phase for sram.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN</name>
              <description>For SPI0,When cache mode is enable it is the in bits of command phase  for sram. The register value shall be (bit_num-1).</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_SRAM_CLK</name>
          <description>SPI0 external RAM clock control register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x30103</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_SCLKCNT_L</name>
              <description>For SPI0 external RAM  interface, it must be equal to SPI_MEM_SCLKCNT_N.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SCLKCNT_H</name>
              <description>For SPI0 external RAM  interface, it must be floor((SPI_MEM_SCLKCNT_N+1)/2-1).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SCLKCNT_N</name>
              <description>For SPI0 external RAM  interface, it is the divider of spi_mem_clk. So spi_mem_clk frequency is system/(SPI_MEM_SCLKCNT_N+1)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SCLK_EQU_SYSCLK</name>
              <description>For SPI0 external RAM  interface, 1: spi_mem_clk is eqaul to system 0: spi_mem_clk is divided from system clock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_FSM</name>
          <description>SPI0 FSM status register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x200</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_LOCK_DELAY_TIME</name>
              <description>The lock delay time of SPI0/1 arbiter by spi0_slv_st, after PER is sent by SPI1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_FLASH_LOCK_EN</name>
              <description>The lock enable for FLASH to lock spi0 trans req.1: Enable. 0: Disable.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_SRAM_LOCK_EN</name>
              <description>The lock enable for external RAM to lock spi0 trans req.1: Enable. 0: Disable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_INT_ENA</name>
          <description>SPI0 interrupt enable register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_SLV_ST_END_INT_ENA</name>
              <description>The enable bit for SPI_MEM_SLV_ST_END_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_MST_ST_END_INT_ENA</name>
              <description>The enable bit for SPI_MEM_MST_ST_END_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_ECC_ERR_INT_ENA</name>
              <description>The enable bit for SPI_MEM_ECC_ERR_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_PMS_REJECT_INT_ENA</name>
              <description>The enable bit for SPI_MEM_PMS_REJECT_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_AXI_RADDR_ERR_INT_ENA</name>
              <description>The enable bit for SPI_MEM_AXI_RADDR_ERR_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_AXI_WR_FLASH_ERR_INT_ENA</name>
              <description>The enable bit for SPI_MEM_AXI_WR_FALSH_ERR_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_AXI_WADDR_ERR_INT__ENA</name>
              <description>The enable bit for SPI_MEM_AXI_WADDR_ERR_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_XTS_FAULT_DETECTED_INT_ENA</name>
              <description>The enable  bit for SPI_MEM_XTS_FAULT_DETECTED_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_RX_TRANS_OVF_INT_ENA</name>
              <description>The enable bit for SPI_MEM_RX_TRANS_OVF_INT interrupt.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_TX_TRANS_UDF_INT_ENA</name>
              <description>The enable bit for SPI_MEM_TX_TRANS_UDF_INT interrupt.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_DQS0_AFIFO_OVF_INT_ENA</name>
              <description>The enable bit for SPI_MEM_DQS0_AFIFO_OVF_INT interrupt.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_DQS1_AFIFO_OVF_INT_ENA</name>
              <description>The enable bit for SPI_MEM_DQS1_AFIFO_OVF_INT interrupt.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_BUS_FIFO1_UDF_INT_ENA</name>
              <description>The enable bit for SPI_MEM_BUS_FIFO1_UDF_INT interrupt.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_BUS_FIFO0_UDF_INT_ENA</name>
              <description>The enable bit for SPI_MEM_BUS_FIFO0_UDF_INT interrupt.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_INT_CLR</name>
          <description>SPI0 interrupt clear register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_SLV_ST_END_INT_CLR</name>
              <description>The clear bit for SPI_MEM_SLV_ST_END_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_MST_ST_END_INT_CLR</name>
              <description>The clear bit for SPI_MEM_MST_ST_END_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_ECC_ERR_INT_CLR</name>
              <description>The clear bit for SPI_MEM_ECC_ERR_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_PMS_REJECT_INT_CLR</name>
              <description>The clear bit for SPI_MEM_PMS_REJECT_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_AXI_RADDR_ERR_INT_CLR</name>
              <description>The clear bit for SPI_MEM_AXI_RADDR_ERR_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_AXI_WR_FLASH_ERR_INT_CLR</name>
              <description>The clear bit for SPI_MEM_AXI_WR_FALSH_ERR_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_AXI_WADDR_ERR_INT_CLR</name>
              <description>The clear bit for SPI_MEM_AXI_WADDR_ERR_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_XTS_FAULT_DETECTED_INT_CLR</name>
              <description>The clear  bit for SPI_MEM_XTS_FAULT_DETECTED_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_RX_TRANS_OVF_INT_CLR</name>
              <description>The clear bit for SPI_MEM_RX_TRANS_OVF_INT interrupt.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_TX_TRANS_UDF_INT_CLR</name>
              <description>The clear bit for SPI_MEM_TX_TRANS_UDF_INT interrupt.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_DQS0_AFIFO_OVF_INT_CLR</name>
              <description>The clear bit for SPI_MEM_DQS0_AFIFO_OVF_INT interrupt.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_DQS1_AFIFO_OVF_INT_CLR</name>
              <description>The clear bit for SPI_MEM_DQS1_AFIFO_OVF_INT interrupt.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_BUS_FIFO1_UDF_INT_CLR</name>
              <description>The clear bit for SPI_MEM_BUS_FIFO1_UDF_INT interrupt.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MEM_BUS_FIFO0_UDF_INT_CLR</name>
              <description>The clear bit for SPI_MEM_BUS_FIFO0_UDF_INT interrupt.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
