esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SPI_MEM_DLL_DLY_DB</name>
          <description>MSPI DLL function and debug configuration register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_DLL_DB_CFG_VLD_CNT</name>
              <description>Configures the end time of the debug window.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_DLL_DB_CNT_MODE_SEL</name>
              <description>[3]:1-spi_din[15:8]. 0-spi_din[7:0]. [2]:1-only shift wptr or rptr. 0-both shft wptr and rptr. [1]:1-wprt[3:0] and rptr[3:0]. 0-rptr[3:0] and wprt[3:0]. [0]:1-neg_ptr[3:0]. 0-pos_prt[3:0].</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_DLL_DB_CNT_CLR</name>
              <description>Configures the start time of the debug window. 1: Clear db_vld_cnt to 0 and Get ready for debug. 0: No debug.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_DLL_DIN_DLY_SEL</name>
              <description>Configures the din channel. 1: Use  delayed data. 0: Do not use delayed data.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_DLL_DB_ST0</name>
          <description>MSPI DLL debug status0 register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_DB_FIFO_CNT_H</name>
              <description>Debug  for DLL FIFO pointer. Use a 64bits shift register to record pointer changes during the debug window. db_fifo_cnt[63:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_DLL_DB_ST1</name>
          <description>MSPI DLL debug status1 register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_DB_FIFO_CNT_L</name>
              <description>Debug  for DLL FIFO pointer. Use a 64bits shift register to record pointer changes during the debug window. db_fifo_cnt[31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_FMEM_PMS%s_ATTR</name>
          <description>SPI1 flash PMS section %s attribute register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x1b</resetValue>
          <fields>
            <field>
              <name>SPI_FMEM_PMS_RD_ATTR</name>
              <description>1: SPI1 flash PMS section %s read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS_WR_ATTR</name>
              <description>1: SPI1 flash PMS section %s write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS_ECC</name>
              <description>SPI1 flash PMS section %s ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section %s is configured by registers SPI_FMEM_PMS%s_ADDR_REG and SPI_FMEM_PMS%s_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 flash  non-secure PMS section %s read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 flash non-secure PMS section %s write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS_NONSECURE_ECC</name>
              <description>SPI1 flash non-secure PMS section %s ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section %s is configured by registers SPI_FMEM_PMS%s_ADDR_REG and SPI_FMEM_PMS%s_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_FMEM_PMS%s_ADDR</name>
          <description>SPI1 flash PMS section %s start address register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S</name>
              <description>SPI1 flash PMS section %s start address value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_FMEM_PMS%s_SIZE</name>
          <description>SPI1 flash PMS section %s start address register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0x1000</resetValue>
          <fields>
            <field>
              <name>SPI_FMEM_PMS_SIZE</name>
              <description>SPI1 flash PMS section %s address region is (SPI_FMEM_PMS%s_ADDR_S, SPI_FMEM_PMS%s_ADDR_S + SPI_FMEM_PMS%s_SIZE)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_SMEM_PMS%s_ATTR</name>
          <description>SPI1 external RAM PMS section %s attribute register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0x1b</resetValue>
          <fields>
            <field>
              <name>SPI_SMEM_PMS_RD_ATTR</name>
              <description>1: SPI1 external RAM PMS section %s read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS_WR_ATTR</name>
              <description>1: SPI1 external RAM PMS section %s write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS_ECC</name>
              <description>SPI1 external RAM PMS section %s ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section %s is configured by registers SPI_SMEM_PMS%s_ADDR_REG and SPI_SMEM_PMS%s_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section %s read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section %s write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS_NONSECURE_ECC</name>
              <description>SPI1 external RAM non-secure PMS section %s ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section %s is configured by registers SPI_SMEM_PMS%s_ADDR_REG and SPI_SMEM_PMS%s_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_SMEM_PMS%s_ADDR</name>
          <description>SPI1 external RAM PMS section %s start address register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S</name>
              <description>SPI1 external RAM PMS section %s start address value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_SMEM_PMS%s_SIZE</name>
          <description>SPI1 external RAM PMS section %s start address register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0x1000</resetValue>
          <fields>
            <field>
              <name>SPI_SMEM_PMS_SIZE</name>
              <description>SPI1 external RAM PMS section %s address region is (SPI_SMEM_PMS%s_ADDR_S, SPI_SMEM_PMS%s_ADDR_S + SPI_SMEM_PMS%s_SIZE)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_PMS_REJECT</name>
          <description>SPI1 access reject register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_PM_EN</name>
              <description>Set this bit to enable SPI0/1 transfer permission control function.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_PMS_LD</name>
              <description>1: SPI1 write access error. 0: No write access error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_PMS_ST</name>
              <description>1: SPI1 read access error. 0: No read access error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_PMS_MULTI_HIT</name>
              <description>1: SPI1 access is rejected because of address miss. 0: No address miss error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_PMS_IVD</name>
              <description>1: SPI1 access is rejected because of address multi-hit. 0: No address multi-hit error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_PMS_REJECT_ADDR</name>
          <description>SPI1 access reject addr register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_REJECT_ADDR</name>
              <description>This bits show the first SPI1 access error address. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_ECC_CTRL</name>
          <description>MSPI ECC control register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <resetValue>0x1005000</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_ECC_ERR_CNT</name>
              <description>This bits show the error times of MSPI ECC read. It is cleared by when  SPI_MEM_ECC_ERR_INT_CLR bit is set.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_FMEM_ECC_ERR_INT_NUM</name>
              <description>Set the error times of MSPI ECC read to generate MSPI SPI_MEM_ECC_ERR_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_ECC_ERR_INT_EN</name>
              <description>Set this bit to calculate the error times of MSPI ECC read when accesses to flash.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PAGE_SIZE</name>
              <description>Set the page size of the flash accessed by MSPI. 0: 256 bytes. 1: 512 bytes. 2: 1024 bytes. 3: 2048 bytes.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_ECC_ADDR_EN</name>
              <description>Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to the ECC region or non-ECC region of flash. If there is no ECC region in flash, this bit should be 0. Otherwise, this bit should be 1.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_USR_ECC_ADDR_EN</name>
              <description>Set this bit to enable ECC address convert in SPI0/1 USR_CMD transfer.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_ECC_CONTINUE_RECORD_ERR_EN</name>
              <description>1: The error information in SPI_MEM_ECC_ERR_BITS and SPI_MEM_ECC_ERR_ADDR is updated when there is an ECC error. 0: SPI_MEM_ECC_ERR_BITS and SPI_MEM_ECC_ERR_ADDR record the first ECC error information.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_ECC_ERR_BITS</name>
              <description>Records the first ECC error bit number in the 16 bytes(From 0~127, corresponding to byte 0 bit 0 to byte 15 bit 7)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_ECC_ERR_ADDR</name>
          <description>MSPI ECC error address register</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_ECC_ERR_ADDR</name>
              <description>This bits show the first MSPI ECC error address. It is cleared by when  SPI_MEM_ECC_ERR_INT_CLR bit is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_AXI_ERR_ADDR</name>
          <description>SPI0 AXI request error address.</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_AXI_ERR_ADDR</name>
              <description>This bits show the first AXI write/read invalid error or AXI write flash error address. It is cleared by when SPI_MEM_AXI_WADDR_ERR_INT_CLR, SPI_MEM_AXI_WR_FLASH_ERR_IN_CLR or SPI_MEM_AXI_RADDR_ERR_IN_CLR bit is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SMEM_ECC_CTRL</name>
          <description>MSPI ECC control register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <resetValue>0x80000</resetValue>
          <fields>
            <field>
              <name>SPI_SMEM_ECC_ERR_INT_EN</name>
              <description>Set this bit to calculate the error times of MSPI ECC read when accesses to external RAM.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PAGE_SIZE</name>
              <description>Set the page size of the external RAM accessed by MSPI. 0: 256 bytes. 1: 512 bytes. 2: 1024 bytes. 3: 2048 bytes.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_ECC_ADDR_EN</name>
              <description>Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to the ECC region or non-ECC region of external RAM. If there is no ECC region in external RAM, this bit should be 0. Otherwise, this bit should be 1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SMEM_AXI_ADDR_CTRL</name>
          <description>SPI0 AXI address control register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <resetValue>0xfc000000</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_ALL_FIFO_EMPTY</name>
              <description>The empty status of all AFIFO and SYNC_FIFO in MSPI module. 1: All AXI transfers and SPI0 transfers are done. 0: Others.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_RDATA_AFIFO_REMPTY</name>
              <description>1: RDATA_AFIFO is empty. 0: At least one AXI read transfer is pending.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_RADDR_AFIFO_REMPTY</name>
              <description>1: AXI_RADDR_CTL_AFIFO is empty. 0: At least one AXI read transfer is pending.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_WDATA_AFIFO_REMPTY</name>
              <description>1: WDATA_AFIFO is empty. 0: At least one AXI write transfer is pending.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_WBLEN_AFIFO_REMPTY</name>
              <description>1: WBLEN_AFIFO is empty. 0: At least one AXI write transfer is pending.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_ALL_AXI_TRANS_AFIFO_EMPTY</name>
              <description>This bit is set when WADDR_AFIFO, WBLEN_AFIFO, WDATA_AFIFO, AXI_RADDR_CTL_AFIFO and RDATA_AFIFO are empty and spi0_mst_st is IDLE.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
