esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SPI_SMEM_DIN_HEX_NUM</name>
          <description>MSPI 16x external RAM input timing delay number control register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_SMEM_DIN08_NUM</name>
              <description>the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DIN09_NUM</name>
              <description>the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DIN10_NUM</name>
              <description>the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DIN11_NUM</name>
              <description>the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DIN12_NUM</name>
              <description>the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DIN13_NUM</name>
              <description>the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DIN14_NUM</name>
              <description>the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DIN15_NUM</name>
              <description>the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DINS_HEX_NUM</name>
              <description>the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SMEM_DOUT_HEX_MODE</name>
          <description>MSPI 16x external RAM output timing adjustment control register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_SMEM_DOUT08_MODE</name>
              <description>the output signals are delayed by system clock cycles, 0: output without delayed, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3: output with the posedge of clk_160,4 output with the negedge of clk_160,5: output with the spi_clk high edge ,6: output with the spi_clk low edge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DOUT09_MODE</name>
              <description>the output signals are delayed by system clock cycles, 0: output without delayed, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3: output with the posedge of clk_160,4 output with the negedge of clk_160,5: output with the spi_clk high edge ,6: output with the spi_clk low edge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DOUT10_MODE</name>
              <description>the output signals are delayed by system clock cycles, 0: output without delayed, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3: output with the posedge of clk_160,4 output with the negedge of clk_160,5: output with the spi_clk high edge ,6: output with the spi_clk low edge</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DOUT11_MODE</name>
              <description>the output signals are delayed by system clock cycles, 0: output without delayed, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3: output with the posedge of clk_160,4 output with the negedge of clk_160,5: output with the spi_clk high edge ,6: output with the spi_clk low edge</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DOUT12_MODE</name>
              <description>the output signals are delayed by system clock cycles, 0: output without delayed, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3: output with the posedge of clk_160,4 output with the negedge of clk_160,5: output with the spi_clk high edge ,6: output with the spi_clk low edge</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DOUT13_MODE</name>
              <description>the output signals are delayed by system clock cycles, 0: output without delayed, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3: output with the posedge of clk_160,4 output with the negedge of clk_160,5: output with the spi_clk high edge ,6: output with the spi_clk low edge</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DOUT14_MODE</name>
              <description>the output signals are delayed by system clock cycles, 0: output without delayed, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3: output with the posedge of clk_160,4 output with the negedge of clk_160,5: output with the spi_clk high edge ,6: output with the spi_clk low edge</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DOUT15_MODE</name>
              <description>the output signals are delayed by system clock cycles, 0: output without delayed, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3: output with the posedge of clk_160,4 output with the negedge of clk_160,5: output with the spi_clk high edge ,6: output with the spi_clk low edge</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DOUTS_HEX_MODE</name>
              <description>the output signals are delayed by system clock cycles, 0: output without delayed, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3: output with the posedge of clk_160,4 output with the negedge of clk_160,5: output with the spi_clk high edge ,6: output with the spi_clk low edge</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_CLOCK_GATE</name>
          <description>SPI0 clock gate register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>SPI_CLK_EN</name>
              <description>Register clock gate enable signal. 1: Enable. 0: Disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MSPI_CLK_FORCE_ON</name>
              <description>MSPI lowpower function clock gate force on signal. 1: Enable. 0: Disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_EN</name>
          <description>NAND FLASH control register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0xfffe</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_EN</name>
              <description>NAND FLASH function enable signal. 1: Enable NAND FLASH, Disable NOR FLASH. 0: Disable NAND FLASH, Enable NOR FLASH.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_HD_INDEX</name>
              <description>NAND FLASH spi seq head index configure register. Every 5 bits represent  the 1st index of a SPI CMD sequence.[14:10]:usr; [9:5]:axi_rd; [4:0]:axi_wr.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_USR_TRIG</name>
              <description>NAND FLASH spi seq user trigger configure register. SPI_MEM_NAND_FLASH_SEQ_USR_TRIG is corresponds to SPI_MEM_NAND_FLASH_SEQ_HD_INDEX[14:10].1: enable 0: disable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_EN</name>
              <description>NAND FLASH spi seq &amp; cmd lut cfg en. 1: enable 0: disable.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_USR_WEND</name>
              <description>Used with SPI_MEM_NAND_FLASH_SEQ_USR_TRIG to indecate the last page program ,and to excute page excute. 1: write end 0: write in a page size.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SR_ADDR0</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_ADDR0</name>
              <description>configure state register address for SPI SEQ need. If OIP is in address C0H , user could configure C0H into this register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_ADDR1</name>
              <description>configure state register address for SPI SEQ need. If OIP is in address C0H , user could configure C0H into this register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_ADDR2</name>
              <description>configure state register address for SPI SEQ need. If OIP is in address C0H , user could configure C0H into this register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_ADDR3</name>
              <description>configure state register address for SPI SEQ need. If OIP is in address C0H , user could configure C0H into this register</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SR_DIN0</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_DIN0</name>
              <description>spi read state register data to this register for SPI SEQ need. SPI_MEM_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_NAND_FLASH_SR_ADDR0_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_DIN1</name>
              <description>spi read state register data to this register for SPI SEQ need. SPI_MEM_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_NAND_FLASH_SR_ADDR0_REG.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_DIN2</name>
              <description>spi read state register data to this register for SPI SEQ need. SPI_MEM_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_NAND_FLASH_SR_ADDR0_REG.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_DIN3</name>
              <description>spi read state register data to this register for SPI SEQ need. SPI_MEM_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_NAND_FLASH_SR_ADDR0_REG.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_CFG_DATA0</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_CFG_DATA0</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CFG_DATA1</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_CFG_DATA1</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_CFG_DATA2</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CFG_DATA3</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_CFG_DATA2</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_CFG_DATA4</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CFG_DATA5</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_CMD_LUT0</name>
          <description>MSPI NAND FLASH CMD LUT control register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_CMD_VALUE0</name>
              <description>MSPI NAND FLASH config cmd value at cmd lut address 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN0</name>
              <description>MSPI NAND FLASH config sfsm_st_en at cmd lut address 0.[3]-ADDR period enable; [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_CMD_LEN0</name>
              <description>MSPI NAND FLASH config cmd length at cmd lut address 0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_ADDR_LEN0</name>
              <description>MSPI NAND FLASH config address length at cmd lut address 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_DATA_LEN0</name>
              <description>MSPI NAND FLASH config data length at cmd lut address 0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_BUS_EN0</name>
              <description>MSPI NAND FLASH config spi_bus_en at cmd lut address 0,SPI could use DUAL/QUAD mode while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT0_REG's field. The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ0</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG0</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 0.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN0</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 0. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX0</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 0.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX0</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 0.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG0</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 0. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX0</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 0. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
