esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>XTS_DESTINATION</name>
          <description>Manual Encryption destination register</description>
          <addressOffset>0x344</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_DESTINATION</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_PHYSICAL_ADDRESS</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x348</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_PHYSICAL_ADDRESS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_TRIGGER</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x34C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_TRIGGER</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_RELEASE</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x350</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_RELEASE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_DESTROY</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x354</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_DESTROY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_STATE</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x358</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_STATE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_DATE</name>
          <description>Manual Encryption version register</description>
          <addressOffset>0x35C</addressOffset>
          <size>0x20</size>
          <resetValue>0x20210907</resetValue>
          <fields>
            <field>
              <name>XTS_DATE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMU_ITEM_CONTENT</name>
          <description>MSPI-MMU item content register</description>
          <addressOffset>0x37C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000037C</resetValue>
          <fields>
            <field>
              <name>MMU_ITEM_CONTENT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMU_ITEM_INDEX</name>
          <description>MSPI-MMU item index register</description>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MMU_ITEM_INDEX</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMU_POWER_CTRL</name>
          <description>MSPI MMU power control register</description>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
          <resetValue>0x13200000</resetValue>
          <fields>
            <field>
              <name>MMU_MEM_FORCE_ON</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MMU_PAGE_SIZE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_CTRL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDN_ENA</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDN_RESULT</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPA_CTRL</name>
          <description>SPI memory cryption DPA register</description>
          <addressOffset>0x388</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000002F</resetValue>
          <fields>
            <field>
              <name>CRYPT_SECURITY_LEVEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPT_CALC_D_DPA_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPT_DPA_SELECT_REGISTER</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTS_SHADOW_FOR_SEC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_PSEUDO_ROUND_CONF</name>
          <description>SPI memory cryption PSEUDO register</description>
          <addressOffset>0x38C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000045C</resetValue>
          <fields>
            <field>
              <name>MODE_PSEUDO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEUDO_RNG_CNT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEUDO_BASE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEUDO_INC</name>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTERRND_ECO_HIGH</name>
          <description>MSPI ECO high register</description>
          <addressOffset>0x3F0</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000037C</resetValue>
          <fields>
            <field>
              <name>REGISTERRND_ECO_HIGH</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGISTERRND_ECO_LOW</name>
          <description>MSPI ECO low register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000037C</resetValue>
          <fields>
            <field>
              <name>REGISTERRND_ECO_LOW</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>SPI0 version control register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02509030</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
