esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSTIMER</name>
      <description>System Timer</description>
      <groupName>SYSTIMER</groupName>
      <baseAddress>0x20399000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYSTIMER_TARGET0</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>SYSTIMER_TARGET1</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>SYSTIMER_TARGET2</name>
        <value>35</value>
      </interrupt>
      <registers>
        <register>
          <name>CONF</name>
          <description>Configure system timer clock</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x46000000</resetValue>
          <fields>
            <field>
              <name>SYSTIMER_CLK_FO</name>
              <description>systimer clock force on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_EN</name>
              <description>Configures whether or not to enable generation of ETM events.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET2_WORK_EN</name>
              <description>Configures whether or not to enable COMP2.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET1_WORK_EN</name>
              <description>Configures whether or not to enable COMP1. See details in SYSTIMER_TARGET2_WORK_EN.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET0_WORK_EN</name>
              <description>Configures whether or not to enable COMP0. See details in SYSTIMER_TARGET2_WORK_EN.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_UNIT1_CORE1_STALL_EN</name>
              <description>Configures whether or not UNIT1 is stalled when CORE1 is stalled. \\
0: UNIT1 is not stalled. \\
1: UNIT1 is stalled.\\</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_UNIT1_CORE0_STALL_EN</name>
              <description>Configures whether or not UNIT1 is stalled when CORE0 is stalled. See details in SYSTIMER_TIMER_UNIT1_CORE1_STALL_EN.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_UNIT0_CORE1_STALL_EN</name>
              <description>Configures whether or not UNIT0 is stalled when CORE1 is stalled. See details in SYSTIMER_TIMER_UNIT1_CORE1_STALL_EN.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_UNIT0_CORE0_STALL_EN</name>
              <description>Configures whether or not UNIT0 is stalled when CORE0 is stalled. See details in SYSTIMER_TIMER_UNIT1_CORE1_STALL_EN.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_UNIT1_WORK_EN</name>
              <description>Configures whether or not to enable UNIT1. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_UNIT0_WORK_EN</name>
              <description>Configures whether or not to enable UNIT0. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Configures register clock gating. \\
0: Only enable needed clock for register read or write operations. \\
1: Register clock is always enabled for read and write operations. \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIT0_OP</name>
          <description>Read UNIT0 value to registers</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_UNIT0_VALUE_VALID</name>
              <description>Represents UNIT0 value is synchronized and valid.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_UNIT0_UPDATE</name>
              <description>Configures whether or not to update timer UNIT0, i.e., reads the UNIT0 count value to SYSTIMER_TIMER_UNIT0_VALUE_HI and SYSTIMER_TIMER_UNIT0_VALUE_LO. \\
0: No effect\\
1: Update timer UNIT0 \\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIT1_OP</name>
          <description>Read UNIT1 value to registers</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_UNIT1_VALUE_VALID</name>
              <description>Represents UNIT1 value is synchronized and valid.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_UNIT1_UPDATE</name>
              <description>Configures whether or not to update timer UNIT1, i.e., reads the UNIT1 count value to SYSTIMER_TIMER_UNIT1_VALUE_HI and SYSTIMER_TIMER_UNIT1_VALUE_LO. \\
0: No effect \\
1: Update timer UNIT1\\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIT0_LOAD_HI</name>
          <description>High 20 bits to be loaded to UNIT0</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_UNIT0_LOAD_HI</name>
              <description>Configures the value to be loaded to UNIT0, high 20 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIT0_LOAD_LO</name>
          <description>Low 32 bits to be loaded to UNIT0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_UNIT0_LOAD_LO</name>
              <description>Configures the value to be loaded to UNIT0, low 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIT1_LOAD_HI</name>
          <description>High 20 bits to be loaded to UNIT1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_UNIT1_LOAD_HI</name>
              <description>Configures the value to be loaded to UNIT1, high 20 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIT1_LOAD_LO</name>
          <description>Low 32 bits to be loaded to UNIT1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_UNIT1_LOAD_LO</name>
              <description>Configures the value to be loaded to UNIT1, low 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGET0_HI</name>
          <description>Alarm value to be loaded to COMP0, high 20 bits</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TARGET0_HI</name>
              <description>Configures the alarm value to be loaded to COMP0, high 20 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGET0_LO</name>
          <description>Alarm value to be loaded to COMP0, low 32 bits</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TARGET0_LO</name>
              <description>Configures the alarm value to be loaded to COMP0, low 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGET1_HI</name>
          <description>Alarm value to be loaded to COMP1, high 20 bits</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TARGET1_HI</name>
              <description>Configures the alarm value to be loaded to COMP1, high 20 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGET1_LO</name>
          <description>Alarm value to be loaded to COMP1, low 32 bits</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TARGET1_LO</name>
              <description>Configures the alarm value to be loaded to COMP1, low 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGET2_HI</name>
          <description>Alarm value to be loaded to COMP2, high 20 bits</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TARGET2_HI</name>
              <description>Configures the alarm value to be loaded to COMP2, high 20 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGET2_LO</name>
          <description>Alarm value to be loaded to COMP2, low 32 bits</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TARGET2_LO</name>
              <description>Configures the alarm value to be loaded to COMP2, low 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGET0_CONF</name>
          <description>Configure COMP0 alarm mode</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET0_PERIOD</name>
              <description>Configures COMP0 alarm period.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET0_PERIOD_MODE</name>
              <description>Selects the two alarm modes for COMP0. \\
0: Target mode\\
1: Period mode\\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET0_TIMER_UNIT_SEL</name>
              <description>Chooses the counter value for comparison with COMP0.\\
0: Use the count value from UNIT$0\\
1: Use the count value from UNIT$1\\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGET1_CONF</name>
          <description>Configure COMP1 alarm mode</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET1_PERIOD</name>
              <description>Configures COMP1 alarm period.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET1_PERIOD_MODE</name>
              <description>Selects the two alarm modes for COMP1. See details in SYSTIMER_TARGET0_PERIOD_MODE.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET1_TIMER_UNIT_SEL</name>
              <description>Chooses the counter value for comparison with COMP1. See details in SYSTIMER_TARGET0_TIMER_UNIT_SEL.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGET2_CONF</name>
          <description>Configure COMP2 alarm mode</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET2_PERIOD</name>
              <description>Configures COMP2 alarm period.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET2_PERIOD_MODE</name>
              <description>Configures Configures the two alarm modes for COMP2. See details in SYSTIMER_TARGET0_PERIOD_MODE.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET2_TIMER_UNIT_SEL</name>
              <description>Chooses the counter value for comparison with COMP2. See details in SYSTIMER_TARGET0_TIMER_UNIT_SEL.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIT0_VALUE_HI</name>
          <description>UNIT0 value, high 20 bits</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_UNIT0_VALUE_HI</name>
              <description>Represents UNIT0 read value, high 20 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIT0_VALUE_LO</name>
          <description>UNIT0 value, low 32 bits</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_UNIT0_VALUE_LO</name>
              <description>Represents UNIT0 read value, low 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIT1_VALUE_HI</name>
          <description>UNIT1 value, high 20 bits</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_UNIT1_VALUE_HI</name>
              <description>Represents UNIT1 read value, high 20 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIT1_VALUE_LO</name>
          <description>UNIT1 value, low 32 bits</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_UNIT1_VALUE_LO</name>
              <description>Represents UNIT1 read value, low 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP0_LOAD</name>
          <description>COMP0 synchronization register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_COMP0_LOAD</name>
              <description>Configures whether or not to enable COMP0 synchronization, i.e., reload the alarm value/period to COMP0.\\
0: No effect \\
1: Enable COMP0 synchronization\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP1_LOAD</name>
          <description>COMP1 synchronization register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_COMP1_LOAD</name>
              <description>Configures whether or not to enable COMP1 synchronization, i.e., reload the alarm value/period to COMP1. \\
0: No effect \\
1: Enable COMP1 synchronization\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP2_LOAD</name>
          <description>COMP2 synchronization register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_COMP2_LOAD</name>
              <description>Configures whether or not to enable COMP2 synchronization, i.e., reload the alarm value/period to COMP2.\\
0: No effect \\
1: Enable COMP2 synchronization\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIT0_LOAD</name>
          <description>UNIT0 synchronization register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_UNIT0_LOAD</name>
              <description>Configures whether or not to reload the value of UNIT0, i.e., reloads the values of SYSTIMER_TIMER_UNIT0_VALUE_HI and SYSTIMER_TIMER_UNIT0_VALUE_LO to UNIT0. \\
0: No effect \\
1: Reload the value of UNIT0\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIT1_LOAD</name>
          <description>UNIT1 synchronization register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_UNIT1_LOAD</name>
              <description>Configures whether or not to reload the value of UNIT1, i.e., reload the values of SYSTIMER_TIMER_UNIT1_VALUE_HI and SYSTIMER_TIMER_UNIT1_VALUE_LO to UNIT1. \\
0: No effect \\
1: Reload the value of UNIT1\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable register of system timer</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET0_INT_ENA</name>
              <description>Write 1 to enable SYSTIMER_TARGET0_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET1_INT_ENA</name>
              <description>Write 1 to enable SYSTIMER_TARGET1_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET2_INT_ENA</name>
              <description>Write 1 to enable SYSTIMER_TARGET2_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
