esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TEE</name>
      <description>TEE Peripheral</description>
      <groupName>TEE</groupName>
      <baseAddress>0x20504000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x158</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>M0_MODE_CTRL</name>
          <description>TEE mode control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M0_MODE</name>
              <description>Configures M0 security level mode.\\
0: tee_mode \\
1: ree_mode0 \\
2: ree_mode1 \\
3: ree_mode2  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M0_LOCK</name>
              <description>Set 1 to lock m0 tee configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M1_MODE_CTRL</name>
          <description>TEE mode control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>M1_MODE</name>
              <description>Configures M0 security level mode.\\
0: tee_mode \\
1: ree_mode0 \\
2: ree_mode1 \\
3: ree_mode2  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M1_LOCK</name>
              <description>Set 1 to lock m1 tee configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>13</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>3-15</dimIndex>
          <name>M%s_MODE_CTRL</name>
          <description>TEE mode control register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>M_MODE</name>
              <description>Configures M%s security level mode.\\
0: tee_mode \\
1: ree_mode0 \\
2: ree_mode1 \\
3: ree_mode2  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M_LOCK</name>
              <description>Set 1 to lock m3 tee configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>68</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>20-87</dimIndex>
          <name>M%s_MODE_CTRL</name>
          <description>TEE mode control register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>M_MODE</name>
              <description>Configures M%s security level mode.\\
0: tee_mode \\
1: ree_mode0 \\
2: ree_mode1 \\
3: ree_mode2  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M_LOCK</name>
              <description>Set 1 to lock m20 tee configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SUPERVISOR_PRIV_SEL</name>
          <description>TEE mode control register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_SUPERVISOR_PRIV_SEL</name>
              <description>Configures the privilege of the core0 supervisor mode .\\
0: same as user_mode \\
1: same as machine_mode \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_SUPERVISOR_PRIV_SEL</name>
              <description>Configures the privilege of the core0 supervisor mode .\\
0: same as user_mode \\
1: same as machine_mode \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_SUPERVISOR_PRIV_SEL_LOCK</name>
              <description>Set 1 to lock reg_core0_supervisor_priv_sel configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_SUPERVISOR_PRIV_SEL_LOCK</name>
              <description>Set 1 to lock reg_core1_supervisor_priv_sel configuration</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gating register</description>
          <addressOffset>0x3f8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to keep the clock always on.\\
0: enable automatic clock gating \\
1: keep the clock always on  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2506250</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
