esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>PAD14_TH1</name>
          <description>need_des</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD14_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD14_TH2</name>
          <description>need_des</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD14_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>need_des</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2508140</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TRACE0</name>
      <description>TRACE0 Peripheral</description>
      <groupName>TRACE</groupName>
      <baseAddress>0x2d000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4c</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CORE0_TRACE</name>
        <value>103</value>
      </interrupt>
      <registers>
        <register>
          <name>MEM_START_ADDR</name>
          <description>mem start addr</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_START_ADDR</name>
              <description>The start address of trace memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_END_ADDR</name>
          <description>mem end addr</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>MEM_END_ADDR</name>
              <description>The end address of trace memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_CURRENT_ADDR</name>
          <description>mem current addr</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_CURRENT_ADDR</name>
              <description>current_mem_addr,indicate that next writing addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_ADDR_UPDATE</name>
          <description>mem addr update</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_CURRENT_ADDR_UPDATE</name>
              <description>when set, the  will \hyperref[fielddesc:TRACEMEMCURRENTADDR]{TRACE_MEM_CURRENT_ADDR} update to \hyperref[fielddesc:TRACEMEMSTARTADDR]{TRACE_MEM_START_ADDR}.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO_STATUS</name>
          <description>fifo status register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>FIFO_EMPTY</name>
              <description>Represent whether the fifo is empty. \\1: empty \\0: not empty</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORK_STATUS</name>
              <description>Represent trace work status: \\0: idle state \\1: working state\\ 2: wait state due to hart halted or havereset \\3: lost state</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_ENA</name>
          <description>interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FIFO_OVERFLOW_INTR_ENA</name>
              <description>Set 1 enable fifo_overflow interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_FULL_INTR_ENA</name>
              <description>Set 1 enable mem_full interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_RAW</name>
          <description>interrupt status register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FIFO_OVERFLOW_INTR_RAW</name>
              <description>fifo_overflow interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_FULL_INTR_RAW</name>
              <description>mem_full interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_CLR</name>
          <description>interrupt clear register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FIFO_OVERFLOW_INTR_CLR</name>
              <description>Set 1 to clear fifo overflow interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEM_FULL_INTR_CLR</name>
              <description>Set 1 to clear mem full interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGGER</name>
          <description>trigger register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0xc</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>Configure whether or not start trace.\\1: start trace \\0: invalid\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OFF</name>
              <description>Configure whether or not stop trace.\\1: stop trace \\0: invalid\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEM_LOOP</name>
              <description>Configure memory loop mode. \\1: trace will loop wrtie trace_mem. \\0: when mem_current_addr at mem_end_addr, it will stop at the mem_end_addr\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESTART_ENA</name>
              <description>Configure whether or not enable auto-restart.\\1: enable\\0: disable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>trace configuration register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DM_TRIGGER_ENA</name>
              <description>Configure whether or not enable cpu trigger action.\\1: enable\\0:disable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_ENA</name>
              <description>Configure whether or not enable trace cpu haverest, when enabeld, if cpu have reset, the encoder will output a packet to report the address of the last instruction, and upon reset deassertion, the encoder start again.\\1: enabeld\\0: disabled\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALT_ENA</name>
              <description>Configure whether or not enable trace cpu is halted, when enabeld, if the cpu halted, the encoder will output a packet to report the address of the last instruction, and upon halted deassertion, the encoder start again.When disabled, encoder will not report the last address before halted and first address after halted, cpu halted information will not be tracked. \\1: enabeld\\0: disabled\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL_ENA</name>
              <description>Configure whether or not enable stall cpu. When enabled, when the fifo almost full, the cpu will be stalled until the packets is able to write to fifo.\\1: enabled.\\0: disabled\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FULL_ADDRESS</name>
              <description>Configure whether or not enable full-address mode.\\1: full address mode.\\0: delta address mode\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IMPLICIT_EXCEPT</name>
              <description>Configure whether or not enabel implicit exception mode. When enabled,, do not sent exception address, only exception cause in exception packets.\\1: enabled\\0: disabled\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_CONTROL</name>
          <description>filter control register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FILTER_EN</name>
              <description>Configure whether or not enable filter unit. \\1: enable filter.\\ 0: always match</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_COMP</name>
              <description>when set, the comparator must be high in order for the filter to match</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_PRIVILEGE</name>
              <description>when set, match privilege levels specified by \hyperref[fielddesc:TRACEMATCHCHOICEPRIVILEGE]{TRACE_MATCH_CHOICE_PRIVILEGE}.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_ECAUSE</name>
              <description>when set, start matching from exception cause codes specified by \hyperref[fielddesc:TRACEMATCHCHOICEECAUSE]{TRACE_MATCH_CHOICE_ECAUSE}, and stop matching upon return from the 1st matching exception.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_INTERRUPT</name>
              <description>when set, start matching from a trap with the interrupt level codes specified by \hyperref[fielddesc:TRACEMATCHVALUEINTERRUPT]{TRACE_MATCH_VALUE_INTERRUPT}, and stop matching upon return from the 1st matching trap.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_MATCH_CONTROL</name>
          <description>filter match control register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MATCH_CHOICE_PRIVILEGE</name>
              <description>Select match which privilege level when \hyperref[fielddesc:TRACEMATCHPRIVILEGE]{TRACE_MATCH_PRIVILEGE} is set. \\2'b11: machine mode. \\2'b0: user mode. \\2'b01: supervisor mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_VALUE_INTERRUPT</name>
              <description>Select which match which itype when \hyperref[fielddesc:TRACEMATCHINTERRUPT]{TRACE_MATCH_INTERRUP} is set. \\1: match itype of 2. \\0: match itype of 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_CHOICE_ECAUSE</name>
              <description>specified which ecause matched.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_COMPARATOR_CONTROL</name>
          <description>filter comparator match control register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P_INPUT</name>
              <description>Determines which input to compare against the primary comparator, \\0: iaddr, \\1: tval.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P_FUNCTION</name>
              <description>Select the primary comparator function. \\0: equal, \\1: not equal, \\2: less than, \\3: less than or equal, \\4: greater than, \\5: greater than or equal, \\other: always match</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P_NOTIFY</name>
              <description>Generate a trace packet explicitly reporting the address that cause the primary match</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_INPUT</name>
              <description>Determines which input to compare against the secondary comparator, \\0: iaddr, \\1: tval.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_FUNCTION</name>
              <description>Select the secondary comparator function. \\0: equal, \\1: not equal, \\2: less than, \\3: less than or equal, \\4: greater than, \\5: greater than or equal, \\other: always match</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_NOTIFY</name>
              <description>Generate a trace packet explicitly reporting the address that cause the secondary match</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_MODE</name>
              <description>0: only primary matches, \\1: primary and secondary comparator both matches(P\&amp;\&amp;S),\\ 2:either primary or secondary comparator matches !(P\&amp;\&amp;S), \\3: set when primary matches and continue to match until after secondary comparator matches</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_P_COMPARATOR_MATCH</name>
          <description>primary comparator match value</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P_MATCH</name>
              <description>primary comparator match value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_S_COMPARATOR_MATCH</name>
          <description>secondary comparator match value</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S_MATCH</name>
              <description>secondary comparator match value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESYNC_PROLONGED</name>
          <description>resync configuration register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>RESYNC_PROLONGED</name>
              <description>count number, when count to this value, send a sync package</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESYNC_MODE</name>
              <description>resyc mode sel: \\0: off, \\2: package num count  \\3: cycle count</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_CONFIG</name>
          <description>AHB config register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HBURST</name>
              <description>set hburst</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_INCR</name>
              <description>set max continuous access for incr mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gate control register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>The bit is used to enable clock gate when access all registers in this module.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2308290</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>version control register. Note that this default value stored is the latest date when the hardware logic was updated.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
