esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TRACE0">
      <name>TRACE1</name>
      <baseAddress>0x2d001000</baseAddress>
      <description>TRACE1 Peripheral</description>
      <interrupt>
        <name>CORE1_TRACE</name>
        <value>104</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TRNG</name>
      <description>TRNG Peripheral</description>
      <groupName>TRNG</groupName>
      <baseAddress>0x20814000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_TRNG</name>
        <value>154</value>
      </interrupt>
      <registers>
        <register>
          <name>CONF</name>
          <description>CFG reg</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>NOISE_SOURCE_SEL</name>
              <description>sel noise source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOISE_POS_SEL</name>
              <description>sel noise pos</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPETITION_VALUE_C</name>
              <description>parameter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADPATIVE_VALUE_C</name>
              <description>parameter</description>
              <bitOffset>19</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_RESET</name>
              <description>fifo_reset</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RANDOM_OUTPUT_MODE</name>
              <description>standart and nonstandart output</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOISE_CRC_EN</name>
              <description>standart and nonstandart output</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_ENABLE</name>
              <description>1: enable rng sample loop</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_CONF</name>
          <description>reserved</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x800</resetValue>
          <fields>
            <field>
              <name>STARTUP_TEST_START</name>
              <description>startup start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STARTUP_TEST_LIMIT</name>
              <description>startup limit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUG_DATA</name>
              <description>debug data</description>
              <bitOffset>17</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEBUG_MODE</name>
              <description>1 for debug mode 0 for nomarl mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HEALTH_TEST_ERROR_CODE</name>
              <description>error code</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HEALTH_TEST_END</name>
              <description>health test end</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HEALTH_TEST_BYPASS</name>
              <description>health test bypass</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONDITION_KEY0</name>
          <description>condition key reg</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CONDITION_KEY0</name>
              <description>condition key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONDITION_KEY1</name>
          <description>condition key reg</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CONDITION_KEY1</name>
              <description>condition key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONDITION_KEY2</name>
          <description>condition key reg</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CONDITION_KEY2</name>
              <description>condition key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONDITION_KEY3</name>
          <description>condition key reg</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CONDITION_KEY3</name>
              <description>condition key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONDITION_KEY4</name>
          <description>condition key reg</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CONDITION_KEY4</name>
              <description>condition key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONDITION_KEY5</name>
          <description>condition key reg</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CONDITION_KEY5</name>
              <description>condition key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONDITION_KEY6</name>
          <description>condition key reg</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CONDITION_KEY6</name>
              <description>condition key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONDITION_KEY7</name>
          <description>condition key reg</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CONDITION_KEY7</name>
              <description>condition key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Read only register for error and done</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ERROR_INT_ENA</name>
              <description>error flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Read only register for error and done</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ERROR_INT_RAW</name>
              <description>error flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Read only register for error and done</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ERROR_INT_CLR</name>
              <description>error flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Read only register for error and done</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ERROR_INT_ST</name>
              <description>error flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARBIT_CFG</name>
          <description>arbit cfg</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ARBIT_PRIORITY_0</name>
              <description>reg_arbit_priority_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBIT_PRIORITY_1</name>
              <description>reg_arbit_priority_1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBIT_PRIORITY_2</name>
              <description>reg_arbit_priority_2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBIT_PRIORITY_3</name>
              <description>reg_arbit_priority_3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBIT_EN</name>
              <description>reg_arbit_en</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_READ</name>
          <description>sw read random reg</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SW_RANDOM_DATA</name>
              <description>sw read random reg</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_READ_ST</name>
          <description>sw read st reg</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SW_DATA_VALID</name>
              <description>sw random data st</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SW_RANDOM_REQ</name>
              <description>sw read random req</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_DATA</name>
          <description>sw read data</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SW_CRC_RANDOM_DATA</name>
              <description>sw read crc random data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_SYNC_DATA</name>
          <description>sw read data sync</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SW_CRC_RANDOM_DATA_SYNC</name>
              <description>sw read crc random sync data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Date register.</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x250730</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>TRNG date information</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>clock enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
