esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>TX_STATUS</name>
          <description>TWAI FD TX buffer status register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x8888</resetValue>
          <fields>
            <field>
              <name>TXTB0_STATE</name>
              <description>Status of TXT buffer 1.
0b0000 - TXT_NOT_EXIST - TXT buffer does not exist in the core (applies only to TXT buffers 3-8, when CTU
CAN FD was synthesized with less than 8 TXT buffers).
0b0001 - TXT_RDY - TXT buffer is in &quot;Ready&quot; state, it is waiting for CTU CAN FD to start transmission from it.
0b0010 - TXT_TRAN - TXT buffer is in &quot;TX in progress&quot; state. CTU CAN FD is transmitting frame.
0b0011 - TXT_ABTP - TXT buffer is in &quot;Abort in progress&quot; state.
0b0100 - TXT_TOK - TXT buffer is in &quot;TX OK&quot; state.
0b0110 - TXT_ERR - TXT buffer is in &quot;Failed&quot; state.
0b0111 - TXT_ABT - TXT buffer is in &quot;Aborted&quot; state.
0b1000 - TXT_ETY - TXT buffer is in &quot;Empty&quot; state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX2S</name>
              <description>Status of TXT buffer 2. Bit field meaning is analogous to TX1S.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX3S</name>
              <description>Status of TXT buffer 3. Bit field meaning is analogous to TX1S.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX4S</name>
              <description>Status of TXT buffer 4. Bit field meaning is analogous to TX1S.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX5S</name>
              <description>Status of TXT buffer 5. Bit field meaning is analogous to TX1S.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX6S</name>
              <description>Status of TXT buffer 6. Bit field meaning is analogous to TX1S.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX7S</name>
              <description>Status of TXT buffer 7. Bit field meaning is analogous to TX1S.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX8S</name>
              <description>Status of TXT buffer 8. Bit field meaning is analogous to TX1S.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_COMMAND_TXTB_INFO</name>
          <description>TWAI FD TXT buffer command &amp; information register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0x40000</resetValue>
          <fields>
            <field>
              <name>TXCE</name>
              <description>Issues &quot;set empty&quot; command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXCR</name>
              <description>Issues &quot;set ready&quot; command.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXCA</name>
              <description>Issues &quot;set abort&quot; command.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXB1</name>
              <description>Command is issued to TXT Buffer 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXB2</name>
              <description>Command is issued to TXT Buffer 2.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXB3</name>
              <description>Command is issued to TXT Buffer 3. If number of TXT Buffers is less than 3, this field is reserved and has no
Function.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXB4</name>
              <description>Command is issued to TXT Buffer 4. If number of TXT Buffers is less than 4, this field is reserved and has no
Function.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXB5</name>
              <description>Command is issued to TXT Buffer 5. If number of TXT Buffers is less than 5, this field is reserved and has no
Function.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXB6</name>
              <description>Command is issued to TXT Buffer 6. If number of TXT Buffers is less than 6, this field is reserved and has no
Function.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXB7</name>
              <description>Command is issued to TXT Buffer 7. If number of TXT Buffers is less than 7, this field is reserved and has no
Function.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXB8</name>
              <description>Command is issued to TXT Buffer 8. If number of TXT Buffers is less than 8, this field is reserved and has no
Function.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXT_BUFFER_COUNT</name>
              <description>Number of TXT buffers present in CTU CAN FD. Lowest buffer is always 1. Highest buffer
is at index equal to number of present buffers.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_PRIORITY</name>
          <description>TWAI FD TXT buffer command &amp; information register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>TXT1P</name>
              <description>Priority of TXT buffer 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXT2P</name>
              <description>Priority of TXT buffer 2.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXT3P</name>
              <description>Priority of TXT buffer 3. If number of TXT Buffers is less than 3, this field is reserved and has no function.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXT4P</name>
              <description>Priority of TXT buffer 4. If number of TXT Buffers is less than 4, this field is reserved and has no function.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXT5P</name>
              <description>Priority of TXT buffer 5. If number of TXT Buffers is less than 5, this field is reserved and has no function.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXT6P</name>
              <description>Priority of TXT buffer 6. If number of TXT Buffers is less than 6, this field is reserved and has no function.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXT7P</name>
              <description>Priority of TXT buffer 7. If number of TXT Buffers is less than 7, this field is reserved and has no function.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXT8P</name>
              <description>Priority of TXT buffer 8. If number of TXT Buffers is less than 8, this field is reserved and has no function.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_CAPT_RETR_CTR_ALC_TS_INFO</name>
          <description>TWAI FD error capture &amp; retransmit counter &amp; arbitration lost &amp; timestamp integration information register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x1f</resetValue>
          <fields>
            <field>
              <name>ERR_POS</name>
              <description>0b00000 - ERC_POS_SOF - Error in Start of Frame
0b00001 - ERC_POS_ARB - Error in Arbitration Filed
0b00010 - ERC_POS_CTRL - Error in Control field
0b00011 - ERC_POS_DATA - Error in Data Field
0b00100 - ERC_POS_CRC - Error in CRC Field
0b00101 - ERC_POS_ACK - Error in CRC delimiter, ACK field or ACK delimiter
0b00110 - ERC_POS_EOF - Error in End of frame field
0b00111 - ERC_POS_ERR - Error during Error frame
0b01000 - ERC_POS_OVRL - Error in Overload frame
0b11111 - ERC_POS_OTHER - Other position of error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_TYPE</name>
              <description>Type of last error.
0b000 - ERC_BIT_ERR - Bit Error
0b001 - ERC_CRC_ERR - CRC Error
0b010 - ERC_FRM_ERR - Form Error
0b011 - ERC_ACK_ERR - Acknowledge Error
0b100 - ERC_STUF_ERR - Stuff Error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RETR_CTR_VAL</name>
              <description>Current value of retransmitt counter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALC_BIT</name>
              <description>Arbitration lost capture bit position. If ALC_ID_FIELD = ALC_BASE_ID then bit index of BASE identifier
in which arbitration was lost is given as: 11 - ALC_VAL. If ALC_ID_FIELD = ALC_EXTENSION then bit index of
EXTENDED identifier in which arbitration was lost is given as: 18 - ALC_VAL. For other values of ALC_ID_FIELD,
this value is undefined.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALC_ID_FIELD</name>
              <description>Part of CAN Identifier in which arbitration was lost.
0b000 - ALC_RSVD - Unit did not loose arbitration since last reset.
0b001 - ALC_BASE_ID - Arbitration was lost during base identifier.
0b010 - ALC_SRR_RTR - Arbitration was lost during first bit after base identifier (SRR of Extended Frame, RTR
bit of CAN 2.0 Base Frame)
0b011 - ALC_IDE - Arbitration was lost during IDE bit.
0b100 - ALC_EXTENSION - Arbitration was lost during Identifier extension.
0b101 - ALC_RTR - Arbitration was lost during RTR bit after Identifier extension!</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TS_BITS</name>
              <description>Number of active bits of CTU CAN FD time-base minus 1 (0x3F = 64 bit time-base).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRV_DELAY_SSP_CFG</name>
          <description>TWAI FD transmit delay &amp; secondary sample point configuration register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0xa0000</resetValue>
          <fields>
            <field>
              <name>TRV_DELAY_VALUE</name>
              <description>Measured Transmitter delay in multiple of minimal Time quanta.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSP_OFFSET</name>
              <description>Secondary sampling point offset. Value is given as multiple of minimal Time quanta.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSP_SRC</name>
              <description>Source of Secondary sampling point.
0b00 - SSP_SRC_MEAS_N_OFFSET - SSP position = TRV_DELAY (Measured Transmitter delay) + SSP_OFFSET.
0b01 - SSP_SRC_NO_SSP - SSP is not used. Transmitter uses regular Sampling Point during data bit rate.
0b10 - SSP_SRC_OFFSET - SSP position = SSP_OFFSET. Measured Transmitter delay value is ignored.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_FR_CTR</name>
          <description>TWAI FD received frame counter register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>Number of received frames by CTU CAN FD.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_FR_CTR</name>
          <description>TWAI FD transmitted frame counter register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CTR_VAL</name>
              <description>Number of transmitted frames by CTU CAN FD.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG</name>
          <description>TWAI FD debug register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STUFF_COUNT</name>
              <description>Actual stuff count modulo 8 as definned in ISO FD protocol. Stuff count is erased in the beginning
of CAN frame and increased by one with each stuff bit until Stuff count field in ISO FD frame. Then it stays fixed
until the beginning of next frame. In non-ISO FD or normal CAN stuff bits are counted until the end of a frame.
Note that this field is NOT gray encoded as defined in ISO FD standard. Stuff count is calculated only as long as
controller is transceiving on the bus. During the reception this value remains fixed!</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DESTUFF_COUNT</name>
              <description>Actual de-stuff count modulo 8 as defined in ISO FD protocol. De-Stuff count is erased in the
beginning of the frame and increased by one with each de-stuffed bit until Stuff count field in ISO FD Frame. Then
it stays fixed until beginning of next frame. In non-ISO FD or normal CAN de-stuff bits are counted until the end
of the frame. Note that this field is NOT grey encoded as defined in ISO FD standard. De-stuff count is calculated
in both. Transceiver as well as receiver.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_ARB</name>
              <description>Protocol control state machine is in Arbitration field.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_CON</name>
              <description>Protocol control state machine is in Control field.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_DAT</name>
              <description>Protocol control state machine is in Data field.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_STC</name>
              <description>Protocol control state machine is in Stuff Count field.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_CRC</name>
              <description>Protocol control state machine is in CRC field.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_CRCD</name>
              <description>Protocol control state machine is in CRC Delimiter field.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_ACK</name>
              <description>Protocol control state machine is in ACK field.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_ACKD</name>
              <description>Protocol control state machine is in ACK Delimiter field.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EOF</name>
              <description>Protocol control state machine is in End of file field.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_INT</name>
              <description>Protocol control state machine is in Intermission field.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_SUSP</name>
              <description>Protocol control state machine is in Suspend transmission field.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_OVR</name>
              <description>Protocol control state machine is in Overload field.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_SOF</name>
              <description>Protocol control state machine is in Start of frame field.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>YOLO</name>
          <description>TWAI FD transmitted frame counter register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0xdeadbeef</resetValue>
          <fields>
            <field>
              <name>VAL</name>
              <description>What else could be in this register??</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMESTAMP_LOW</name>
          <description>TWAI FD transmitted frame counter register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMESTAMP_LOW</name>
              <description>Bits 31:0 of time base.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMESTAMP_HIGH</name>
          <description>TWAI FD transmitted frame counter register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMESTAMP_HIGH</name>
              <description>Bits 63:32 of time base.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
