esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>TIMER_CLK_EN</name>
          <description>TWAIFD timer clock force enable register.</description>
          <addressOffset>0xfd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Set this bit to force enable TWAIFD register configuration clock signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_RXBUF_MEM_CLK_ON</name>
              <description>Set this bit to force enable TWAIFD RX buffer ram clock signal.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_INT_RAW</name>
          <description>TWAIFD raw interrupt register.</description>
          <addressOffset>0xfd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_OVERFLOW_INT_RAW</name>
              <description>The raw bit signal for read_done interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_INT_ST</name>
          <description>TWAIFD interrupt status register.</description>
          <addressOffset>0xfdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_OVERFLOW_INT_ST</name>
              <description>The status signal for read_done interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_INT_ENA</name>
          <description>TWAIFD interrupt enable register.</description>
          <addressOffset>0xfe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_OVERFLOW_INT_ENA</name>
              <description>The enable signal for read_done interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_INT_CLR</name>
          <description>TWAIFD interrupt clear register.</description>
          <addressOffset>0xfe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_OVERFLOW_INT_CLR</name>
              <description>The clear signal for read_done interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_CFG</name>
          <description>TWAI FD timer configure register.</description>
          <addressOffset>0xfe8</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>TIMER_CE</name>
              <description>TWAI FD timer enable register.
1b0: Not enable
1b1: Enable timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_CLR</name>
              <description>TWAI FD timer clear register.
1b0: Not enable
1b1: Enable to clear value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_SET</name>
              <description>TWAI FD timer set register.
1b0: Not enable
1b1: Enable to set value to ld_val.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_UP_DN</name>
              <description>TWAI FD timer up/down count register.
1b0: Count-down
1b1: Count-up</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_STEP</name>
              <description>TWAI FD timer count step register, step=reg_timer_step+1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_LD_VAL_L</name>
          <description>TWAI FD timer pre-load value low register.</description>
          <addressOffset>0xfec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_LD_VAL_L</name>
              <description>TWAI FD timer count pre-load value register, low part.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_LD_VAL_H</name>
          <description>TWAI FD timer pre-load value high register.</description>
          <addressOffset>0xff0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_LD_VAL_H</name>
              <description>TWAI FD timer pre-load value register, high part.
If timestamp valid bit-width less than 33, this field is ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_CT_VAL_L</name>
          <description>TWAI FD timer count-to value low register.</description>
          <addressOffset>0xff4</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>TIMER_CT_VAL_L</name>
              <description>TWAI FD timer count-to value register, low part.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_CT_VAL_H</name>
          <description>TWAI FD timer count-to value high register.</description>
          <addressOffset>0xff8</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>TIMER_CT_VAL_H</name>
              <description>TWAI FD timer count-to value register, high part.
If timestamp valid bit-width less than 33, this field is ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE_VER</name>
          <description>TWAI FD date version</description>
          <addressOffset>0xffc</addressOffset>
          <size>32</size>
          <resetValue>0x2412270</resetValue>
          <fields>
            <field>
              <name>DATE_VER</name>
              <description>TWAI FD version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
