esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>SLEEP_CONF2</name>
          <description>UART sleep configuration register 2</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x1404f0</resetValue>
          <fields>
            <field>
              <name>ACTIVE_THRESHOLD</name>
              <description>Configures the number of RXD edge changes to wake up the chip in wakeup mode 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_WAKE_UP_THRHD</name>
              <description>Configures the number of received data bytes to wake up the chip in wakeup mode 1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WK_CHAR_NUM</name>
              <description>Configures the number of wakeup characters.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WK_CHAR_MASK</name>
              <description>Configures whether or not to mask wakeup characters.\\
0: Not mask\\
1: Mask\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WK_MODE_SEL</name>
              <description>Configures which wakeup mode to select.\\
0: Mode 0\\
1: Mode 1\\
2: Mode 2\\
3: Mode 3\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWFC_CONF0_SYNC</name>
          <description>Software flow control character configuration</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x1311</resetValue>
          <fields>
            <field>
              <name>XON_CHAR</name>
              <description>Configures the XON character for flow control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XOFF_CHAR</name>
              <description>Configures the XOFF character for flow control.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XON_XOFF_STILL_SEND</name>
              <description>Configures whether the UART transmitter can send XON or XOFF characters when it is disabled.\\
0: Cannot send\\
1: Can send\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_FLOW_CON_EN</name>
              <description>Configures whether or not to enable software flow control.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XONOFF_DEL</name>
              <description>Configures whether or not to remove flow control characters from the received data.\\
0: Not move\\
1: Move\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_XON</name>
              <description>Configures whether the transmitter continues to sending data.\\
0: Not send\\
1: Send\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_XOFF</name>
              <description>Configures whether or not to stop the transmitter from sending data.\\
0: Not stop\\
1: Stop\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEND_XON</name>
              <description>Configures whether or not to send XON characters.\\
0: Not send\\
1: Send\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEND_XOFF</name>
              <description>Configures whether or not to send XOFF characters.\\
0: Not send\\
1: Send\\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWFC_CONF1</name>
          <description>Software flow control character configuration</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0xe000</resetValue>
          <fields>
            <field>
              <name>XON_THRESHOLD</name>
              <description>Configures the threshold for data in RX FIFO to send XON characters in software flow control.\\Measurement unit: byte.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XOFF_THRESHOLD</name>
              <description>Configures the threshold for data in RX FIFO to send XOFF characters in software flow control.\\Measurement unit: byte.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBRK_CONF_SYNC</name>
          <description>TX break character configuration</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0xa</resetValue>
          <fields>
            <field>
              <name>TX_BRK_NUM</name>
              <description>Configures the number of NULL characters to be sent after finishing data transmission.\\Valid only when UART_TXD_BRK is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDLE_CONF_SYNC</name>
          <description>Frame end idle time configuration</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x40100</resetValue>
          <fields>
            <field>
              <name>RX_IDLE_THRHD</name>
              <description>Configures the threshold to generate a frame end signal when the receiver takes more time to receive one data byte data.\\Measurement unit: bit time (the time to transmit 1 bit).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_IDLE_NUM</name>
              <description>Configures the interval between two data transfers.\\Measurement unit: bit time (the time to transmit 1 bit).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RS485_CONF_SYNC</name>
          <description>RS485 mode configuration</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RS485_EN</name>
              <description>Configures whether or not to enable RS485 mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DL0_EN</name>
              <description>Configures whether or not to add a turnaround delay of 1 bit before the start bit.\\
0: Not add\\
1: Add\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DL1_EN</name>
              <description>Configures whether or not to add a turnaround delay of 1 bit after the stop bit.\\
0: Not add\\
1: Add\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RS485TX_RX_EN</name>
              <description>Configures whether or not to enable the receiver for data reception when the transmitter is transmitting data in RS485 mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RS485RXBY_TX_EN</name>
              <description>Configures whether to enable the RS485 transmitter for data transmission when the RS485 receiver is busy.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RS485_RX_DLY_NUM</name>
              <description>Configures the delay of internal data signals in the receiver.\\Measurement unit: bit time (the time to transmit 1 bit)..</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RS485_TX_DLY_NUM</name>
              <description>Configures the delay of internal data signals in the transmitter.\\Measurement unit: bit time (the time to transmit 1 bit).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AT_CMD_PRECNT_SYNC</name>
          <description>Pre-sequence timing configuration</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x901</resetValue>
          <fields>
            <field>
              <name>PRE_IDLE_NUM</name>
              <description>Configures the idle time before the receiver receives the first AT_CMD.\\Measurement unit: bit time (the time to transmit 1 bit).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AT_CMD_POSTCNT_SYNC</name>
          <description>Post-sequence timing configuration</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x901</resetValue>
          <fields>
            <field>
              <name>POST_IDLE_NUM</name>
              <description>Configures the interval between the last AT_CMD and subsequent data.\\Measurement unit: bit time (the time to transmit 1 bit).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AT_CMD_GAPTOUT_SYNC</name>
          <description>Timeout configuration</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0xb</resetValue>
          <fields>
            <field>
              <name>RX_GAP_TOUT</name>
              <description>Configures the interval between two AT_CMD characters.\\Measurement unit: bit time (the time to transmit 1 bit).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AT_CMD_CHAR_SYNC</name>
          <description>AT escape sequence detection configuration</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0x32b</resetValue>
          <fields>
            <field>
              <name>AT_CMD_CHAR</name>
              <description>Configures the AT_CMD character.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHAR_NUM</name>
              <description>Configures the number of continuous AT_CMD characters a receiver can receive.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_CONF</name>
          <description>UART memory power configuration</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_FORCE_PD</name>
              <description>Set this bit to force power down UART memory.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_FORCE_PU</name>
              <description>Set this bit to force power up UART memory.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOUT_CONF_SYNC</name>
          <description>UART threshold and allocation configuration</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x28</resetValue>
          <fields>
            <field>
              <name>RX_TOUT_EN</name>
              <description>Configures whether or not to enable UART receiver's timeout function.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TOUT_FLOW_DIS</name>
              <description>Set this bit to stop accumulating idle_cnt when hardware flow control works.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TOUT_THRHD</name>
              <description>Configures the amount of time that the bus can remain idle before timeout.\\ Measurement unit: bit time (the time to transmit 1 bit).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_TX_STATUS</name>
          <description>TX FIFO write and read offset address</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_SRAM_WADDR</name>
              <description>Represents the offset address to write TX FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_SRAM_RADDR</name>
              <description>Represents the offset address to read TX FIFO.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_RX_STATUS</name>
          <description>Rx FIFO write and read offset address</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x10080</resetValue>
          <fields>
            <field>
              <name>RX_SRAM_RADDR</name>
              <description>Represents the offset address to read RX FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_SRAM_WADDR</name>
              <description>Represents the offset address to write RX FIFO.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_STATUS</name>
          <description>UART transmit and receive status</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ST_URX_OUT</name>
              <description>Represents the status of the receiver.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_UTX_OUT</name>
              <description>Represents the status of the transmitter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POSPULSE</name>
          <description>Autobaud high pulse register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0xfff</resetValue>
          <fields>
            <field>
              <name>POSEDGE_MIN_CNT</name>
              <description>Represents the minimal input clock counter value between two positive edges. It is used for baud rate detection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NEGPULSE</name>
          <description>Autobaud low pulse register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0xfff</resetValue>
          <fields>
            <field>
              <name>NEGEDGE_MIN_CNT</name>
              <description>Represents the minimal input clock counter value between two negative edges. It is used for baud rate detection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOWPULSE</name>
          <description>Autobaud minimum low pulse duration register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0xfff</resetValue>
          <fields>
            <field>
              <name>MIN_CNT</name>
              <description>Represents the minimum duration time of a low-level pulse. It is used for baud rate detection.\\Measurement unit: APB_CLK clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGHPULSE</name>
          <description>Autobaud minimum high pulse duration register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0xfff</resetValue>
          <fields>
            <field>
              <name>MIN_CNT</name>
              <description>Represents  the maximum duration time for a high-level pulse. It is used for baud rate detection.\\Measurement unit: APB_CLK clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXD_CNT</name>
          <description>Autobaud edge change count register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXD_EDGE_CNT</name>
              <description>Represents the number of RXD edge changes. It is used for baud rate detection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_CONF</name>
          <description>UART core clock configuration</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x3000000</resetValue>
          <fields>
            <field>
              <name>TX_SCLK_EN</name>
              <description>Configures whether or not to enable UART TX clock.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_SCLK_EN</name>
              <description>Configures whether or not to enable UART RX clock.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_RST_CORE</name>
              <description>Write 1 and then write 0 to reset UART TX.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_RST_CORE</name>
              <description>Write 1 and then write 0 to reset UART RX.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>UART version control register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x2312220</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
