esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>AFIFO_STATUS</name>
          <description>UART asynchronous FIFO status</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0xa</resetValue>
          <fields>
            <field>
              <name>TX_AFIFO_FULL</name>
              <description>Represents whether or not the APB TX asynchronous FIFO is full.\\
0: Not full\\
1: Full\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_AFIFO_EMPTY</name>
              <description>Represents whether or not the APB TX asynchronous FIFO is empty.\\
0: Not empty\\
1: Empty\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_AFIFO_FULL</name>
              <description>Represents whether or not the APB RX asynchronous FIFO is full.\\
0: Not full\\
1: Full\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_AFIFO_EMPTY</name>
              <description>Represents whether or not the APB RX asynchronous FIFO is empty.\\
0: Not empty\\
1: Empty\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_UPDATE</name>
          <description>UART register configuration update</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_UPDATE</name>
              <description>Configures whether or not to synchronize registers.\\
0: Not synchronize\\
1: Synchronize\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID</name>
          <description>UART ID register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x500</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Configures the UART ID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <baseAddress>0x2038b000</baseAddress>
      <description>UART (Universal Asynchronous Receiver-Transmitter) Controller 1</description>
      <interrupt>
        <name>UART1</name>
        <value>10</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART2</name>
      <baseAddress>0x2038c000</baseAddress>
      <description>UART (Universal Asynchronous Receiver-Transmitter) Controller 2</description>
      <interrupt>
        <name>UART2</name>
        <value>11</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART3</name>
      <baseAddress>0x2038d000</baseAddress>
      <description>UART (Universal Asynchronous Receiver-Transmitter) Controller 3</description>
      <interrupt>
        <name>UART3</name>
        <value>12</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>UHCI0</name>
      <description>Universal Host Controller Interface 0</description>
      <groupName>UHCI</groupName>
      <baseAddress>0x20398000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x84</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>UHCI0</name>
        <value>8</value>
      </interrupt>
      <registers>
        <register>
          <name>CONF0</name>
          <description>UHCI configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x6fc</resetValue>
          <fields>
            <field>
              <name>TX_RST</name>
              <description>Write 1 and then write 0 to reset the decoder state machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_RST</name>
              <description>Write 1 and then write 0 to reset the encoder state machine.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_SEL</name>
              <description>Configures to select which uart to connect with UHCI.\\
0: UART0\\
1: UART1\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEPER_EN</name>
              <description>Configures whether or not to separate the data frame with a special character.\\
0: Not separate\\
1: Separate\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HEAD_EN</name>
              <description>Configures whether or not to encode the data packet with a formatting header.\\
0: Not use formatting header\\
1: Use formatting header\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_REC_EN</name>
              <description>Configures whether or not to enable the reception of the 16-bit CRC.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IDLE_EOF_EN</name>
              <description>Configures whether or not to stop receiving data when UART is idle.\\
0: Not stop\\
1: Stop\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEN_EOF_EN</name>
              <description>Configures when the UHCI decoder stops receiving data.\\
0: Stops after receiving 0xC0\\
1: Stops when the number of received data bytes reach the specified value. When UHCI_HEAD_EN is 1, the specified value is the data length indicated by the UHCI packet header. when UHCI_HEAD_EN is 0, the specified value is the configured value.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENCODE_CRC_EN</name>
              <description>Configures whether or not to enable data integrity check by appending a 16 bit CCITT-CRC to the end of the data.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Configures clock gating.\\
0: Support clock only when the application writes registers.\\
1: Always force the clock on for registers.\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_RX_BRK_EOF_EN</name>
              <description>Configures whether or not to stop UHCI from receiving data after UART has received a NULL frame.\\
0: Not stop\\
1: Stop\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_START_INT_RAW</name>
              <description>The raw interrupt status of UHCI_RX_START_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_START_INT_RAW</name>
              <description>The raw interrupt status of UHCI_TX_START_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_HUNG_INT_RAW</name>
              <description>The raw interrupt status of UHCI_RX_HUNG_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_HUNG_INT_RAW</name>
              <description>The raw interrupt status of UHCI_TX_HUNG_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEND_S_REG_Q_INT_RAW</name>
              <description>The raw interrupt status of UHCI_SEND_S_REG_Q_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEND_A_REG_Q_INT_RAW</name>
              <description>The raw interrupt status of UHCI_SEND_A_REG_Q_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_INT_RAW</name>
              <description>The raw interrupt status of UHCI_OUT_EOF_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CTRL0_INT_RAW</name>
              <description>The raw interrupt status of UHCI_APP_CTRL0_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CTRL1_INT_RAW</name>
              <description>The raw interrupt status of UHCI_APP_CTRL1_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Masked interrupt status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_START_INT_ST</name>
              <description>The masked interrupt status of UHCI_RX_START_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_START_INT_ST</name>
              <description>The masked interrupt status of UHCI_TX_START_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_HUNG_INT_ST</name>
              <description>The masked interrupt status of UHCI_RX_HUNG_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_HUNG_INT_ST</name>
              <description>The masked interrupt status of UHCI_TX_HUNG_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEND_S_REG_Q_INT_ST</name>
              <description>The masked interrupt status of UHCI_SEND_S_REG_Q_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEND_A_REG_Q_INT_ST</name>
              <description>The masked interrupt status of UHCI_SEND_A_REG_Q_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTLINK_EOF_ERR_INT_ST</name>
              <description>The masked interrupt status of UHCI_OUTLINK_EOF_ERR_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_CTRL0_INT_ST</name>
              <description>The masked interrupt status of UHCI_APP_CTRL0_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_CTRL1_INT_ST</name>
              <description>The masked interrupt status of UHCI_APP_CTRL1_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_START_INT_ENA</name>
              <description>Write 1 to enable UHCI_RX_START_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_START_INT_ENA</name>
              <description>Write 1 to enable UHCI_TX_START_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_HUNG_INT_ENA</name>
              <description>Write 1 to enable UHCI_RX_HUNG_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_HUNG_INT_ENA</name>
              <description>Write 1 to enable UHCI_TX_HUNG_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEND_S_REG_Q_INT_ENA</name>
              <description>Write 1 to enable UHCI_SEND_S_REG_Q_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEND_A_REG_Q_INT_ENA</name>
              <description>Write 1 to enable UHCI_SEND_A_REG_Q_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTLINK_EOF_ERR_INT_ENA</name>
              <description>Write 1 to enable UHCI_OUTLINK_EOF_ERR_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CTRL0_INT_ENA</name>
              <description>Write 1 to enable UHCI_APP_CTRL0_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CTRL1_INT_ENA</name>
              <description>Write 1 to enable UHCI_APP_CTRL1_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_START_INT_CLR</name>
              <description>Write 1 to clear UHCI_RX_START_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_START_INT_CLR</name>
              <description>Write 1 to clear UHCI_TX_START_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_HUNG_INT_CLR</name>
              <description>Write 1 to clear UHCI_RX_HUNG_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_HUNG_INT_CLR</name>
              <description>Write 1 to clear UHCI_TX_HUNG_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEND_S_REG_Q_INT_CLR</name>
              <description>Write 1 to clear UHCI_SEND_S_REG_Q_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEND_A_REG_Q_INT_CLR</name>
              <description>Write 1 to clear UHCI_SEND_A_REG_Q_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_EOF_ERR_INT_CLR</name>
              <description>Write 1 to clear UHCI_OUTLINK_EOF_ERR_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APP_CTRL0_INT_CLR</name>
              <description>Write 1 to clear UHCI_APP_CTRL0_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APP_CTRL1_INT_CLR</name>
              <description>Write 1 to clear UHCI_APP_CTRL1_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF1</name>
          <description>UHCI configuration register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x33</resetValue>
          <fields>
            <field>
              <name>CHECK_SUM_EN</name>
              <description>Configures whether or not to enable header checksum validation when UHCI receives a data packet.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHECK_SEQ_EN</name>
              <description>Configures whether or not to enable the sequence number check when UHCI receives a data packet.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_DISABLE</name>
              <description>Configures whether or not to enable CRC calculation.\\
0: Disable\\
1: Enable\\
Valid only when the Data Integrity Check Present bit in UHCI packet is 1.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAVE_HEAD</name>
              <description>Configures whether or not to save the packet header when UHCI receives a data packet.\\
0: Not save\\
1: Save\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CHECK_SUM_RE</name>
              <description>Configures whether or not to encode the data packet with a checksum.\\
0: Not use checksum\\
1: Use checksum\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ACK_NUM_RE</name>
              <description>Configures whether or not to encode the data packet with an acknowledgment when a reliable packet is to be transmitted.\\
0: Not use acknowledgement\\
1: Use acknowledgement\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT_SW_START</name>
              <description>Configures whether or not to put the UHCI encoder state machine to ST_SW_WAIT state.\\
0: No\\
1: Yes\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_START</name>
              <description>Write 1 to send data packets when the encoder state machine is in ST_SW_WAIT state.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
