esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>DATE</name>
          <description>UHCI version  control register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x2201100</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USB_OTG_HS</name>
      <description>USB_OTG_HS Peripheral</description>
      <groupName>USB_OTGHS</groupName>
      <baseAddress>0x20300000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x5d0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USB_OTG_HS</name>
        <value>99</value>
      </interrupt>
      <interrupt>
        <name>USB_OTG_HS_ENDP_MULTI_PROC</name>
        <value>100</value>
      </interrupt>
      <registers>
        <register>
          <name>GOTGCTL</name>
          <description>The OTG Control and Status register controls the behavior and reflects the status of the OTG function of the controller.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0xd0000</resetValue>
          <fields>
            <field>
              <name>VBVALIDOVEN</name>
              <description>Mode: Host only
VBUS Valid Override Enable (VbvalidOvEn)
This bit is used to enable/disable the software to override the Bvalid signal using the GOTGCTL.VbvalidOvVal.
 - 1'b1 : Internally Bvalid received from the PHY is overridden with GOTGCTL.VbvalidOvVal.
 - 1'b0 : Override is disabled and bvalid signal from the respective PHY selected is used internally by the controller.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBVALIDOVVAL</name>
              <description>Mode: Host only
VBUS Valid OverrideValue (VbvalidOvVal)
This bit is used to set Override value for vbusvalid signal when GOTGCTL.VbvalidOvEn is set.
 - 1'b0 : vbusvalid value is 1'b0 when GOTGCTL.VbvalidOvEn =1
 - 1'b1 : vbusvalid value is 1'b1 when GOTGCTL.VbvalidOvEn =1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVALIDOVEN</name>
              <description>Mode: Host only
A-Peripheral Session Valid Override Enable (AvalidOvEn)
This bit is used to enable/disable the software to override the Avalid signal using the GOTGCTL.AvalidOvVal.
 - 1'b1: Internally Avalid received from the PHY is overridden with GOTGCTL.AvalidOvVal.
 - 1'b0: Override is disabled and avalid signal from the respective PHY selected is used internally by the core</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVALIDOVVAL</name>
              <description>Mode: Host only
A-Peripheral Session Valid OverrideValue (AvalidOvVal)
This bit is used to set Override value for Avalid signal when GOTGCTL.AvalidOvEn is set.
 - 1'b0 : Avalid value is 1'b0 when GOTGCTL.AvalidOvEn =1
 - 1'b1 : Avalid value is 1'b1 when GOTGCTL.AvalidOvEn =1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BVALIDOVEN</name>
              <description>Mode: Device only
B-Peripheral Session Valid Override Value (BvalidOvEn)
This bit is used to enable/disable the software to override the Bvalid signal using the GOTGCTL.BvalidOvVal.
 - 1'b1 : Internally Bvalid received from the PHY is overridden with GOTGCTL.BvalidOvVal.
 - 1'b0 : Override is disabled and bvalid signal from the respective PHY selected is used internally by the force</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BVALIDOVVAL</name>
              <description>Mode: Device only
B-Peripheral Session Valid OverrideValue (BvalidOvVal)
This bit is used to set Override value for Bvalid signal when GOTGCTL.BvalidOvEn is set.
 - 1'b0 : Bvalid value is 1'b0 when GOTGCTL.BvalidOvEn =1
 - 1'b1 : Bvalid value is 1'b1 when GOTGCTL.BvalidOvEn =1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBNCEFLTRBYPASS</name>
              <description>Mode: Host and Device
Debounce Filter Bypass
Bypass Debounce filters for avalid, bvalid, vbusvalid, sessend, iddig signals when enabled.
 - 1'b0: Disabled
 - 1'b1: Enabled


Note:  This register bit is valid only when debounce filters are present in core.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONIDSTS</name>
              <description>Mode: Host and Device
Connector ID Status (ConIDSts)
Indicates the connector ID status on a connect event.
 - 1'b0: The core is in A-Device mode.
 - 1'b1: The core is in B-Device mode.

 Note:
 The reset value of this register field can be read only after the PHY clock is stable, or if IDDIG_FILTER is enabled, wait for the filter timer to expire to read the correct reset value which ever event is later.
 Reset:
  - 1'b0: in host only mode (OTG_MODE = 5 or 6)
  - 1'b1: in all other configurations</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DBNCTIME</name>
              <description>Mode: Host only
Long/Short Debounce Time (DbncTime)
Indicates the debounce time of a detected connection.
 - 1'b0: Long debounce time, used for physical connections (100 ms + 2.5 micro-sec)
 - 1'b1: Short debounce time, used for soft connections (2.5 micro-sec)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ASESVLD</name>
              <description>Mode: Host only
A-Session Valid (ASesVld)
Indicates the Host mode transceiver status.
 - 1'b0: A-session is not valid
 - 1'b1: A-session is valid
Note: If you do not enabled OTG features (such as SRP and HNP), the read reset value will be 1. The vbus assigns the values internally for non-SRP or non-HNP configurations.
In case of OTG_MODE=0, the reset value of this bit is 1'b0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BSESVLD</name>
              <description>Mode: Device only
B-Session Valid (BSesVld)
Indicates the Device mode transceiver status.
 - 1'b0: B-session is not valid.
 - 1'b1: B-session is valid.
In OTG mode, you can use this bit to determine if the device is connected or disconnected.

