esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
Note:
 - If you do not enable OTG features (such as SRP and HNP), the read reset value will be 1.The vbus assigns the values internally for non- SRP or non-HNP configurations.
 - In case of OTG_MODE=0, the reset value of this bit is 1'b0.
 - The reset value of this register field can be read only after the PHY clock is stable, or if IDDIG_FILTER is enabled, wait for the filter timer to expire to read the correct reset value which ever event is later.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTGVER</name>
              <description>OTG Version (OTGVer)
Indicates the OTG revision.
 - 1'b0: OTG Version 1.3. In this version the core supports Data line pulsing and VBus pulsing for SRP.
 - 1'b1: OTG Version 2.0. In this version the core supports only Data line pulsing for SRP.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CURMOD</name>
              <description>Current Mode of Operation (CurMod)
Mode: Host and Device
Indicates the current mode.
 - 1'b0: Device mode
 - 1'b1: Host mode
 Reset:
 - 1'b1 in Host-only mode (OTG_MODE=5 or 6)
 - 1'b0 in all other configurations
Note: The reset value of this register field can be read only after the PHY clock is stable, or if IDDIG_FILTER is enabled, wait for the filter timer to expire to read the correct reset value which ever event is later.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULTVALIDBC</name>
              <description>Mode: Host and Device
Multi Valued ID pin (MultValIdBC)
Battery Charger ACA inputs in the following order:
 - Bit 26: rid_float.
 - Bit 25: rid_gnd
 - Bit 24: rid_a
 - Bit 23: rid_b
 - Bit 22: rid_c</description>
              <bitOffset>22</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHIRPEN</name>
              <description>Mode: Device Only
This bit when programmed to 1'b1 results in the core asserting chirp_on before sending an actual Chirp K signal on USB. This bit is present only if OTG_BC_SUPPORT = 1.If OTG_BC_SUPPORT!=1, this bit is a reserved bit. Do not set this bit when core is operating in HSIC mode because HSIC always operates at High Speed and High speed chirp is not used</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GOTGINT</name>
          <description>The application reads this register whenever there is an OTG interrupt and clears the bits in this register to clear the OTG interrupt.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SESENDDET</name>
              <description>Mode: Host and Device
Session End Detected (SesEndDet)
The controller sets this bit when the utmiotg_bvalid signal is deasserted. This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SESREQSUCSTSCHNG</name>
              <description>Mode: Host and Device
Session Request Success Status Change (SesReqSucStsChng)
The core sets this bit on the success or failure of a session request. The application must read the Session Request Success bit in the OTG Control and Status register (GOTGCTL.SesReqScs) to check for success or failure. This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSTNEGSUCSTSCHNG</name>
              <description>Mode: Host and Device
Host Negotiation Success Status Change (HstNegSucStsChng)
The core sets this bit on the success or failure of a USB host negotiation request. The application must read the Host Negotiation Success bit of the OTG Control and Status register (GOTGCTL.HstNegScs) to check for success or failure. This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSTNEGDET</name>
              <description>Mode:Host and Device
Host Negotiation Detected (HstNegDet)
The core sets this bit when it detects a host negotiation request on the USB. This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADEVTOUTCHG</name>
              <description>Mode: Host and Device
A-Device Timeout Change (ADevTOUTChg)
The core sets this bit to indicate that the A-device has timed out while waiting for the B-device to connect.This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBNCEDONE</name>
              <description>Mode: Host only
Debounce Done (DbnceDone)
The core sets this bit when the debounce is completed after the device connect. The application can start driving USB reset after seeing this interrupt. This bit is only valid when the HNP Capable or SRP Capable bit is SET in the Core USB Configuration register (GUSBCFG.HNPCap or GUSBCFG.SRPCap, respectively). This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULTVALIPCHNG</name>
              <description>This bit when set indicates that there is a change in the value of at least one ACA pin value.
This bit is present only if OTG_BC_SUPPORT=1, otherwise it is reserved.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAHBCFG</name>
          <description>This register can be used to configure the core after power-on or a change in mode. This register mainly contains AHB system-related configuration parameters. Do not change this register after the initial programming. The application must program this register before starting any transactions on either the AHB or the USB.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GLBLINTRMSK</name>
              <description>Mode: Host and device
Global Interrupt Mask (GlblIntrMsk)
The application uses this bit to mask or unmask the interrupt line assertion to itself. Irrespective of this bit's setting, the interrupt status registers are updated by the controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HBSTLEN</name>
              <description>Mode: Host and device
Burst Length/Type (HBstLen)
This field is used in both External and Internal DMA modes. In External DMA mode, these bits appear on dma_burst[3:0] ports, which can be used by an external wrapper to interface the External DMA Controller interface to Synopsys DW_ahb_dmac or ARM PrimeCell.
External DMA Mode defines the DMA burst length in terms of 32-bit words:
 - 4'b0000: 1 word
 - 4'b0001: 4 words
 - 4'b0010: 8 words
 - 4'b0011: 16 words
 - 4'b0100: 32 words
 - 4'b0101: 64 words
 - 4'b0110: 128 words
 - 4'b0111: 256 words
 - Others: Reserved
Internal DMA Mode AHB Master burst type:
 - 4'b0000 Single
 - 4'b0001 INCR
 - 4'b0011 INCR4
 - 4'b0101 INCR8
 - 4'b0111 INCR16
 - Others: Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>Mode: Host and device
DMA Enable (DMAEn)

This bit is always 0 when Slave-Only mode has been selected.

Reset: 1'b0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NPTXFEMPLVL</name>
              <description>Mode: Host and device
Non-Periodic TxFIFO Empty Level (NPTxFEmpLvl)
This bit is used only in Slave mode. In host mode and with Shared FIFO with device mode, this bit indicates when the Non-Periodic TxFIFO Empty Interrupt bit in the Core Interrupt register (GINTSTS.NPTxFEmp) is triggered.
With dedicated FIFO in device mode, this bit indicates when IN endpoint Transmit FIFO empty interrupt (DIEPINTn.TxFEmp) is triggered.
Host mode and with Shared FIFO with device mode:
 - 1'b0: GINTSTS.NPTxFEmp interrupt indicates that the Non-Periodic TxFIFO is half empty
 - 1'b1: GINTSTS.NPTxFEmp interrupt indicates that the Non-Periodic TxFIFO is completely empty
Dedicated FIFO in device mode:
 - 1'b0: DIEPINTn.TxFEmp interrupt indicates that the IN Endpoint TxFIFO is half empty
 - 1'b1: DIEPINTn.TxFEmp interrupt indicates that the IN Endpoint TxFIFO is completely empty</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTXFEMPLVL</name>
              <description>Mode: Host only
Periodic TxFIFO Empty Level (PTxFEmpLvl)
Indicates when the Periodic TxFIFO Empty Interrupt bit in the Core Interrupt register (GINTSTS.PTxFEmp) is triggered. This bit is used only in Slave mode.
 - 1'b0: GINTSTS.PTxFEmp interrupt indicates that the Periodic TxFIFO is half empty
 - 1'b1: GINTSTS.PTxFEmp interrupt indicates that the Periodic TxFIFO is completely empty</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REMMEMSUPP</name>
              <description>Mode: Host and Device
Remote Memory Support (RemMemSupp)
This bit is programmed to enable the functionality to wait for the system DMA Done Signal for the DMA Write Transfers.
 - GAHBCFG.RemMemSupp=1
The int_dma_req output signal is asserted when the DMA starts write transfer to the external memory. When the core is done with the Transfers it asserts int_dma_done signal to flag the completion of DMA writes from the controller. The core then waits for sys_dma_done signal from the system to proceed further and complete the Data Transfer corresponding to a particular Channel/Endpoint.
 - GAHBCFG.RemMemSupp=0
The int_dma_req and int_dma_done signals are not asserted and the core proceeds with the assertion of the XferComp interrupt as soon as the DMA write transfer is done at the Core Boundary and it does not wait for the sys_dma_done signal to complete the DATA transfers.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOTIALLDMAWRIT</name>
              <description>Mode: Host and Device
Notify All DMA Write Transactions (NotiAllDmaWrit)
This bit is programmed to enable the System DMA Done functionality for all the DMA write Transactions corresponding to the Channel/Endpoint. This bit is valid only when GAHBCFG.RemMemSupp is set to 1.
 - GAHBCFG.NotiAllDmaWrit = 1
The core asserts int_dma_req for all the DMA write transactions on the AHB interface along with int_dma_done, chep_last_transact and chep_number signal informations. The core waits for sys_dma_done signal for all the DMA write transactions in order to complete the transfer of a particular Channel/Endpoint.
 - GAHBCFG.NotiAllDmaWrit = 0
The core asserts int_dma_req signal only for the last transaction of DMA write transfer corresponding to a particular Channel/Endpoint. Similarly, the core waits for sys_dma_done signal only for that transaction of DMA write to complete the transfer of a particular Channel/Endpoint.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBSINGLE</name>
              <description>Mode: Host and Device
AHB Single Support (AHBSingle)
This bit when programmed supports Single transfers for the remaining data in a transfer when the core is operating in DMA mode.
 - 1'b0: The remaining data in the transfer is sent using INCR burst size.
 - 1'b1: The remaining data in the transfer is sent using Single burst size.
Note: If this feature is enabled, the AHB RETRY and SPLIT transfers still have INCR burst type. Enable this feature when the AHB Slave connected to the core does not support INCR burst (and when Split, and Retry transactions are not being used in the bus).</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVDESCENDIANESS</name>
              <description>Mode: Host and Device
Invert Descriptor Endianess (InvDescEndianess)
 - 1'b0: Descriptor Endianness is same as AHB Master Endianness.
 - 1'b1:
 -- If the AHB Master endianness is Big Endian, the Descriptor Endianness is Little Endian.
 -- If the AHB Master endianness is Little Endian, the Descriptor Endianness is Big Endian.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GUSBCFG</name>
          <description>This register can be used to configure the core after power-on or when changing to Host mode or Device mode. It contains USB and USB-PHY related configuration parameters. The application must program this register before starting any transactions on either the AHB or the USB. If you are using the HSIC interface, HSIC PHY must be in reset while programming this register. Do not make changes to this register after the initial programming.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x10001400</resetValue>
          <fields>
            <field>
              <name>TOUTCAL</name>
              <description>Mode: Host and Device
HS/FS Timeout Calibration (TOutCal)

The number of PHY clocks that the application programs in this field is added to the high-speed/full-speed interpacket timeout duration in the core to account for any additional delays introduced by the PHY. This can be required, because the delay introduced by the PHY in generating the linestate condition can vary from one PHY to another.

The USB standard timeout value for high-speed operation is 736 to 816 (inclusive) bit times. The USB standard timeout value for full-speed operation is 16 to 18 (inclusive) bit times. The application must program this field based on the speed of enumeration. The number of bit times added per PHY clock are as follows:

High-speed operation:
 - One 30-MHz PHY clock = 16 bit times
 - One 60-MHz PHY clock = 8 bit times
Full-speed operation:
 - One 30-MHz PHY clock = 0.4 bit times
 - One 60-MHz PHY clock = 0.2 bit times
 - One 48-MHz PHY clock = 0.25 bit times</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYIF</name>
              <description>Mode: Host and Device
PHY Interface (PHYIf)
The application uses this bit to configure the core to support a UTMI+ PHY with an 8- or 16-bit interface. When a ULPI PHY is chosen, this must be Set to 8-bit mode.
 - 1'b0: 8 bits
 - 1'b1: 16 bits
This bit is writable only If UTMI+ and ULPI were selected. Otherwise, this bit returns the value for the power-on interface selected during configuration.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULPI_UTMI_SEL</name>
              <description>Mode: Host and Device
ULPI or UTMI+ Select (ULPI_UTMI_Sel)

The application uses this bit to select either a UTMI+ interface or ULPI Interface.
 - 1'b0: UTMI+ Interface
 - 1'b1: ULPI Interface</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSINTF</name>
              <description>Mode: Host and Device
Full-Speed Serial Interface Select (FSIntf)

