esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
The application uses this bit to select either a unidirectional or bidirectional USB 1.1 full-speed serial transceiver interface.
 - 1'b0: 6-pin unidirectional full-speed serial interface
 - 1'b1: 3-pin bidirectional full-speed serial interface
If a USB 1.1 Full-Speed Serial Transceiver interface was not selected, this bit is always 0, with Write Only access. If a USB 1.1 FS interface was selected, Then the application can Set this bit to select between the 3- and 6-pin interfaces, and access is Read and Write.

Note: For supporting the new 4-pin bi-directional interface, you need to select 6-pin unidirectional FS serial mode, and add an external control to convert it to a 4-pin interface.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYSEL</name>
              <description>PHYSel

Mode: Host and Device

USB 2.0 High-Speed PHY or USB 1.1 Full-Speed Serial Transceiver Select (PHYSel)
The application uses this bit to select either a high-speed UTMI+ or ULPI PHY, or a full-speed transceiver.
 - 1'b0: USB 2.0 high-speed UTMI+ or ULPI PHY
 - 1'b1: USB 1.1 full-speed serial transceiver
If a USB 1.1 Full-Speed Serial Transceiver interface was not selected in, this bit is always 0, with Write Only access.
If a high-speed PHY interface was not selected in, this bit is always 1, with Write Only access.
If both interface types were selected (parameters have non-zero values), the application uses this bit to select which interface is active, and access is Read and Write.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DDRSEL</name>
              <description>Mode: Host and Device
ULPI DDR Select (DDRSel)
The application uses this bit to select a Single Data Rate (SDR) or Double Data Rate (DDR) or ULPI interface.
 - 1'b0: Single Data Rate ULPI Interface, with 8-bit-wide data bus
 - 1'b1: Double Data Rate ULPI Interface, with 4-bit-wide data bus</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTRDTIM</name>
              <description>Mode: Device only
USB Turnaround Time (USBTrdTim)
Sets the turnaround time in PHY clocks. Specifies the response time for a MAC request to the Packet FIFO Controller (PFC) to fetch data from the DFIFO (SPRAM). This must be programmed to
 - 4'h5 : When the MAC interface is 16-bit UTMI+
 - 4'h9 : When the MAC interface is 8-bit UTMI+
Note:Refer to Programming Guide Section Choosing the Value of GUSBCFG.USBTrdTim for the turnaround time calculation. During the AHB Clock Frequency selection, it is recommended to consider mis-sampling into account for USBTrdTim. USB turnaround time is critical for certification where long cables and 5-Hubs are used. If you need the AHB to run at less than 30 MHz (or less than 42MHz when operating in 16-bit UTMI mode in HS speed), and if USB turnaround time is not critical, these bits can be programmed to a larger value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYLPWRCLKSEL</name>
              <description>PHY Low-Power Clock Select (PhyLPwrClkSel)
Mode: Host and Device
Selects either 480-MHz or 48-MHz (low-power) PHY mode. In FS and LS modes, the PHY can usually operate on a 48-MHz clock to save power.
 - 1'b0: 480-MHz Internal PLL clock
 - 1'b1: 48-MHz External Clock
In 480 MHz mode, the UTMI interface operates at either 60 or 30-MHz, depending upon whether 8- or 16-bit data width is selected.
In 48-MHz mode, the UTMI interface operates at 48 MHz in FS mode and at either 48 or 6 MHz in LS mode (depending on the PHY vendor). This bit drives the utmi_fsls_low_power core output signal, and is valid only for UTMI+ PHYs.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULPIFSLS</name>
              <description>Mode: Host and Device
ULPI FS/LS Select (ULPIFsLs)
The application uses this bit to select the FS/LS serial interface for the ULPI PHY. This bit is valid only when the FS serial transceiver is selected on the ULPI PHY.
 - 1'b0: ULPI interface
 - 1'b1: ULPI FS/LS serial interface
Note: Before setting this bit, the application needs to ensure that GUSBCFG.ULPI_UTMI_SEL = 1'b1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULPIAUTORES</name>
              <description>Mode: Host and Device
ULPI Auto Resume (ULPIAutoRes)
This bit sets the AutoResume bit in the Interface Control register on the ULPI PHY.
 - 1'b0: PHY does not use AutoResume feature.
 - 1'b1: PHY uses AutoResume feature.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULPICLKSUSM</name>
              <description>Mode: Host and Device
ULPI Clock SuspendM (ULPIClkSusM)
This bit sets the ClockSuspendM bit in the Interface Control register on the ULPI PHY. This bit applies only in serial or carkit modes.
 - 1'b0: PHY powers down internal clock during suspend.
 - 1'b1: PHY does not power down internal clock.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULPIEXTVBUSDRV</name>
              <description>Mode: Host only
ULPI External VBUS Drive (ULPIExtVbusDrv)
This bit selects between internal or external supply to drive 5V on VBUS, in ULPI PHY.
 - 1'b0: PHY drives VBUS using internal charge pump (Default).
 - 1'b1: PHY drives VBUS using external supply.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULPIEXTVBUSINDICATOR</name>
              <description>Mode: Host only
ULPI External VBUS Indicator (ULPIExtVbusIndicator)
This bit indicates to the ULPI PHY to use an external VBUS overcurrent indicator.
 - 1'b0: PHY uses internal VBUS valid comparator.
 - 1'b1: PHY uses external VBUS valid comparator.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TERMSELDLPULSE</name>
              <description>Mode: Device only
TermSel DLine Pulsing Selection (TermSelDLPulse)
This bit selects utmi_termselect to drive data line pulse during SRP.
 - 1'b0: Data line pulsing using utmi_txvalid (Default).
 - 1'b1: Data line pulsing using utmi_termsel.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPLEMENT</name>
              <description>Mode: Host only
Indicator Complement Controls the PHY to invert the ExternalVbusIndicator input signal, generating the Complement Output. For more information, refer to the ULPI Specification.
 - 1'b0: PHY does not invert ExternalVbusIndicator signal
 - 1'b1: PHY does invert ExternalVbusIndicator signal
This bit is reserved and read-only when OTG_HSPHY_INTERFACE is set to 0 or 1.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDICATOR</name>
              <description>Mode: Host only
Indicator Pass Through
Controls wether the Complement Output is qualified with the Internal Vbus Valid comparator before being used in the Vbus State in the RX CMD. For more information, refer to the ULPI Specification.
 - 1'b0: Complement Output signal is qualified with the Internal VbusValid comparator.
 - 1'b1: Complement Output signal is not qualified with the Internal VbusValid comparator.
This bit is reserved and read-only when OTG_HSPHY_INTERFACE is set to 0 or 1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULPI</name>
              <description>Mode: Host only
ULPI Interface Protect Disable
Controls circuitry built into the PHY for protecting the ULPI interface when the link tri-states STP and data. Any pull-ups or pull-downs employed by this feature can be disabled. For more information, refer to the ULPI Specification.
 - 1'b0: Enables the interface protect circuit
 - 1'b1: Disables the interface protect circuit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC_USBCAP</name>
              <description>Mode: Host and Device
IC_USB-Capable (IC_USBCap)
The application uses this bit to control the core's IC_USB capabilities.
 - 1'b0: IC_USB PHY Interface is not selected.
 - 1'b1: IC_USB PHY Interface is selected.
This bit is writable only if OTG_ENABLE_IC_USB=1 and OTG_FSPHY_INTERFACE!=0.
The reset value depends on the configuration parameter OTG_SELECT_IC_USB when OTG_ENABLE_IC_USB = 1. In all other cases, this bit is set to 1'b0 and the bit is read only.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXENDDELAY</name>
              <description>Mode: Device only
Tx End Delay (TxEndDelay)
Setting this bit to 1'b1 enables the controller to follow the TxEndDelay timings as per UTMI+ specification 1.05 section 4.1.5 for opmode signal during remote wakeup.
 - 1'b0 : Normal Mode.
 - 1'b1 : Tx End delay.
The default value of this field is 1'b1 and it is not recommended to program it to 1'b0. The option to set it to 1'b0 (Normal Mode) is present only for debug purpose.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEHSTMODE</name>
              <description>Mode: Host and device
Force Host Mode (ForceHstMode)
Writing a 1 to this bit forces the core to host mode irrespective of utmiotg_iddig input pin.
 - 1'b0 : Normal Mode.
 - 1'b1 : Force Host Mode.
After setting the force bit, the application must wait at least 25 ms before the change to take effect. When the simulation is in scale down mode, waiting for 500 micro sec is sufficient. This bit is valid only when OTG_MODE = 0, 1 or 2. In all other cases, this bit reads 0.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEDEVMODE</name>
              <description>Mode:Host and device
Force Device Mode (ForceDevMode)
Writing a 1 to this bit forces the controller to device mode irrespective of utmiotg_iddig input pin.
 - 1'b0 : Normal Mode.
 - 1'b1 : Force Device Mode.
After setting the force bit, the application must wait at least 25 ms before the change to take effect. When the simulation is in scale down mode, waiting for 500 micro sec is sufficient. This bit is valid only when OTG_MODE = 0, 1 or 2. In all other cases, this bit reads 0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORRUPTTXPKT</name>
              <description>Mode: Host and device
Corrupt Tx packet (CorruptTxPkt)
This bit is for debug purposes only. Never Set this bit to 1. The application must always write 1'b0 to this bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRSTCTL</name>
          <description>The application uses this register to reset various hardware features inside the controller.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>CSFTRST</name>
              <description>Mode: Host and Device
Core Soft Reset (CSftRst)
Resets the hclk and phy_clock domains as follows:
 - Clears the interrupts and all the CSR registers except the following register bits:
 -- PCGCCTL.RstPdwnModule
 -- PCGCCTL.GateHclk
 -- PCGCCTL.PwrClmp
 -- PCGCCTL.StopPPhyLPwrClkSelclk
 -- GUSBCFG.ForceDevMode
 -- GUSBCFG.ForceHstMode
 -- GUSBCFG.PhyLPwrClkSel
 -- GUSBCFG.DDRSel
 -- GUSBCFG.PHYSel
 -- GUSBCFG.FSIntf
 -- GUSBCFG.ULPI_UTMI_Sel
 -- GUSBCFG.PHYIf
 -- GUSBCFG.TxEndDelay
 -- GUSBCFG.TermSelDLPulse
 -- GUSBCFG.ULPIClkSusM
 -- GUSBCFG.ULPIAutoRes
 -- GUSBCFG.ULPIFsLs
 -- GGPIO
 -- GPWRDN
 -- GADPCTL
 -- HCFG.FSLSPclkSel
 -- DCFG.DevSpd
 -- DCTL.SftDiscon
 - All module state machines
 - All module state machines (except the AHB Slave Unit) are reset to the IDLE state, and all the transmit FIFOs and the receive FIFO are flushed.
 - Any transactions on the AHB Master are terminated as soon as possible, after gracefully completing the last data phase of an AHB transfer. Any transactions on the USB are terminated immediately.
 - When Hibernation or ADP feature is enabled, the PMU module is not reset by the Core Soft Reset.
The application can write to this bit any time it wants to reset the core. The application must clear this bit after checking the bit 29 of this register (Core Soft Reset Done). Software must also must check that bit 31 of this register is 1 (AHB Master is IDLE) before starting any operation.

Typically software reset is used during software development and also when you dynamically change the PHY selection bits in the USB configuration registers listed above. When you change the PHY, the corresponding clock for the PHY is selected and used in the PHY domain. Once a new clock is selected, the PHY domain has to be reset for proper operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIUFSSFTRST</name>
              <description>Mode: Host and Device
PIU FS Dedicated Controller Soft Reset (PIUFSSftRst)

Resets the PIU FS Dedicated Controller
 All module state machines in FS Dedicated Controller of PIU are reset to the IDLE state. Used to reset the FS Dedicated controller in PIU in case of any PHY Errors like Loss of activity or Babble Error resulting in the PHY remaining in RX state for more than one frame boundary.
This is a self clearing bit and core clears this bit after all the necessary logic is reset in the core.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRMCNTRRST</name>
              <description>Mode: Host only
Host Frame Counter Reset (FrmCntrRst)
The application writes this bit to reset the (micro)Frame number counter inside the core. When the (micro)Frame counter is reset, the subsequent SOF sent out by the core has a (micro)Frame number of 0.
When application writes 1 to the bit, it might not be able to read back the value as it gets cleared by the core in a few clock cycles.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFFLSH</name>
              <description>Mode: Host and Device
RxFIFO Flush (RxFFlsh)
The application can flush the entire RxFIFO using this bit, but must first ensure that the core is not in the middle of a transaction.
The application must only write to this bit after checking that the controller is neither reading from the RxFIFO nor writing to the RxFIFO.

The application must wait until the bit is cleared before performing any other operations. This bit requires eight clocks (slowest of PHY or AHB clock) to clear.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFFLSH</name>
              <description>Mode: Host and Device
TxFIFO Flush (TxFFlsh)
This bit selectively flushes a single or all transmit FIFOs, but cannot do so If the core is in the midst of a transaction.
The application must write this bit only after checking that the core is neither writing to the TxFIFO nor reading from the TxFIFO.
Verify using these registers:
 - ReadNAK Effective Interrupt ensures the core is not reading from the FIFO
 - WriteGRSTCTL.AHBIdle ensures the core is not writing anything to the FIFO.
Flushing is normally recommended when FIFOs are reconfigured or when switching between Shared FIFO and Dedicated Transmit FIFO operation. FIFO flushing is also recommended during device endpoint disable. The application must wait until the core clears this bit before performing any operations. This bit takes eight clocks to clear, using the slower clock of phy_clk or hclk.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>Mode: Host and Device
TxFIFO Number (TxFNum)
This is the FIFO number that must be flushed using the TxFIFO Flush bit. This field must not be changed until the core clears the TxFIFO Flush bit.
 - 5'h0:
 -- Non-periodic TxFIFO flush in Host mode
 -- Non-periodic TxFIFO flush in device mode when in shared FIFO operation
 -- Tx FIFO 0 flush in device mode when in dedicated FIFO mode
 - 5'h1:
 -- Periodic TxFIFO flush in Host mode
 -- Periodic TxFIFO 1 flush in Device mode when in shared FIFO operation
 -- TXFIFO 1 flush in device mode when in dedicated FIFO mode
 - 5'h2:
 -- Periodic TxFIFO 2 flush in Device mode when in shared FIFO operation
 -- TXFIFO 2 flush in device mode when in dedicated FIFO mode
...
 - 5'hF
 -- Periodic TxFIFO 15 flush in Device mode when in shared FIFO operation
 -- TXFIFO 15 flush in device mode when in dedicated FIFO mode
 - 5'h10: Flush all the transmit FIFOs in device or host mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSFTRSTDONE</name>
              <description>Mode: Host and Device
Core Soft Reset Done (CSftRstDone)
The core sets this bit when all the necessary logic is reset in the core.This bit is cleared by the application along with GRSTCTL.CSftRst (bit 0)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAREQ</name>
              <description>Mode: Host and Device
DMA Request Signal (DMAReq)
Indicates that the DMA request is in progress. Used for debug.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBIDLE</name>
              <description>Mode: Host and Device
AHB Master Idle (AHBIdle)
Indicates that the AHB Master State Machine is in the IDLE condition.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GINTSTS</name>
          <description>This register interrupts the application for system-level events in the current mode (Device mode or Host mode). Some of the bits in this register are valid only in Host mode, while others are valid in Device mode only. This register also indicates the current mode. To clear the interrupt status bits of type R_SS_WC, the application must write 1'b1 to the bit. The FIFO status interrupts are read only; once software reads from or writes to the FIFO while servicing these interrupts, FIFO interrupt conditions are cleared automatically. The application must clear the GINTSTS register at initialization before unmasking the interrupt bit to avoid any interrupts generated prior to initialization.  Note: Read the reset value of GINTSTS.CurMod only after the following conditions:  - If IDDIG_FILTER is disabled, read only after PHY clock is stable.  - If IDDIG_FILTER is enabled, read only after the filter timer expires.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x4000020</resetValue>
          <fields>
            <field>
              <name>CURMOD</name>
              <description>Mode: Host and Device
Current Mode of Operation (CurMod)
Indicates the current mode.
 - 1'b0: Device mode
 - 1'b1: Host mode


