esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
For example, after detecting an endpoint mismatch, the application:
 - Sets a Global non-periodic IN NAK handshake
 - Disables IN endpoints
 - Flushes the FIFO
 - Determines the token sequence from the IN Token Sequence Learning Queue
 - Re-enables the endpoints
 - Clears the Global non-periodic IN NAK handshake
If the Global non-periodic IN NAK is cleared, the core has not yet fetched data for the IN endpoint, and the IN token is received. The core generates an 'IN token received when FIFO empty' interrupt. It then sends the host a NAK response. To avoid this scenario, the application can check the GINTSTS.FetSusp interrupt, which ensures that the FIFO is full before clearing a Global NAK handshake.

Alternatively, the application can mask the IN token received when FIFO empty interrupt when clearing a Global IN NAK handshake.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESETDET</name>
              <description>Mode: Device only
Reset detected Interrupt (ResetDet)
In Device mode, this interrupt is asserted when a reset is detected on the USB in partial power-down mode when the device is in Suspend.

In Host mode, this interrupt is not asserted.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTINT</name>
              <description>Mode: Host only
Host Port Interrupt (PrtInt)
The core sets this bit to indicate a change in port status of one of the controller ports in Host mode. The application must read the Host Port Control and Status (HPRT) register to determine the exact event that caused this interrupt. The application must clear the appropriate status bit in the Host Port
Control and Status register to clear this bit.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HCHINT</name>
              <description>Mode: Host only
Host Channels Interrupt (HChInt)
The core sets this bit to indicate that an interrupt is pending on one of the channels of the core (in Host mode). The application must read the Host All Channels Interrupt (HAINT) register to determine the exact number of the channel on which the interrupt occurred, and Then read the corresponding Host
Channel-n Interrupt (HCINTn) register to determine the exact cause of the interrupt. The application must clear the appropriate status bit in the HCINTn register to clear this bit.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PTXFEMP</name>
              <description>Mode: Host only
Periodic TxFIFO Empty (PTxFEmp)
This interrupt is asserted when the Periodic Transmit FIFO is either half or completely empty and there is space for at least one entry to be written in the Periodic Request Queue. The half or completely empty status is determined by the Periodic TxFIFO Empty Level bit in the Core AHB Configuration register (GAHBCFG.PTxFEmpLvl).</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CONIDSTSCHNG</name>
              <description>Mode: Host and Device
Connector ID Status Change (ConIDStsChng)
The core sets this bit when there is a change in connector ID status.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCONNINT</name>
              <description>Mode: Host only
Disconnect Detected Interrupt (DisconnInt)
Asserted when a device disconnect is detected.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SESSREQINT</name>
              <description>Mode: Host and Device
Session Request/New Session Detected Interrupt (SessReqInt)
In Host mode, this interrupt is asserted when a session request is detected from the device. In Host mode, this interrupt is asserted when a session request is detected from the device.
In Device mode, this interrupt is asserted when the utmisrp_bvalid signal goes high.
For more information on how to use this interrupt, see 'Partial Power-Down and Clock Gating Programming Model' in the Programming Guide.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPINT</name>
              <description>Mode: Host and Device
Resume/Remote Wakeup Detected Interrupt (WkUpInt)
Wakeup Interrupt during Suspend(L2) or LPM(L1) state.
 - During Suspend(L2):
 -- Device Mode: This interrupt is asserted only when Host Initiated Resume is detected on USB.
 -- Host Mode: This interrupt is asserted only when Device Initiated Remote Wakeup is detected on USB.
For more information, see 'Partial Power-Down and Clock Gating Programming Model' in the Programming Guide.
 - During LPM(L1):
 -- Device Mode: This interrupt is asserted for either Host Initiated Resume or Device Initiated Remote Wakeup on USB.
 -- Host Mode: This interrupt is asserted for either Host Initiated Resume or Device Initiated Remote Wakeup on USB.
For more information, see 'LPM Entry and Exit Programming Model' in the Programming Guide.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GINTMSK</name>
          <description>This register works with the Interrupt Register (GINTSTS) to interrupt the application. When an interrupt bit is masked, the interrupt associated with that bit is not generated. However, the GINTSTS register bit corresponding to that interrupt is still set.  Note: The fields of this register change depending on host or device mode.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODEMISMSK</name>
              <description>Mode: Host and Device
Mode Mismatch Interrupt Mask (ModeMisMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTGINTMSK</name>
              <description>Mode: Host and Device
OTG Interrupt Mask (OTGIntMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFMSK</name>
              <description>Mode: Host and Device
Start of (micro)Frame Mask (SofMsk)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFLVLMSK</name>
              <description>Mode: Host and Device
Receive FIFO Non-Empty Mask (RxFLvlMsk)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NPTXFEMPMSK</name>
              <description>Mode: Host and Device
Non-periodic TxFIFO Empty Mask (NPTxFEmpMsk)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GINNAKEFFMSK</name>
              <description>Mode: Device only,
Global Non-periodic IN NAK Effective Mask (GINNakEffMsk)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GOUTNAKEFFMSK</name>
              <description>Mode: Device only
Global OUT NAK Effective Mask (GOUTNakEffMsk)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERLYSUSPMSK</name>
              <description>Mode: Device only
Early Suspend Mask (ErlySuspMsk)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBSUSPMSK</name>
              <description>Mode: Device only
USB Suspend Mask (USBSuspMsk)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBRSTMSK</name>
              <description>Mode: Device only
USB Reset Mask (USBRstMsk)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENUMDONEMSK</name>
              <description>Mode: Device only
Enumeration Done Mask (EnumDoneMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISOOUTDROPMSK</name>
              <description>Mode: Device only
Isochronous OUT Packet Dropped Interrupt Mask (ISOOutDropMsk)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EOPFMSK</name>
              <description>Mode: Device only
End of Periodic Frame Interrupt Mask (EOPFMsk)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPMISMSK</name>
              <description>Mode: Device only
Endpoint Mismatch Interrupt Mask (EPMisMsk)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IEPINTMSK</name>
              <description>Mode: Device only
IN Endpoints Interrupt Mask (IEPIntMsk)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OEPINTMSK</name>
              <description>Mode: Device only
OUT Endpoints Interrupt Mask (OEPIntMsk)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INCOMPLPMSK</name>
              <description>Incomplete Periodic Transfer Mask (incomplPMsk)
Mode: Host only
Incomplete Isochronous OUT Transfer Interrupt Mask (incompISOOUTMsk)
Mode: Device only</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FETSUSPMSK</name>
              <description>Mode: Device only
Data Fetch Suspended Mask (FetSuspMsk)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESETDETMSK</name>
              <description>Mode: Device only
Reset detected Interrupt Mask (ResetDetMsk)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTINTMSK</name>
              <description>Mode: Host only
Host Port Interrupt Mask (PrtIntMsk)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCHINTMSK</name>
              <description>Mode: Host only
Host Channels Interrupt Mask (HChIntMsk)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTXFEMPMSK</name>
              <description>Mode: Host only
Periodic TxFIFO Empty Mask (PTxFEmpMsk)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONIDSTSCHNGMSK</name>
              <description>Mode: Host and Device
Connector ID Status Change Mask (ConIDStsChngMsk)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCONNINTMSK</name>
              <description>Mode: Host and Device
Disconnect Detected Interrupt Mask (DisconnIntMsk)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SESSREQINTMSK</name>
              <description>Mode: Host and Device
Session Request/New Session Detected Interrupt Mask (SessReqIntMsk)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPINTMSK</name>
              <description>Mode: Host and Device
Resume/Remote Wakeup Detected Interrupt Mask (WkUpIntMsk)
The WakeUp bit is used for LPM state wake up in a way similar to that of wake up in suspend state.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRXSTSR</name>
          <description>A read to the Receive Status Debug Read register returns the contents of the top of the Receive FIFO.  The receive status contents must be interpreted differently in Host and Device modes. The core ignores the receive status read when the receive FIFO is empty and returns a value of 32'h0000_0000.  Note:  - Use of these fields vary based on whether the core is functioning as a host or a device.  - Do not read this register's reset value before configuring the core because the read value is 'X' in the simulation.</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHNUM</name>
              <description>Channel Number (ChNum)
Mode: Host only
Indicates the channel number to which the current received packet belongs.
Endpoint Number (EPNum)
Mode: Device only
Indicates the endpoint number to which the current received packet belongs.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BCNT</name>
              <description>Byte Count (BCnt)

