esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
 - Bits [30:27]: Channel/endpoint number
 - Bits [26:25]:
 - 2'b00: IN/OUT token
 -- 2'b01: Zero-length transmit packet (device IN/host OUT)
 -- 2'b10: PING/CSPLIT token
 -- 2'b11: Channel halt command
 - Bit [24]: Terminate (last Entry for selected channel/endpoint)
 Reset: 7'h0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPVNDCTL</name>
          <description>The application can use this register to access PHY registers. It is implemented only if Enable PHY Vendor Control Interface was selected during coreConsultant configuration (parameter OTG_VENDOR_CTL_INTERFACE = 1). For a UTMI+ PHY, the DWC_otg core uses the UTMI+ Vendor Control interface for PHY register access. For a ULPI PHY, the core uses the ULPI interface for PHY register access. The application sets Vendor Control register for PHY register access and times the PHY register access. The application polls the VStatus Done bit in this register for the completion of the PHY register access.</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REGDATA</name>
              <description>Register Data (RegData)

Contains the write data for register write.

Read data for register read, valid when VStatus Done is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCTRL</name>
              <description>UTMI+ Vendor Control Register Address (VCtrl)
The 4-bit register address a vendor defined 4-bit parallel
output bus. Bits 11:8 of this field are placed on
utmi_vcontrol[3:0].
ULPI Extended Register Address (ExtRegAddr)
The 6-bit PHY extended register address.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGADDR</name>
              <description>Register Address (RegAddr)

The 6-bit PHY register address for immediate PHY Register set access. Set to 6'h2F for Extended PHY Register set access.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGWR</name>
              <description>Register Write (RegWr)
Set this bit for register writes, and clear it for register reads.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEWREGREQ</name>
              <description>New Register Request (NewRegReq)

The application sets this bit for a new vendor control
access.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSTSBSY</name>
              <description>VStatus Busy (VStsBsy)

The core sets this bit when the vendor control access is in
progress and clears this bit when done.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSTSDONE</name>
              <description>VStatus Done (VStsDone)

The core sets this bit when the vendor control access is
done.
This bit is cleared by the core when the application sets the
New Register Request bit (bit 25).</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISULPIDRVR</name>
              <description>Disable ULPI Drivers (DisUlpiDrvr)

The application sets this bit when it has finished processing
the ULPI Carkit Interrupt (GINTSTS.ULPICKINT). When
set, the controller disables drivers for output signals
and masks input signal for the ULPI interface. The controller clears this bit before enabling the ULPI interface.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GSNPSID</name>
          <description>This read-only register contains the release number of the core being used.</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x4f54430a</resetValue>
          <fields>
            <field>
              <name>SYNOPSYSID</name>
              <description>Release number of the controller being used currently.

Bits [31:16]:
 - 0x4f54: ASCII Value for OT
Bits [15:0]: Current Release Number. For example, 0x400a corresponds to v4.00a Release number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GHWCFG1</name>
          <description>This register contains the logical endpoint direction(s) selected using coreConsultant.</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPDIR</name>
              <description>This 32-bit field uses two bits per
endpoint to determine the endpoint direction.

Endpoint
 - Bits [31:30]: Endpoint 15 direction
 - Bits [29:28]: Endpoint 14 direction
...
 - Bits [3:2]: Endpoint 1 direction
 - Bits[1:0]: Endpoint 0 direction (always BIDIR)
Direction
 - 2'b00: BIDIR (IN and OUT) endpoint
 - 2'b01: IN endpoint
 - 2'b10: OUT endpoint
 - 2'b11: Reserved
Note: This field is configured using the OTG_EP_DIR_1(n) parameter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GHWCFG2</name>
          <description>This register contains configuration options selected using coreConsultant.</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x239ffed2</resetValue>
          <fields>
            <field>
              <name>OTGMODE</name>
              <description>Mode of Operation (OtgMode)
 - 3'b000: HNP- and SRP-Capable OTG (Host &amp; Device)
 - 3'b001: SRP-Capable OTG (Host &amp; Device)
 - 3'b010: Non-HNP and Non-SRP Capable OTG (Host and Device)
 - 3'b011: SRP-Capable Device
 - 3'b100: Non-OTG Device
 - 3'b101: SRP-Capable Host
 - 3'b110: Non-OTG Host
 - Others: Reserved
Note: This field is configured using the OTG_MODE parameter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTGARCH</name>
              <description>Architecture (OtgArch)
 - 2'b00: Slave-Only
 - 2'b01: External DMA
 - 2'b10: Internal DMA
 - Others: Reserved
Note: This field is configured using the OTG_ARCHITECTURE parameter.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SINGPNT</name>
              <description>Point-to-Point (SingPnt)
 - 1'b0: Multi-point application  (hub and split support)
 - 1'b1: Single-point application (no hub and split support)
Note: This field is configured using the OTG_SINGLE_POINT parameter.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSPHYTYPE</name>
              <description>High-Speed PHY Interface Type (HSPhyType)
 - 2'b00: High-Speed interface not supported
 - 2'b01: UTMI+
 - 2'b10: ULPI
 - 2'b11: UTMI+ and ULPI
Note: This field is configured using the OTG_HSPHY_INTERFACE parameter.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSPHYTYPE</name>
              <description>Full-Speed PHY Interface Type (FSPhyType)
 - 2'b00: Full-speed interface not supported
 - 2'b01: Dedicated full-speed interface
 - 2'b10: FS pins shared with UTMI+ pins
 - 2'b11: FS pins shared with ULPI pins
Note: This field is configured using the OTG_FSPHY_INTERFACE parameter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUMDEVEPS</name>
              <description>Number of Device Endpoints (NumDevEps)

