esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
This field contains the memory start address for the IN endpoint Transmit FIFO that this register corresponds to.
The power-on reset value of this register is calculated according to the following formula: OTG_RX_DFIFO_DEPTH + SUM of OTG_TX_DINEP_DFIFO_DEPTH_'n', where n = 0 to (FIFO number-1).
For example,
Start address of INEP FIFO 1 (DIEPTXF1) is OTG_RX_DFIFO_DEPTH + OTG_TX_DINEP_DFIFO_DEPTH_0, start address of INEP FIFO 2 (DIEPTXF2) is OTG_RX_DFIFO_DEPTH + OTG_TX_DINEP_DFIFO_DEPTH_0 + OTG_TX_DINEP_DFIFO_DEPTH_1, and so on.
If at POR the calculated value (C) exceeds 65535, then the Reset value becomes Reset Value(A) = (C-65536).
 - If Enable Dynamic FIFO Sizing is deselected in coreConsultant (OTG_DFIFO_DYNAMIC = 0), this field is read-only and read value is the power-on reset value.
 - If Enable Dynamic FIFO Sizing is selected in coreConsultant (OTG_DFIFO_DYNAMIC = 1), and you have calculated or programmed a new value for RxFIFO depth or TX FIFO depths, you can program their values according to the above formula. Programmed values must not exceed the power-on value set in coreConsultant.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNTXFDEP</name>
              <description>IN Endpoint TxFIFO Depth (INEPnTxFDep)

This value is in terms of 32-bit words.
 - Minimum value is 16
 - Maximum value is 32,768
The power-on reset value of this register is specified as the Largest IN Endpoint FIFO number Depth (parameter OTG_TX_DINEP_DFIFO_DEPTH_i) set during coreConsultant configuration, where i is the FIFO number this register corresponds to.
 - If Enable Dynamic FIFO Sizing? was deselected in coreConsultant (parameter OTG_DFIFO_DYNAMIC = 0), these flops are optimized, and reads return the power-on value.
 - If Enable Dynamic FIFO Sizing? was selected in coreConsultant (parameter OTG_DFIFO_DYNAMIC = 1), you can write a new value in this field.
Programmed values must not exceed the power-on value.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCFG</name>
          <description>This register is used to configure the controller in Host mode.</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <resetValue>0x200</resetValue>
          <fields>
            <field>
              <name>FSLSPCLKSEL</name>
              <description>FS/LS PHY Clock Select (FSLSPclkSel)

When the core is in FS Host mode
 - 2'b00: PHY clock is running at 30/60 MHz
 - 2'b01: PHY clock is running at 48 MHz
 - Others: Reserved
When the core is in LS Host mode
 - 2'b00: PHY clock is running at 30/60 MHz. When the UTMI+/ULPI PHY Low Power mode is not selected, use 30/60 MHz.
 - 2'b01: PHY clock is running at 48 MHz. When the UTMI+ PHY Low Power mode is selected, use 48MHz If the PHY supplies a 48 MHz clock during LS mode.
 - 2'b10: PHY clock is running at 6 MHz. In USB 1.1 FS mode, use 6 MHz when the UTMI+ PHY Low Power mode is selected and the PHY supplies a 6 MHz clock during LS mode. If you select a 6 MHz clock during LS mode, you must do a soft reset.
 - 2'b11: Reserved
Notes:
 - When Core in FS mode, the internal and external clocks have the same frequency.
 - When Core in LS mode,
 -- If FSLSPclkSel = 2'b00: Internal and external clocks have the same frequency
 -- If FSLSPclkSel = 2'b10: Internal clock is the divided by eight version of external 48 MHz clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSLSSUPP</name>
              <description>FS- and LS-Only Support (FSLSSupp)

The application uses this bit to control the core's enumeration speed. Using this bit, the application can make the core
enumerate as a FS host, even If the connected device supports HS traffic. Do not make changes to this field after initial
programming.
 - 1'b0: HS/FS/LS, based on the maximum speed supported by the connected device
 - 1'b1: FS/LS-only, even If the connected device can support HS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENA32KHZS</name>
              <description>Enable 32 KHz Suspend mode (Ena32KHzS)

This bit can be set only in FS PHY interface is selected.
Else, this bit needs to be set to zero.
When FS PHY interface is chosen and this bit is set,
the core expects that the PHY clock during Suspend is switched
from 48 MHz to 32 KHz.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESVALID</name>
              <description>Resume Validation Period  (ResValid)

This field is effective only when HCFG.Ena32KHzS is set.
It controls the resume period when the core resumes from suspend.
The core counts for 'ResValid' number of clock cycles to detect a
valid resume when this is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESCDMA</name>
              <description>Enable Scatter/gather DMA in Host mode (DescDMA)

When the Scatter/Gather DMA option selected during configuration of the RTL, the application can set this bit during initialization
to enable the Scatter/Gather DMA operation.

Note: This bit must be modified only once after a reset.

The following combinations are available for programming:
 - GAHBCFG.DMAEn=0,HCFG.DescDMA=0 =&gt; Slave mode
 - GAHBCFG.DMAEn=0,HCFG.DescDMA=1 =&gt; Invalid
 - GAHBCFG.DMAEn=1,HCFG.DescDMA=0 =&gt; Buffered DMA mode
 - GAHBCFG.DMAEn=1,HCFG.DescDMA=1 =&gt; Scatter/Gather DMA mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRLISTEN</name>
              <description>Frame List Entries(FrListEn)

