esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
Values are in terms of 32-bit words
 - 16'h0    : Periodic TxFIFO is full
 - 16'h1    : 1 word available
 - 16'h2    : 2 words available
 - 16'hn    : n words available (where 0  n  32,768)
 - 16'h8000 : 32,768 words
 - Others   : Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PTXQSPCAVAIL</name>
              <description>Periodic Transmit Request Queue Space Available (PTxQSpcAvail)

Indicates the number of free locations available to be written in the Periodic Transmit Request Queue. This queue holds both IN and OUT requests.
 - 7'h0: Periodic Transmit Request Queue is full
 - 7'h1: 1 location available
 - 7'h2: 2 locations available
 - n: n locations available (0 &lt;= n &lt;= 16)
 - Others: Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PTXQTOP</name>
              <description>Top of the Periodic Transmit Request Queue (PTxQTop)

This indicates the Entry in the Periodic Tx Request Queue that is
currently being processed by the MAC.

This register is used for debugging.
 - Bit [31]: Odd/Even (micro)Frame
 -- 1'b0: send in even (micro)Frame
 -- 1'b1: send in odd (micro)Frame
 - Bits [30:27]: Channel/endpoint number
 - Bits [26:25]: Type
 -- 2'b00: IN/OUT
 -- 2'b01: Zero-length packet
 -- 2'b10: CSPLIT
 -- 2'b11: Disable channel command
 - Bit [24]: Last Periodic Entry for the selected periodic channel/endpoint
 - Bit [23]: Terminate (last Entry for the selected channel/endpoint)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HAINT</name>
          <description>When a significant event occurs on a channel, the Host All Channels Interrupt register interrupts the application using the Host Channels Interrupt bit of the Core Interrupt register (GINTSTS.HChInt). This is shown in the Interrupt Hierarchy figure in the databook. There is one interrupt bit per channel, up to a maximum of 16 bits. Bits in this register are set and cleared when the application sets and clears bits in the corresponding Host Channel-n Interrupt register.</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HAINT</name>
              <description>Channel Interrupt for channel no.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HAINTMSK</name>
          <description>The Host All Channel Interrupt Mask register works with the Host All Channel Interrupt register to interrupt the application when an event occurs on a channel. There is one interrupt mask bit per channel, up to a maximum of 16 bits.</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HAINTMSK</name>
              <description>Channel Interrupt Mask (HAINTMsk)
One bit per channel: Bit 0 for channel 0, bit 15 for channel 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFLBAddr</name>
          <description>This register is present only in case of Scatter/Gather DMA. It is implemented as flops. This register holds the starting address of the Frame list information.</description>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HFLBADDR_HFLBADDR</name>
              <description>The starting address of the Frame list.
This register is used only for Isochronous and Interrupt Channels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPRT</name>
          <description>This register is available only in Host mode. Currently, the OTG Host supports only one port. A single register holds USB port-related information such as USB reset, enable, suspend, resume, connect status, and test mode for each port. It is shown in the Interrupt Hierarchy figure in the databook. The R_SS_WC bits in this register can trigger an interrupt to the application through the Host Port Interrupt bit of the Core Interrupt register (GINTSTS.PrtInt). On a Port Interrupt, the application must read this register and clear the bit that caused the interrupt. For the R_SS_WC bits, the application must write a 1 to the bit to clear the interrupt.</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PRTCONNSTS</name>
              <description>Port Connect Status (PrtConnSts)
 - 0: No device is attached to the port.
 - 1: A device is attached to the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRTCONNDET</name>
              <description>Port Connect Detected (PrtConnDet)

The core sets this bit when a device connection is detected
to trigger an interrupt to the application using the Host Port
Interrupt bit of the Core Interrupt register (GINTSTS.PrtInt).This bit can be set only by the core and the application must write 1 to clear it.The application must write a 1 to this bit to clear the
interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTENA</name>
              <description>Port Enable (PrtEna)

A port is enabled only by the core after a reset sequence,
and is disabled by an overcurrent condition, a disconnect
condition, or by the application clearing this bit. The
application cannot Set this bit by a register write. It can only
clear it to disable the port by writing 1. This bit does not trigger any
interrupt to the application.
 - 1'b0: Port disabled
 - 1'b1: Port enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTENCHNG</name>
              <description>Port Enable/Disable Change (PrtEnChng)

