esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
The core sets this bit when the status of the Port Enable bit [2] of this register changes.This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTOVRCURRACT</name>
              <description>Port Overcurrent Active (PrtOvrCurrAct)

Indicates the overcurrent condition of the port.
 - 1'b0: No overcurrent condition
 - 1'b1: Overcurrent condition</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRTOVRCURRCHNG</name>
              <description>Port Overcurrent Change (PrtOvrCurrChng)

The core sets this bit when the status of the Port Overcurrent Active bit (bit 4) in this register changes.This bit can be set only by the core and the application must write 1 to clear it</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTRES</name>
              <description>Port Resume (PrtRes)

The application sets this bit to drive resume signaling on the
port. The core continues to drive the resume signal until the
application clears this bit.

If the core detects a USB remote wakeup sequence, as
indicated by the Port Resume/Remote Wakeup Detected
Interrupt bit of the Core Interrupt register
(GINTSTS.WkUpInt), the core starts driving resume
signaling without application intervention and clears this bit
when it detects a disconnect condition. The read value of
this bit indicates whether the core is currently driving
resume signaling.
 - 1'b0: No resume driven
 - 1'b1: Resume driven
When LPM is enabled, In L1 state the behavior of this bit is as follows:
The application sets this bit to drive resume signaling on the port.
The core continues to drive the resume signal until a pre-determined time
specified in GLPMCFG.HIRD_Thres[3:0] field. If the core detects a USB remote
wakeup sequence, as indicated by the Port L1Resume/Remote L1Wakeup Detected
Interrupt bit of the Core Interrupt register (GINTSTS.L1WkUpInt),
the core starts driving resume signaling without application intervention
and clears this bit at the end of resume.This bit can be set by both core or application
and also cleared by core or application. This bit is cleared by the core even if there is
no device connected to the Host.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTSUSP</name>
              <description>Port Suspend (PrtSusp)

The application sets this bit to put this port in Suspend
mode. The core only stops sending SOFs when this is Set.
To stop the PHY clock, the application must Set the Port
Clock Stop bit, which asserts the suspend input pin of the
PHY.

The read value of this bit reflects the current suspend status
of the port. This bit is cleared by the core after a remote
wakeup signal is detected or the application sets the Port
Reset bit or Port Resume bit in this register or the
Resume/Remote Wakeup Detected Interrupt bit or
Disconnect Detected Interrupt bit in the Core Interrupt
register (GINTSTS.WkUpInt or GINTSTS.DisconnInt,
respectively).This bit is cleared by the core even if there is
no device connected to the Host.
 - 1'b0: Port not in Suspend mode
 - 1'b1: Port in Suspend mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTRST</name>
              <description>Port Reset (PrtRst)

When the application sets this bit, a reset sequence is
started on this port. The application must time the reset
period and clear this bit after the reset sequence is
complete.
 - 1'b0: Port not in reset
 - 1'b1: Port in reset
The application must leave this bit set for at least a
minimum duration mentioned below to start a reset on the
port. The application can leave it set for another 10 ms in
addition to the required minimum duration, before clearing
the bit, even though there is no maximum limit Set by the
USB standard.This bit is cleared by the core even if there is
no device connected to the Host.
 - High speed: 50 ms
 - Full speed/Low speed: 10 ms</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTLNSTS</name>
              <description>Port Line Status (PrtLnSts)

Indicates the current logic level USB data lines
 - Bit [10]: Logic level of D+
 - Bit [11]: Logic level of D-</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRTPWR</name>
              <description>Port Power (PrtPwr)

The application uses this field to control power to this port (write 1'b1 to set to 1'b1
and write 1'b0 to set to 1'b0), and the core can clear this bit on an over current
condition.
 - 1'b0: Power off
 - 1'b1: Power on

Note: This bit is interface independent. The application needs to program this bit for all interfaces as described in the host programming flow in the Programming Guide.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTTSTCTL</name>
              <description>Port Test Control (PrtTstCtl)

The application writes a nonzero value to this field to put the port into a Test mode, and the corresponding pattern is signaled on the port.
 - 4'b0000: Test mode disabled
 - 4'b0001: Test_J mode
 - 4'b0010: Test_K mode
 - 4'b0011: Test_SE0_NAK mode
 - 4'b0100: Test_Packet mode
 - 4'b0101: Test_Force_Enable
 - Others: Reserved

