esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
To move the DWC_otg controller to test mode, you must set this field. Complete the following steps to move the DWC_otg core to test mode:
 - 1. Power on the core.
 - 2. Load the DWC_otg driver.
 - 3. Connect an HS device and enumerate to HS mode.
 - 4. Access the HPRT register to send test packets.
 - 5. Remove the device and connect to fixture (OPT) port. The DWC_otg host core continues sending out test packets.
 - 6. Test the eye diagram.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTSPD</name>
              <description>Port Speed (PrtSpd)

Indicates the speed of the device attached to this port.
 - 2'b00: High speed
 - 2'b01: Full speed
 - 2'b10: Low speed
 - 2'b11: Reserved</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCCHAR0</name>
          <description>This register contains the characteristics of the Host Channel.</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MPS</name>
              <description>Maximum Packet Size (MPS)

Indicates the maximum packet size of the associated endpoint.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPNUM</name>
              <description>Endpoint Number (EPNum)

Indicates the endpoint number on the device serving as the data source or sink.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint Direction (EPDir)

Indicates whether the transaction is IN or OUT.
 - 1'b0: OUT
 - 1'b1: IN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSPDDEV</name>
              <description>Low-Speed Device (LSpdDev)

This field is Set by the application to indicate that this channel is communicating to a low-speed device.

The application must program this bit when a low speed device is connected to the host through an FS HUB. The DWC_otg Host core uses this field to drive the XCVR_SELECT signal to 2'b11 while communicating to the LS Device through the FS hub.

Note: In a peer to peer setup, the DWC_otg Host core ignores this bit even if it is set by the application software.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type (EPType)

Indicates the transfer type selected.
 - 2'b00: Control
 - 2'b01: Isochronous
 - 2'b10: Bulk
 - 2'b11: Interrupt</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EC</name>
              <description>Multi Count (MC) / Error Count (EC)

When the Split Enable bit of the Host Channel-n Split Control
register (HCSPLTn.SpltEna) is reset (1'b0), this field indicates to
the host the number of transactions that must be executed per
microframe for this periodic endpoint. For non periodic transfers,
this field is used only in DMA mode, and specifies the number
packets to be fetched for this channel before the internal DMA
engine changes arbitration.
 - 2'b00: Reserved This field yields undefined results.
 - 2'b01: 1 transaction
 - 2'b10: 2 transactions to be issued for this endpoint per microframe
 - 2'b11: 3 transactions to be issued for this endpoint per microframe
When HCSPLTn.SpltEna is Set (1'b1), this field indicates the
number of immediate retries to be performed for a periodic split
transactions on transaction errors. This field must be Set to at
least 2'b01.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVADDR</name>
              <description>Device Address (DevAddr)

This field selects the specific device serving as the data source
or sink.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ODDFRM</name>
              <description>Odd Frame (OddFrm)

This field is set (reset) by the application to indicate that the OTG host must perform
a transfer in an odd (micro)Frame. This field is applicable for only periodic
(isochronous and interrupt) transactions.
 - 1'b0: Even (micro)Frame
 - 1'b1: Odd (micro)Frame</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHDIS</name>
              <description>Channel Disable (ChDis)

The application sets this bit to stop transmitting/receiving data
on a channel, even before the transfer for that channel is
complete. The application must wait for the Channel Disabled
interrupt before treating the channel as disabled.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHENA</name>
              <description>Channel Enable (ChEna)

When Scatter/Gather mode is enabled
 - 1'b0: Indicates that the descriptor structure is not yet ready.
 - 1'b1:  Indicates  that  the  descriptor  structure  and  data  buffer  with data is setup and this channel can access the descriptor.
When Scatter/Gather mode is disabled

 This field is set by the application and cleared by the OTG host.
 - 1'b0: Channel disabled
 - 1'b1: Channel enabled</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCSPLT0</name>
          <description>This register contains the Split characteristics of the Host Channel.</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PRTADDR</name>
              <description>Port Address (PrtAddr)

This field is the port number of the recipient transaction translator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUBADDR</name>
              <description>Hub Address (HubAddr)

