esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
This bit is valid only when Scatter/Gather DMA mode is enabled.
The core generates this interrupt when the descriptor accessed
is not ready for the Core to process. BNA is not generated
for Isochronous channels.
For non Scatter/Gather DMA mode, this bit is reserved.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCS_XACT_ERR</name>
              <description>Excessive Transaction Error (XCS_XACT_ERR)

This bit is valid only when Scatter/Gather DMA mode is enabled. The core sets this bit
when 3 consecutive transaction errors occurred on the USB bus. XCS_XACT_ERR
is not generated for Isochronous channels.
For non Scatter/Gather DMA mode, this bit is reserved.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESC_LST_ROLLINTR</name>
              <description>Descriptor rollover interrupt (DESC_LST_ROLLIntr)

This bit is valid only when Scatter/Gather DMA mode is enabled. The core sets this bit
when the corresponding channel's descriptor list rolls over.
For non Scatter/Gather DMA mode, this bit is reserved.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCINTMSK0</name>
          <description>This register reflects the mask for each channel status described in the previous section.</description>
          <addressOffset>0x50c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHHLTDMSK</name>
              <description>Channel Halted Mask (ChHltdMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask (AHBErrMsk)
In  scatter/gather  DMA  mode  for  host,
interrupts are not generated due to the corresponding bits set in
HCINTn.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAINTRMSK</name>
              <description>BNA  (Buffer  Not  Available)  Interrupt  mask  register  (BNAIntrMsk)
This bit is valid only when Scatter/Gather DMA mode is enabled.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESC_LST_ROLLINTRMSK</name>
              <description>Descriptor List rollover interrupt Mask register(DESC_LST_ROLLIntrMsk)
This bit is valid only when Scatter/Gather DMA mode is enabled.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCTSIZ0</name>
          <description>This register reflects the transfer size for the Host Channel.</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERSIZE</name>
              <description>Non-Scatter/Gather DMA Mode:

Transfer Size (XferSize)

For an OUT, this field is the number of data bytes the host sends during the transfer.

For an IN, this field is the buffer size that the application has Reserved for the transfer. The application is expected to program this field as an integer multiple of the maximum packet size for IN transactions (periodic and non-periodic).

The width of this counter is specified as Width of Transfer Size Counters during coreConsultant configuration (parameter OTG_TRANS_COUNT_WIDTH).

Scatter/Gather DMA Mode:

[18:16]: Reserved

[15:8]: NTD (Number of Transfer Descriptors)

(Non Isochronous)

This value is in terms of number of descriptors. Maximum number of descriptor that can be present in the list is 64. The values can be from 0 to 63.
 - 0: 1 descriptor
 - 63: 64 descriptors
This field indicates the total number of descriptors present in that list. The core wraps around after servicing NTD number of descriptors for that list.

(Isochronous)

This field indicates the number of descriptors present in that list microframe.

The possible values for FS are
 - 1: 2 descriptors
 - 3: 4 descriptors
 - 7: 8 descriptors
 - 15: 16 descriptors
 - 31: 32 descriptors
 - 63: 64 descriptors
The possible values for HS are
 - 7: 8 descriptors
 - 15: 16 descriptors
 - 31: 32 descriptors
 - 63: 64 descriptors
 - 127: 128 descriptors
 - 255: 256 descriptors
[7:0]: SCHED_INFO (Schedule information)

Every bit in this 8 bit register indicates scheduling for that microframe.

Bit 0 indicates scheduling for 1st microframe and bit 7 indicates scheduling for 8th microframe in that frame.

A value of 8'b11111111 indicates that the corresponding interrupt channel is scheduled to issue a token every microframe in that frame. A value of 8'b10101010 indicates that the corresponding interrupt channel is scheduled to issue a token every alternate microframe starting with second microframe. Note that this field is applicable only for periodic (Isochronous and Interrupt) channels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Non-Scatter/Gather DMA Mode:

Packet Count (PktCnt)

