esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
This field is set (reset) by the application to indicate that the OTG host must perform
a transfer in an odd (micro)Frame. This field is applicable for only periodic
(isochronous and interrupt) transactions.
 - 1'b0: Even (micro)Frame
 - 1'b1: Odd (micro)Frame</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHDIS</name>
              <description>Channel Disable (ChDis)

The application sets this bit to stop transmitting/receiving data
on a channel, even before the transfer for that channel is
complete. The application must wait for the Channel Disabled
interrupt before treating the channel as disabled.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHENA</name>
              <description>Channel Enable (ChEna)

When Scatter/Gather mode is enabled
 - 1'b0: Indicates that the descriptor structure is not yet ready.
 - 1'b1:  Indicates  that  the  descriptor  structure  and  data  buffer  with data is setup and this channel can access the descriptor.
When Scatter/Gather mode is disabled

 This field is set by the application and cleared by the OTG host.
 - 1'b0: Channel disabled
 - 1'b1: Channel enabled</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCSPLT15</name>
          <description>This register contains the Split characteristics of the Host Channel.</description>
          <addressOffset>0x6e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PRTADDR</name>
              <description>Port Address (PrtAddr)

This field is the port number of the recipient transaction translator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUBADDR</name>
              <description>Hub Address (HubAddr)

This field holds the device address of the transaction translator's hub.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XACTPOS</name>
              <description>Transaction Position (XactPos)

This field is used to determine whether to send all, first, middle, or last payloads with each OUT transaction.
 - 2'b11: All. This is the entire data payload is of this transaction (which is less than or equal to 188 bytes).
 - 2'b10: Begin. This is the first data payload of this transaction (which is larger than 188 bytes).
 - 2'b00: Mid. This is the middle payload of this transaction (which is larger than 188 bytes).
 - 2'b01: End. This is the last payload of this transaction (which is larger than 188 bytes).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPSPLT</name>
              <description>Do Complete Split (CompSplt)

The application sets this field to request the OTG host to perform a complete split transaction.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLTENA</name>
              <description>Split Enable (SpltEna)

The application sets this field to indicate that this channel is enabled to perform split transactions.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCINT15</name>
          <description>This register indicates the status of a channel with respect to USB- and AHB-related events. It is shown in the Interrupt Hierarchy figure in the databook. The application must read this register when the Host Channels Interrupt bit of the Core Interrupt register (GINTSTS.HChInt) is set. Before the application can read this register, it must first read the Host All Channels Interrupt (HAINT) register to get the exact channel number for the Host Channel-n Interrupt register. The application must clear the appropriate bit in this register to clear the corresponding bits in the HAINT and GINTSTS registers.</description>
          <addressOffset>0x6e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPL</name>
              <description>Transfer Completed (XferCompl)

Transfer completed normally without any errors.This bit can be set only by the core and the application must write 1 to clear it.
 - For Scatter/Gather DMA mode, it indicates that current descriptor processing got completed with IOC bit set in its descriptor.
 - In non Scatter/Gather DMA mode, it indicates that Transfer completed normally without any errors.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHHLTD</name>
              <description>Channel Halted (ChHltd)

In non Scatter/Gather DMA mode, it indicates the transfer completed abnormally either because of any USB transaction error or in response to disable request by the application or because of a completed transfer.

In Scatter/gather DMA mode, this indicates that transfer completed due to any of the following
 - EOL being set in descriptor
 - AHB error
 - Excessive transaction errors
 - Babble
 - Stall</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERR</name>
              <description>AHB Error (AHBErr)

This is generated only in Internal DMA mode when there is an AHB error during AHB read/write. The application can read the corresponding channel's DMA address register to get the error address. For details, see AHB Error Handling in the Programming Guide.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL Response Received Interrupt (STALL)

In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the core.This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK Response Received Interrupt (NAK)

In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the core.This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACK</name>
              <description>ACK Response Received/Transmitted Interrupt (ACK)

In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the core.This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NYET</name>
              <description>NYET Response Received Interrupt (NYET)

In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the core.This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XACTERR</name>
              <description>Transaction Error (XactErr)

Indicates one of the following errors occurred on the USB.
 - CRC check failure
 - Timeout
 - Bit stuff error
 - False EOP
In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the core.This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBLERR</name>
              <description>Babble Error (BblErr)

In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the core. This bit can be set only by the core and the application must write 1 to clear it.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRMOVRUN</name>
              <description>Frame Overrun (FrmOvrun).

In Scatter/Gather DMA mode, the interrupt due to this bit is masked
in the core. This bit can be set only by the core and the application must write 1 to clear
it.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATATGLERR</name>
              <description>Data Toggle Error (DataTglErr).This bit can be set only by the core and the application must write 1 to clear
it.In Scatter/Gather DMA mode, the interrupt due to this bit is masked
in the core.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAINTR</name>
              <description>BNA (Buffer Not Available) Interrupt (BNAIntr)

