esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
This field is programmed by the application with the expected number of packets to be transmitted (OUT) or received (IN).

The host decrements this count on every successful transmission or reception of an OUT/IN packet. Once this count reaches zero, the application is interrupted to indicate normal completion.

The width of this counter is specified as Width of Packet Counters during coreConsultant configuration (parameter OTG_PACKET_COUNT_WIDTH).

Scatter/Gather DMA Mode:

[28:19]: Reserved</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>PID (Pid)

The application programs this field with the type of PID to use for the initial transaction. The host maintains this field for the rest of the transfer.
 - 2'b00: DATA0
 - 2'b01: DATA2
 - 2'b10: DATA1
 - 2'b11: MDATA (non-control)/SETUP (control)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOPNG</name>
              <description>Do Ping (DoPng)

This bit is used only for OUT transfers.
Setting this field to 1 directs the host to do PING protocol.

Note: Do not set this bit for IN transfers. If this bit is set for IN transfers it disables the channel.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCDMA15</name>
          <description>This register is used by the OTG host in the internal DMA mode to maintain the current buffer pointer for IN/OUT transactions. The starting DMA address must be DWORD-aligned.</description>
          <addressOffset>0x6f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>In Buffer DMA Mode:

[31:0]: DMA Address (DMAAddr)

This field holds the start address in the external memory from which the data for the endpoint must be fetched or to which it must be stored. This register is incremented on every AHB transaction.

Reset: X if not programmed as the register is in SPRAM.

In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:

[31:9]: DMA Address (DMAAddr)

The start address must be 512-bytes aligned.

This field holds the start address of the 512 bytes page. The first descriptor in the list must be located in this address. The first descriptor may be or may not be ready. The core starts processing the list from the CTD value.

[8:3]: Current Transfer Desc(CTD)

This value is in terms of number of descriptors. The values can be from 0 to 63.
 - 0 -  1 descriptor.
 - 63 - 64 descriptors.
This field indicates the current descriptor processed in the list. This field is updated both by application and the core. For example, if the application enables the channel after programming CTD=5, then the core starts processing the sixth descriptor. The address is obtained by adding a value of (8bytes*5=) 40(decimal) to DMAAddr.

Reset: 6'h0

[2:0]: Reserved

In Scatter-Gather DMA (DescDMA) Mode for Isochronous:

[31:N]: DMA Address (DMAAddr)

The start address must be 512-bytes aligned.

This field holds the address of the 2*(nTD+1) bytes of locations in which the isochronous descriptors are present where N is based on nTD as follows:
 - [31:N]: Base Address
 - [N-1:3]: Offset
 - [2:0]: 000
For HS ISOC, if nTD is,
 - 7, N=6
 - 15, N=7
 - 31, N=8
 - 63, N=9
 - 127, N=10
 - 255, N=11
For FS ISOC, if nTD is,
 - 1, N=4
 - 3, N=5
 - 7, N=6
 - 15, N=7
 - 31, N=8
 - 63, N=9
[N-1:3]: Current Transfer Desc(CTD)

CTD for isochronous is based on the current frame/(micro)frame value. Need to be set to zero by application.

Reset: (N+1:3)'h0

[2:0]: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCDMAB15</name>
          <description>This register is present only in case of Scatter/Gather DMA. It is implemented in RAM instead of flop-based implementation. This register holds the current buffer address.</description>
          <addressOffset>0x6fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HCDMAB</name>
              <description>Holds the current buffer address.
This register is updated as and when the data transfer for the corresponding end point
is in progress. This register is present only in Scatter/Gather DMA mode. Otherwise this
field is reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFG</name>
          <description>This register configures the core in Device mode after power-on or after certain control commands or enumeration. Do not make changes to this register after initial programming.</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <resetValue>0x8020000</resetValue>
          <fields>
            <field>
              <name>DEVSPD</name>
              <description>Device Speed (DevSpd)

Indicates the speed at which the application requires the core to
enumerate, or the maximum speed the application can support.
However, the actual bus speed is determined only after the connect
sequence is completed, and is based on the speed of the USB
host to which the core is connected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NZSTSOUTHSHK</name>
              <description>Non-Zero-Length Status OUT Handshake (NZStsOUTHShk)

The application can use this field to select the handshake the core sends on receiving a nonzero-length data packet during the OUT transaction of a control transfer's Status stage.
 - 1'b1: Send a STALL handshake on a nonzero-length status OUT transaction and do not send the received OUT packet to the application.
 - 1'b0: Send the received OUT packet to the application (zerolength or nonzero-length) and send a handshake based on the NAK and STALL bits for the endpoint in the Device Endpoint Control register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENA32KHZSUSP</name>
              <description>Enable 32 KHz Suspend mode (Ena32KHzSusp)

