esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
Scatter/Gather DMA Mode (GAHBCFG.DMAEn=1,DCFG.DescDMA=1):

When this bit is enabled, the frame number field in the ISOC IN descriptor structure is interpreted as the last frame of the service interval.
In Scatter/Gather DMA mode, if this bit is enabled, the pending packets are flushed by the controller at the last frame of the service interval.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_TXVLD_CORR_DIS</name>
              <description>Disable the correction to OpMode/XcvrSel/TermSel on UTMI Interface.

When Soft disconnect (DCTL.SftDiscon=1'b1) is set by the application, the Device controller immediately changes the Opmode to Non-Driving (2'b01), XcvrSel to FS_XCVR (2'b01) and TermSel to HS_TERM (1'b1). If the Device controller is disconnected (DCTL.SftDiscon=1'b1) while transmitting a packet or a chirp, then the Device controller immediately changes the Opmode to Non-Driving (2'b01) while TxValid being High (1'b1). Certain PHYs may not respond to the TxValid by interpreting the change in OpMode to Non-Driving. The behavior of OpMode, XcvrSel and TermSel have been corrected to handle Soft disconnect during transmission. The application can set this register bit to 1'b1 to fall back to the original behavior of OpMode, XcvrSel, TermSel when Soft disconnect is set during transmission.

 - 1'b0: Opmode, XcvrSel, TermSel are changed by the Device Controller after TxValid goes LOW (1'b0). When this bit is set to 1'b0, the Device controller changes Opmode, XcvrSel and TermSel when TxVlaid is low after assertion of Soft Disconnect.
 - 1'b1: Opmode, XcvrSel, TermSel are changed by the Device Controller immediately. When this bit is set to 1'b1, the Device controller changes Opmode, XcvrSel and TermSel immediately after assertion of Soft Disconnect.

Note: The application must program this register during Device Initialization before USB Reset and this value cannot be changed afterwards.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_TERMSEL_CORR_DIS</name>
              <description>Disable the correction of TermSel on UTMI Interface.

When the application sets Soft disconnect (DCTL.SftDiscon=1'b1), the behavior of TermSel has been corrected to drive the valid combination of XcvrSel (FS_XCVR) and TermSel (FS_TERM). The application can set this register bit to 1'b1 to fall back to the original behavior of the Device controller driving XcvrSel (FS_XCVR) and TermSel (HS_TERM) when Soft disconnect is set (DCTL.SftDiscon=1'b1).

 - 1'b0: Valid Combination of XcvrSel and TermSel is driven by the Device Controller. When this bit is set to 1'b0, the Device controller drives TermSel to 1 upon assertion of Soft Disconnect which enables FS Termination.
 - 1'b1: Invalid Combination of XcvrSel and TermSel is driven by the Device Controller. When this bit is set to 1'b1, the Device controller drives TermSel to 0 upon assertion of Soft Disconnect which enables HS Termination.

Note: The application must program this register during Device Initialization before USB Reset and this value cannot be changed afterwards.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTS</name>
          <description>This register indicates the status of the core with respect to USB-related events. It must be read on interrupts from Device All Interrupts (DAINT) register.</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>SUSPSTS</name>
              <description>Suspend Status (SuspSts)

In Device mode, this bit is set as long as a Suspend condition is
detected on the USB. The core enters the Suspend state
when there is no activity on the phy_line_state_i signal for an
extended period of time. The core comes out of the suspend under the following conditions :
 - If there is any activity on the phy_line_state_i signal, or
 - If the application writes to the Remote Wakeup Signaling bit in the Device Control register (DCTL.RmtWkUpSig).
When the core comes out of the suspend, this bit is set to 1'b0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENUMSPD</name>
              <description>Enumerated Speed (EnumSpd)

Indicates the speed at which the controller has come up
after speed detection through a connect or reset sequence.
 - 2'b00: High speed (PHY clock is running at 30 or 60 MHz)
 - 2'b01: Full speed (PHY clock is running at 30 or 60 MHz)
 - 2'b10: Low speed (PHY clock is running at 6 MHz)
 - 2'b11: Full speed (PHY clock is running at 48 MHz)
Low speed is not supported for devices using a UTMI+ PHY.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRTICERR</name>
              <description>Erratic Error (ErrticErr)

The core sets this bit to report any erratic errors
(phy_rxvalid_i/phy_rxvldh_i or phy_rxactive_i is asserted for at least 2 ms, due to PHY error) seen on the UTMI+.
Due to erratic errors, the core goes into Suspended state and an interrupt is generated to the application with Early Suspend bit of the Core Interrupt register (GINTSTS.ErlySusp).
If the early suspend is asserted due to an erratic error, the application must perform a PHY reset followed by a soft reset to controller.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOFFN</name>
              <description>Frame or Microframe Number of the Received SOF  (SOFFN)

When the core is operating at high speed, this field contains a microframe number. When the core is operating at full or low speed, this field contains a Frame number.

Note: This register may return a non-zero value if read immediately after power-on reset.
In case the register bit reads non-zero immediately after power-on reset, it does not
indicate that SOF has been received from the host. The read value of this interrupt is
valid only after a valid connection between host and device is established.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEVLNSTS</name>
              <description>Device Line Status (DevLnSts)

Indicates the current logic level USB data lines
 - DevLnSts[1]: Logic level of D+
 - DevLnSts[0]: Logic level of D-</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPMSK</name>
          <description>This register works with each of the Device IN Endpoint Interrupt (DIEPINTn) registers for all endpoints to generate an interrupt per IN endpoint. The IN endpoint interrupt for a specific status in the DIEPINTn register can be masked by writing to the corresponding bit in this register. Status bits are masked by default.</description>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUTMSK</name>
              <description>Timeout Condition Mask (TimeOUTMsk) (Non-isochronous endpoints)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMPMSK</name>
              <description>IN Token Received When TxFIFO Empty Mask (INTknTXFEmpMsk)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNEPMISMSK</name>
              <description>IN Token received with EP Mismatch Mask (INTknEPMisMsk)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNAKEFFMSK</name>
              <description>IN Endpoint NAK Effective Mask (INEPNakEffMsk)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFOUNDRNMSK</name>
              <description>Fifo Underrun Mask (TxfifoUndrnMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAININTRMSK</name>
              <description>BNA interrupt Mask (BNAInIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPMSK</name>
          <description>This register works with each of the Device OUT Endpoint Interrupt (DOEPINTn) registers for all endpoints to generate an interrupt per OUT endpoint. The OUT endpoint interrupt for a specific status in the DOEPINTn register can be masked by writing into the corresponding bit in this register. Status bits are masked by default.</description>
          <addressOffset>0x814</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETUPMSK</name>
              <description>SETUP Phase Done Mask (SetUPMsk)

