esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
Applies to control endpoints only.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTTKNEPDISMSK</name>
              <description>OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)

Applies to control OUT endpoints only.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STSPHSERCVDMSK</name>
              <description>Status Phase Received Mask (StsPhseRcvdMsk)

Applies to control OUT endpoints only.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACK2BACKSETUP</name>
              <description>Back-to-Back SETUP Packets Received Mask (Back2BackSETup)

Applies to control OUT endpoints only.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPKTERRMSK</name>
              <description>OUT Packet Error Mask (OutPktErrMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAOUTINTRMSK</name>
              <description>BNA interrupt Mask (BnaOutIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBLEERRMSK</name>
              <description>Babble Error interrupt Mask (BbleErrMsk)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NYETMSK</name>
              <description>NYET interrupt Mask (NYETMsk)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DAINT</name>
          <description>When a significant event occurs on an endpoint, a Device All Endpoints Interrupt register interrupts the application using the Device OUT Endpoints Interrupt bit or Device IN Endpoints Interrupt bit of the Core Interrupt register (GINTSTS.OEPInt or GINTSTS.IEPInt, respectively). This is shown in Figure 5-2. There is one interrupt bit per endpoint, up to a maximum of 16 bits for OUT endpoints and 16 bits for IN endpoints. For a bidirectional endpoint, the corresponding IN and OUT interrupt bits are used. Bits in this register are set and cleared when the application sets and clears bits in the corresponding Device Endpoint-n Interrupt register (DIEPINTn/DOEPINTn).</description>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INEPINT0</name>
              <description>IN Endpoint 0 Interrupt Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT1</name>
              <description>IN Endpoint 1 Interrupt Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT2</name>
              <description>IN Endpoint 2 Interrupt Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT3</name>
              <description>IN Endpoint 3 Interrupt Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT4</name>
              <description>IN Endpoint 4 Interrupt Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT5</name>
              <description>IN Endpoint 5 Interrupt Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT6</name>
              <description>IN Endpoint 6 Interrupt Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT7</name>
              <description>IN Endpoint 7 Interrupt Bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT8</name>
              <description>IN Endpoint 8 Interrupt Bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT9</name>
              <description>IN Endpoint 9 Interrupt Bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT10</name>
              <description>IN Endpoint 10 Interrupt Bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT11</name>
              <description>IN Endpoint 11 Interrupt Bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT12</name>
              <description>IN Endpoint 12 Interrupt Bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT13</name>
              <description>IN Endpoint 13 Interrupt Bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT14</name>
              <description>IN Endpoint 14 Interrupt Bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPINT15</name>
              <description>IN Endpoint 15 Interrupt Bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT0</name>
              <description>OUT Endpoint 0 Interrupt Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT1</name>
              <description>OUT Endpoint 1 Interrupt Bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT2</name>
              <description>OUT Endpoint 2 Interrupt Bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT3</name>
              <description>OUT Endpoint 3 Interrupt Bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT4</name>
              <description>OUT Endpoint 4 Interrupt Bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT5</name>
              <description>OUT Endpoint 5 Interrupt Bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT6</name>
              <description>OUT Endpoint 6 Interrupt Bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT7</name>
              <description>OUT Endpoint 7 Interrupt Bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT8</name>
              <description>OUT Endpoint 8 Interrupt Bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT9</name>
              <description>OUT Endpoint 9 Interrupt Bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT10</name>
              <description>OUT Endpoint 10 Interrupt Bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT11</name>
              <description>OUT Endpoint 11 Interrupt Bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT12</name>
              <description>OUT Endpoint 12 Interrupt Bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT13</name>
              <description>OUT Endpoint 13 Interrupt Bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT14</name>
              <description>OUT Endpoint 14 Interrupt Bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEPINT15</name>
              <description>OUT Endpoint 15 Interrupt Bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DAINTMSK</name>
          <description>The Device Endpoint Interrupt Mask register works with the Device Endpoint Interrupt register to interrupt the application when an event occurs on a device endpoint. However, the Device All Endpoints Interrupt (DAINT) register bit corresponding to that interrupt is still set.</description>
          <addressOffset>0x81c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INEPMSK0</name>
              <description>IN Endpoint 0 Interrupt mask Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK1</name>
              <description>IN Endpoint 1 Interrupt mask Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK2</name>
              <description>IN Endpoint 2 Interrupt mask Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK3</name>
              <description>IN Endpoint 3 Interrupt mask Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK4</name>
              <description>IN Endpoint 4 Interrupt mask Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK5</name>
              <description>IN Endpoint 5 Interrupt mask Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK6</name>
              <description>IN Endpoint 6 Interrupt mask Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK7</name>
              <description>IN Endpoint 7 Interrupt mask Bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK8</name>
              <description>IN Endpoint 8 Interrupt mask Bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK9</name>
              <description>IN Endpoint 9 Interrupt mask Bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK10</name>
              <description>IN Endpoint 10 Interrupt mask Bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK11</name>
              <description>IN Endpoint 11 Interrupt mask Bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK12</name>
              <description>IN Endpoint 12 Interrupt mask Bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK13</name>
              <description>IN Endpoint 13 Interrupt mask Bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK14</name>
              <description>IN Endpoint 14 Interrupt mask Bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPMSK15</name>
              <description>IN Endpoint 15 Interrupt mask Bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK0</name>
              <description>OUT Endpoint 0 Interrupt mask Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK1</name>
              <description>OUT Endpoint 1 Interrupt mask Bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK2</name>
              <description>OUT Endpoint 2 Interrupt mask Bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK3</name>
              <description>OUT Endpoint 3 Interrupt mask Bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK4</name>
              <description>OUT Endpoint 4 Interrupt mask Bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK5</name>
              <description>OUT Endpoint 5 Interrupt mask Bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK6</name>
              <description>OUT Endpoint 6 Interrupt mask Bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK7</name>
              <description>OUT Endpoint 7 Interrupt mask Bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK8</name>
              <description>OUT Endpoint 8 Interrupt mask Bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK9</name>
              <description>OUT Endpoint 9 Interrupt mask Bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK10</name>
              <description>OUT Endpoint 10 Interrupt mask Bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK11</name>
              <description>OUT Endpoint 11 Interrupt mask Bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK12</name>
              <description>OUT Endpoint 12 Interrupt mask Bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK13</name>
              <description>OUT Endpoint 13 Interrupt mask Bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK14</name>
              <description>OUT Endpoint 14 Interrupt mask Bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPMSK15</name>
              <description>OUT Endpoint 15 Interrupt mask Bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVBUSDIS</name>
          <description>This register specifies the VBUS discharge time after VBUS pulsing during SRP.</description>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <resetValue>0x17d7</resetValue>
          <fields>
            <field>
              <name>DVBUSDIS</name>
              <description>Device VBUS Discharge Time (DVBUSDis)

Specifies the VBUS discharge time after VBUS pulsing during SRP. This value equals (VBUS discharge time in PHY clocks) / 1, 024.

The value you use depends whether the PHY is operating at 30MHz (16-bit data width) or 60 MHz (8-bit data width).

