esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
Depending on your VBUS load, this value can need adjustment.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVBUSPULSE</name>
          <description>This register contains the VBUS pulsing time during SRP.</description>
          <addressOffset>0x82c</addressOffset>
          <size>32</size>
          <resetValue>0x5b8</resetValue>
          <fields>
            <field>
              <name>DVBUSPULSE</name>
              <description>Device VBUS Pulsing Time (DVBUSPulse)

Specifies the VBUS pulsing time during SRP. This value equals (VBUS pulsing time in PHY clocks) / 1, 024

The value you use depends whether the PHY is operating at 30MHz (16-bit data width) or 60 MHz (8-bit data width).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTHRCTL</name>
          <description>This register contains the Receive and Transmit Threshold characteristics of the Device controller.</description>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <resetValue>0x8100020</resetValue>
          <fields>
            <field>
              <name>NONISOTHREN</name>
              <description>Non-ISO IN Endpoints Threshold Enable. (NonISOThrEn)

When this bit is Set, the core enables thresholding for Non Isochronous IN endpoints.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISOTHREN</name>
              <description>ISO IN Endpoints Threshold Enable. (ISOThrEn)

 When this bit is Set, the core enables thresholding for isochronous IN
endpoints.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXTHRLEN</name>
              <description>Transmit Threshold Length (TxThrLen)

This field specifies Transmit thresholding size in DWORDS. This also forms
the MAC threshold and specifies the amount of data in bytes to be in the
corresponding endpoint transmit FIFO, before the core can start transmit
on the USB. The threshold length has to be at least eight DWORDS when the
value of AHBThrRatio is 2'h00. In case the AHBThrRatio is non zero the
application needs to ensure that the AHB Threshold value does not go below
the recommended eight DWORD.  This field controls both isochronous and
non-isochronous IN endpoint thresholds. The recommended value for ThrLen
is to be the same as the programmed AHB Burst Length (GAHBCFG.HBstLen).

Note:
 - When OTG_ARCHITECTURE=0, the reset value of this register field is 0.
 - When OTG_ARCHITECTURE=2, the reset value of this register field is 8.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBTHRRATIO</name>
              <description>AHB Threshold Ratio (AHBThrRatio)

These bits define the ratio between the AHB threshold and the MAC threshold for the
transmit path only. The AHB threshold always remains less than or equal to the USB
threshold, because this does not increase overhead. Both the AHB and the MAC
threshold must be DWORD-aligned. The application needs to program TxThrLen and the
AHBThrRatio to make the AHB Threshold value DWORD aligned. If the AHB threshold
value is not DWORD aligned, the core might not behave correctly. When programming
the TxThrLen and AHBThrRatio, the application must ensure that the minimum AHB
threshold value does not go below 8 DWORDS to meet the USB turnaround time
requirements.
 - 2'b00: AHB threshold = MAC threshold
 - 2'b01: AHB threshold = MAC threshold / 2
 - 2'b10: AHB threshold = MAC threshold / 4
 - 2'b11: AHB threshold = MAC threshold / 8</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTHREN</name>
              <description>Receive Threshold Enable (RxThrEn)

When this bit is set, the core enables thresholding in the receive direction.

Note: We recommends that you do not enable RxThrEn, because it may cause issues in the RxFIFO especially during error conditions such as RxError and Babble.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTHRLEN</name>
              <description>Receive Threshold Length (RxThrLen)

This field specifies Receive thresholding size in DWORDS.
This field also specifies the amount of data received on the USB before the core can start transmitting on the AHB.
The threshold length has to be at least eight DWORDS.
The recommended value for ThrLen is to be the same as the programmed
AHB Burst Length (GAHBCFG.HBstLen).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBPRKEN</name>
              <description>Arbiter Parking Enable (ArbPrkEn)

This bit controls internal DMA arbiter parking for IN endpoints. If thresholding is enabled and this bit is set to one, then the arbiter parks on the IN endpoint for which there is a token received on the USB. This is done to avoid getting into underrun conditions. By default, arbiter parking is enabled.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPEMPMSK</name>
          <description>This register is valid only in Dedicated FIFO operation (OTG_EN_DED_TX_FIFO = 1). This register is used to control the IN endpoint FIFO empty interrupt generation (DIEPINTn.TxfEmp).</description>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INEPTXFEMPMSK</name>
              <description>IN EP Tx FIFO Empty Interrupt Mask Bits (InEpTxfEmpMsk)

These bits acts as mask bits for DIEPINTn.TxFEmp interrupt, one bit per IN Endpoint:

Bit 0 for IN EP 0, bit 15 for IN EP 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEACHINT</name>
          <description>This register is available in device mode and only when parameter OTG_MULTI_PROC_INTRPT on page 121=1. There is one interrupt bit per endpoint, up to a maximum of 16 bits for OUT endpoints and 16 bits for IN endpoints. For a bidirectional endpoint, the corresponding IN and OUT interrupt bits are used. Bits in this register are set and cleared when the application sets and clears bits in the corresponding Device Endpoint-n Interrupt register (DIEPINTn/DOEPINTn). The interrupt is automatically cleared once the DOEPINTn/DIEPINTn interrupt is cleared by the application.</description>
          <addressOffset>0x838</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ECHINEPINT</name>
              <description>Each IN Endpoint Interrupt Bits (EchInEpInt)

One bit per IN Endpoint:

