esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
Bit 0 for IN endpoint 0, bit 15 for endpoint 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECHOUTEPINT</name>
              <description>Each OUT Endpoint Interrupt Bits (EchOutEPInt)

One bit per OUT endpoint:

Bit 16 for OUT endpoint 0, bit 31 for OUT endpoint 15</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEACHINTMSK</name>
          <description>This register is available only when parameter OTG_MULTI_PROC_INTRPT=1. The Device Each Endpoint Interrupt Mask register works with the Device Each Endpoint Interrupt register to interrupt the application when an event occurs on a device endpoint. However, the Device Each Endpoints Interrupt (DEACHINT) register bit corresponding to that interrupt remains set.</description>
          <addressOffset>0x83c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ECHINEPMSK0</name>
              <description>IN EP0 Interrupt Mask Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK1</name>
              <description>IN EP1 Interrupt Mask Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK2</name>
              <description>IN EP2 Interrupt Mask Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK3</name>
              <description>IN EP3 Interrupt Mask Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK4</name>
              <description>IN EP4 Interrupt Mask Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK5</name>
              <description>IN EP5 Interrupt Mask Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK6</name>
              <description>IN EP6 Interrupt Mask Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK7</name>
              <description>IN EP7 Interrupt Mask Bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK8</name>
              <description>IN EP8 Interrupt Mask Bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK9</name>
              <description>IN EP9 Interrupt Mask Bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK10</name>
              <description>IN EP10 Interrupt Mask Bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK11</name>
              <description>IN EP11 Interrupt Mask Bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK12</name>
              <description>IN EP12 Interrupt Mask Bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK13</name>
              <description>IN EP13 Interrupt Mask Bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK14</name>
              <description>IN EP14 Interrupt Mask Bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHINEPMSK15</name>
              <description>IN EP15 Interrupt Mask Bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK0</name>
              <description>OUT EP0 Interrupt Mask Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK1</name>
              <description>OUT EP1 Interrupt Mask Bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK2</name>
              <description>OUT EP2 Interrupt Mask Bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK3</name>
              <description>OUT EP3 Interrupt Mask Bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK4</name>
              <description>OUT EP4 Interrupt Mask Bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK5</name>
              <description>OUT EP5 Interrupt Mask Bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK6</name>
              <description>OUT EP6 Interrupt Mask Bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK7</name>
              <description>OUT EP7 Interrupt Mask Bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK8</name>
              <description>OUT EP8 Interrupt Mask Bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK9</name>
              <description>OUT EP9 Interrupt Mask Bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK10</name>
              <description>OUT EP10 Interrupt Mask Bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK11</name>
              <description>OUT EP11 Interrupt Mask Bits</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK12</name>
              <description>OUT EP12 Interrupt Mask Bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK13</name>
              <description>OUT EP13 Interrupt Mask Bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK14</name>
              <description>OUT EP14 Interrupt Mask Bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECHOUTEPMSK15</name>
              <description>OUT EP15 Interrupt Mask Bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPEACHMSK0</name>
          <description>This register is available in device mode and only when parameter OTG_MULTI_PROC_INTRPT on page 121=1. These registers are endpoint-specific mask registers for (DIEPINTn). The IN endpoint interrupt for a specific status in the DIEPINTn register can be masked by writing 0 to the corresponding bit in this register. Status bits are masked by default.  - Mask interrupt: 1'b0  - Unmask interrupt: 1'b1</description>
          <addressOffset>0x840</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUTMSK</name>
              <description>Timeout Condition Mask (TimeOUTMsk) (Non-isochronous endpoints)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMPMSK</name>
              <description>IN Token Received When TxFIFO Empty Mask (INTknTXFEmpMsk)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNEPMISMSK</name>
              <description>IN Token received with EP Mismatch Mask (INTknEPMisMsk)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNAKEFFMSK</name>
              <description>IN Endpoint NAK Effective Mask (INEPNakEffMsk)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFOUNDRNMSK</name>
              <description>Fifo Underrun Mask (TxfifoUndrnMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAININTRMSK</name>
              <description>BNA interrupt Mask (BNAInIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPEACHMSK1</name>
          <description>This register contains the interrupts for the IN Endpoints of the Device controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x844</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUTMSK</name>
              <description>Timeout Condition Mask (TimeOUTMsk)
(Non-isochronous endpoints)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMPMSK</name>
              <description>IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNEPMISMSK</name>
              <description>IN Token received with EP Mismatch Mask (INTknEPMisMsk)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNAKEFFMSK</name>
              <description>IN Endpoint NAK Effective Mask (INEPNakEffMsk)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFOUNDRNMSK</name>
              <description>Fifo Underrun Mask (TxfifoUndrnMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAININTRMSK</name>
              <description>BNA interrupt Mask (BNAInIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPEACHMSK2</name>
          <description>This register contains the interrupts for the IN Endpoints of the Device controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x848</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUTMSK</name>
              <description>Timeout Condition Mask (TimeOUTMsk)
(Non-isochronous endpoints)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMPMSK</name>
              <description>IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNEPMISMSK</name>
              <description>IN Token received with EP Mismatch Mask (INTknEPMisMsk)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNAKEFFMSK</name>
              <description>IN Endpoint NAK Effective Mask (INEPNakEffMsk)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFOUNDRNMSK</name>
              <description>Fifo Underrun Mask (TxfifoUndrnMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAININTRMSK</name>
              <description>BNA interrupt Mask (BNAInIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPEACHMSK3</name>
          <description>This register contains the interrupts for the IN Endpoints of the Device controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x84c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUTMSK</name>
              <description>Timeout Condition Mask (TimeOUTMsk)
(Non-isochronous endpoints)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMPMSK</name>
              <description>IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNEPMISMSK</name>
              <description>IN Token received with EP Mismatch Mask (INTknEPMisMsk)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNAKEFFMSK</name>
              <description>IN Endpoint NAK Effective Mask (INEPNakEffMsk)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFOUNDRNMSK</name>
              <description>Fifo Underrun Mask (TxfifoUndrnMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAININTRMSK</name>
              <description>BNA interrupt Mask (BNAInIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
