esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
        <register>
          <name>DIEPEACHMSK11</name>
          <description>This register contains the interrupts for the IN Endpoints of the Device controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x86c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUTMSK</name>
              <description>Timeout Condition Mask (TimeOUTMsk)
(Non-isochronous endpoints)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMPMSK</name>
              <description>IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNEPMISMSK</name>
              <description>IN Token received with EP Mismatch Mask (INTknEPMisMsk)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNAKEFFMSK</name>
              <description>IN Endpoint NAK Effective Mask (INEPNakEffMsk)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFOUNDRNMSK</name>
              <description>Fifo Underrun Mask (TxfifoUndrnMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAININTRMSK</name>
              <description>BNA interrupt Mask (BNAInIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPEACHMSK12</name>
          <description>This register contains the interrupts for the IN Endpoints of the Device controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x870</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUTMSK</name>
              <description>Timeout Condition Mask (TimeOUTMsk)
(Non-isochronous endpoints)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMPMSK</name>
              <description>IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNEPMISMSK</name>
              <description>IN Token received with EP Mismatch Mask (INTknEPMisMsk)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNAKEFFMSK</name>
              <description>IN Endpoint NAK Effective Mask (INEPNakEffMsk)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFOUNDRNMSK</name>
              <description>Fifo Underrun Mask (TxfifoUndrnMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAININTRMSK</name>
              <description>BNA interrupt Mask (BNAInIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPEACHMSK13</name>
          <description>This register contains the interrupts for the IN Endpoints of the Device controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x874</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUTMSK</name>
              <description>Timeout Condition Mask (TimeOUTMsk)
(Non-isochronous endpoints)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMPMSK</name>
              <description>IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNEPMISMSK</name>
              <description>IN Token received with EP Mismatch Mask (INTknEPMisMsk)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNAKEFFMSK</name>
              <description>IN Endpoint NAK Effective Mask (INEPNakEffMsk)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFOUNDRNMSK</name>
              <description>Fifo Underrun Mask (TxfifoUndrnMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAININTRMSK</name>
              <description>BNA interrupt Mask (BNAInIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPEACHMSK14</name>
          <description>This register contains the interrupts for the IN Endpoints of the Device controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x878</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUTMSK</name>
              <description>Timeout Condition Mask (TimeOUTMsk)
(Non-isochronous endpoints)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMPMSK</name>
              <description>IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNEPMISMSK</name>
              <description>IN Token received with EP Mismatch Mask (INTknEPMisMsk)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNAKEFFMSK</name>
              <description>IN Endpoint NAK Effective Mask (INEPNakEffMsk)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFOUNDRNMSK</name>
              <description>Fifo Underrun Mask (TxfifoUndrnMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAININTRMSK</name>
              <description>BNA interrupt Mask (BNAInIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPEACHMSK15</name>
          <description>This register contains the interrupts for the IN Endpoints of the Device controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x87c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUTMSK</name>
              <description>Timeout Condition Mask (TimeOUTMsk)
(Non-isochronous endpoints)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMPMSK</name>
              <description>IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNEPMISMSK</name>
              <description>IN Token received with EP Mismatch Mask (INTknEPMisMsk)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNAKEFFMSK</name>
              <description>IN Endpoint NAK Effective Mask (INEPNakEffMsk)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFOUNDRNMSK</name>
              <description>Fifo Underrun Mask (TxfifoUndrnMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAININTRMSK</name>
              <description>BNA interrupt Mask (BNAInIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPEACHMSK0</name>
          <description>This register is available in device mode and only when parameter OTG_MULTI_PROC_INTRPT=1. These registers are endpoint specific mask registers for (DOEPINTn). The OUT endpoint interrupt for a specific status in the DOEPINTn register can be masked by writing 0 to the corresponding bit in this register. Status bits are masked by default.</description>
          <addressOffset>0x880</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETUPMSK</name>
              <description>SETUP Phase Done Mask (SetUPMsk)

