esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
Applies to control endpoints only.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTTKNEPDISMSK</name>
              <description>OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)

Applies to control OUT endpoints only.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STSPHSRCVDMSK</name>
              <description>Status Phase Received Mask (StsPhsRcvdMsk)

Applies to control OUT endpoints only.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACK2BACKSETUP</name>
              <description>Back-to-Back SETUP Packets Received Mask (Back2BackSETup)

Applies to control OUT endpoints only.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPKTERRMSK</name>
              <description>OUT Packet Error Mask (OutPktErrMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAOUTINTRMSK</name>
              <description>BNA interrupt Mask (BnaOutIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBLEERRMSK</name>
              <description>Babble Error interrupt Mask (BbleErrMsk)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NYETMSK</name>
              <description>NYET interrupt Mask (NYETMsk)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPEACHMSK3</name>
          <description>This register contains the interrupts for the OUT Endpoints of the Device controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x88c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETUPMSK</name>
              <description>SETUP Phase Done Mask (SetUPMsk)

Applies to control endpoints only.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTTKNEPDISMSK</name>
              <description>OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)

Applies to control OUT endpoints only.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STSPHSRCVDMSK</name>
              <description>Status Phase Received Mask (StsPhsRcvdMsk)

Applies to control OUT endpoints only.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACK2BACKSETUP</name>
              <description>Back-to-Back SETUP Packets Received Mask (Back2BackSETup)

Applies to control OUT endpoints only.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPKTERRMSK</name>
              <description>OUT Packet Error Mask (OutPktErrMsk)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAOUTINTRMSK</name>
              <description>BNA interrupt Mask (BnaOutIntrMsk)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBLEERRMSK</name>
              <description>Babble Error interrupt Mask (BbleErrMsk)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK interrupt Mask (NAKMsk)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NYETMSK</name>
              <description>NYET interrupt Mask (NYETMsk)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPEACHMSK4</name>
          <description>This register contains the interrupts for the OUT Endpoints of the Device controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x890</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Interrupt Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLDMSK</name>
              <description>Endpoint Disabled Interrupt Mask (EPDisbldMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error (AHBErrMsk)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETUPMSK</name>
              <description>SETUP Phase Done Mask (SetUPMsk)

