esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
The application must program this field with the maximum packet size for the current logical endpoint.
 - 2'b00: 64 bytes
 - 2'b01: 32 bytes
 - 2'b10: 16 bytes
 - 2'b11: 8 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBACTEP</name>
              <description>USB Active Endpoint (USBActEP)

This bit is always SET to 1, indicating that control endpoint 0 is always active in all configurations and interfaces.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAK Status (NAKSts)

Indicates the following:
 - 1'b0: The core is transmitting non-NAK handshakes based on the FIFO status
 - 1'b1: The core is transmitting NAK handshakes on this endpoint.
When this bit is set, either by the application or core, the core stops
transmitting data, even If there is data available in the TxFIFO.
Irrespective of this bit's setting, the core always responds to SETUP data
packets with an ACK handshake.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type (EPType)

Hardcoded to 00 for control.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL Handshake (Stall)

The application can only set this bit, and the core clears it, when a
SETUP token is received for this endpoint. If a NAK bit, Global Nonperiodic
IN NAK, or Global OUT NAK is set along with this bit, the STALL
bit takes priority.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TxFIFO Number (TxFNum)
 - For Shared FIFO operation, this value is always set to 0, indicating that control IN endpoint 0 data is always written in the Non-Periodic Transmit FIFO.
 - For Dedicated FIFO operation, this value is set to the FIFO number that is assigned to IN Endpoint.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNAK</name>
              <description>Clear NAK (CNAK)
A write to this bit clears the NAK bit for the endpoint.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNAK</name>
              <description>Set NAK (SNAK)
A write to this bit sets the NAK bit for the endpoint.
Using this bit, the application can control the transmission of NAK
handshakes on an endpoint. The core can also set this bit for an
endpoint after a SETUP packet is received on that endpoint.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDIS</name>
              <description>Endpoint Disable (EPDis)

The application sets this bit to stop transmitting data on an endpoint,
even before the transfer for that endpoint is complete. The application
must wait for the Endpoint Disabled interrupt before treating the endpoint
as disabled. The core clears this bit before setting the Endpoint Disabled
Interrupt. The application must Set this bit only if Endpoint Enable is
already set for this endpoint.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint Enable (EPEna)

When Scatter/Gather DMA mode is enabled for IN endpoints, this bit indicates that the descriptor structure and data buffer with data ready to transmit is setup.

 When Scatter/Gather DMA mode is disabled (such as in buffer pointer based DMA mode) this bit indicates that data is ready to be transmitted on the endpoint.
The core clears this bit before setting the following interrupts on this endpoint:
 - Endpoint Disabled
 - Transfer Completed</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT0</name>
          <description>This register indicates the status of an endpoint with respect to USB- and AHB-related events. It is shown in the Interrupt Hierarchy figure in the databook. The application must read this register when the OUT Endpoints Interrupt bit or IN Endpoints Interrupt bit of the Core Interrupt register (GINTSTS.OEPInt or GINTSTS.IEPInt, respectively) is set. Before the application can read this register, it must first read the Device All Endpoints Interrupt (DAINT) register to get the exact endpoint number for the Device Endpoint-n Interrupt register. The application must clear the appropriate bit in this register to clear the corresponding bits in the DAINT and GINTSTS registers</description>
          <addressOffset>0x908</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>XFERCOMPL</name>
              <description>Transfer Completed Interrupt (XferCompl)

Applies to IN and OUT endpoints.
 - When Scatter/Gather DMA mode is enabled
 -- For IN endpoint this field indicates that the requested data from the descriptor is moved from external system memory to internal FIFO.
 -- For OUT endpoint this field indicates that the requested data from the internal FIFO is moved to external system memory. This interrupt is generated only when the corresponding endpoint descriptor is closed, and the IOC bit for the corresponding descriptor is set.
 - When Scatter/Gather DMA mode is disabled, this field indicates that the programmed transfer is complete on the AHB as well as on the USB, for this endpoint.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLD</name>
              <description>Endpoint Disabled Interrupt (EPDisbld)

Applies to IN and OUT endpoints.

This bit indicates that the endpoint is disabled per the application's request.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERR</name>
              <description>AHB Error (AHBErr)

Applies to IN and OUT endpoints.

This is generated only in Internal DMA mode when there is an AHB error during an AHB read/write. The application can read the corresponding endpoint DMA address register to get the error address. For details, see AHB Error Handling in the Programming Guide.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout Condition (TimeOUT)
 - In shared TX FIFO mode, applies to non-isochronous IN endpoints only.
 - In dedicated FIFO mode, applies only to Control IN endpoints.
 - In Scatter/Gather DMA mode, the TimeOUT interrupt is not asserted.
Indicates that the core has detected a timeout condition on the USB for the last IN token on this endpoint.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMP</name>
              <description>IN Token Received When TxFIFO is Empty (INTknTXFEmp)

