esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
Applies to non-periodic IN endpoints only.

Indicates that an IN token was received when the associated TxFIFO (periodic/non-periodic) was empty. This interrupt is asserted on the endpoint for which the IN token was received.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNEPMIS</name>
              <description>IN Token Received with EP Mismatch (INTknEPMis)

Applies to non-periodic IN endpoints only.

Indicates that the data in the top of the non-periodic TxFIFO belongs to an endpoint other than the one for which the IN token was received. This interrupt is asserted on the endpoint for which the IN token was received.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNAKEFF</name>
              <description>IN Endpoint NAK Effective (INEPNakEff)

Applies to periodic IN endpoints only.

This bit can be cleared when the application clears the IN endpoint NAK by writing to DIEPCTLn.CNAK.

This interrupt indicates that the core has sampled the NAK bit

Set (either by the application or by the core).

The interrupt indicates that the IN endpoint NAK bit Set by the application has taken effect in the core.

This interrupt does not guarantee that a NAK handshake is sent on the USB. A STALL bit takes priority over a NAK bit.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFEMP</name>
              <description>Transmit FIFO Empty (TxFEmp)

This bit is valid only for IN Endpoints

This interrupt is asserted when the TxFIFO for this endpoint is either half or completely empty. The half or completely empty status is determined by the TxFIFO Empty Level bit in the Core AHB Configuration register (GAHBCFG.NPTxFEmpLvl)).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFIFOUNDRN</name>
              <description>Fifo Underrun (TxfifoUndrn)

Applies to IN endpoints only.

The core generates this interrupt when it detects a transmit FIFO underrun condition in threshold mode for this endpoint.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAINTR</name>
              <description>BNA (Buffer Not Available) Interrupt (BNAIntr)

This bit is valid only when Scatter/Gather DMA mode is enabled. The core generates this interrupt when the descriptor accessed is not ready for the Core to process, such as Host busy or DMA done.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTDRPSTS</name>
              <description>Packet Drop Status (PktDrpSts)

This bit indicates to the application that an ISOC OUT packet has been dropped. This bit does not have an associated mask bit and does not generate an interrupt.

Dependency: This bit is valid in non Scatter/Gather DMA mode when periodic transfer interrupt feature is selected.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBLEERR</name>
              <description>NAK Interrupt (BbleErr)

The core generates this interrupt when babble is received for the endpoint.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKINTRPT</name>
              <description>NAK Interrupt (NAKInterrupt)

The core generates this interrupt when a NAK is transmitted or received by the device.
&lt;brIn case of isochronous IN endpoints the interrupt gets generated when a zero length packet is transmitted due to un-availability of data in the TXFifo.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NYETINTRPT</name>
              <description>NYET Interrupt (NYETIntrpt)

The core generates this interrupt when a NYET response is transmitted for a non isochronous OUT endpoint.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTSIZ0</name>
          <description>The application must modify this register before enabling endpoint 0. Once endpoint 0 is enabled using Endpoint Enable bit of the Device Control Endpoint 0 Control registers (DIEPCTL0.EPEna/DOEPCTL0.EPEna), the core modifies this register. The application can only read this register once the core has cleared the Endpoint Enable bit. Nonzero endpoints use the registers for endpoints 115. When Scatter/Gather DMA mode is enabled, this register must not be programmed by the application. If the application reads this register when Scatter/Gather DMA mode is enabled, the core returns all zeros.</description>
          <addressOffset>0x910</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERSIZE</name>
              <description>Transfer Size (XferSize)

This field contains the transfer size in bytes for the current endpoint. The transfer size (XferSize) = Sum of buffer sizes across all descriptors in the list for the endpoint.
In Buffer DMA, the core only interrupts the application after it has exhausted the transfer size amount of data. The transfer size can be set to the maximum packet size of the endpoint, to be interrupted at the end of each packet.
 - IN Endpoints: The core decrements this field every time a packet from the external memory is written to the TxFIFO.
 - OUT Endpoints: The core decrements this field every time a packet is read from the RxFIFO and written to the external memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet Count (PktCnt)

Indicates the total number of USB packets that constitute the

