esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
The application sets this bit to stop transmitting/receiving data on an endpoint, even
before the transfer for that endpoint is complete. The application must wait for the
Endpoint Disabled interrupt before treating the endpoint as disabled. The core clears
this bit before setting the Endpoint Disabled interrupt. The application must set this bit
only if Endpoint Enable is already set for this endpoint.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint Enable (EPEna)

Applies to IN and OUT endpoints.
 - When Scatter/Gather DMA mode is enabled,
 -- For IN endpoints this bit indicates that the descriptor structure and data buffer with data ready to transmit is setup.
 -- For OUT endpoint it indicates that the descriptor structure and data buffer to receive data is setup.
 - When Scatter/Gather DMA mode is enabled such as for buffer-pointer based DMA mode:
 -- For IN endpoints, this bit indicates that data is ready to be transmitted on the endpoint.
 -- For OUT endpoints, this bit indicates that the application has allocated the memory to start receiving data from the USB.
 - The core clears this bit before setting any of the following interrupts on this endpoint:
 -- SETUP Phase Done
 -- Endpoint Disabled
 -- Transfer Completed
Note: For control endpoints in DMA mode, this bit must be set to be able to transfer SETUP data packets in memory.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT2</name>
          <description>This register contains the interrupts for the IN Endpoint 2 of the Device controller.  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x948</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>XFERCOMPL</name>
              <description>Transfer Completed Interrupt (XferCompl)

Applies to IN and OUT endpoints.
 - When Scatter/Gather DMA mode is enabled
 -- For IN endpoint this field indicates that the requested data from the descriptor is moved from external system memory to internal FIFO.
 -- For OUT endpoint this field indicates that the requested data from the internal FIFO is moved to external system memory. This interrupt is generated only when the corresponding endpoint descriptor is closed, and the IOC bit for the corresponding descriptor is set.
 - When Scatter/Gather DMA mode is disabled, this field indicates that the programmed transfer is complete on the AHB as well as on the USB, for this endpoint.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLD</name>
              <description>Endpoint Disabled Interrupt (EPDisbld)

Applies to IN and OUT endpoints.

This bit indicates that the endpoint is disabled per the application's request.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERR</name>
              <description>AHB Error (AHBErr)

Applies to IN and OUT endpoints.

This is generated only in Internal DMA mode when there is an AHB error during an AHB read/write. The application can read the corresponding endpoint DMA address register to get the error address. For details, see AHB Error Handling in the Programming Guide.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout Condition (TimeOUT)
 - In shared TX FIFO mode, applies to non-isochronous IN endpoints only.
 - In dedicated FIFO mode, applies only to Control IN endpoints.
 - In Scatter/Gather DMA mode, the TimeOUT interrupt is not asserted.
Indicates that the core has detected a timeout condition on the USB for the last IN token on this endpoint.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMP</name>
              <description>IN Token Received When TxFIFO is Empty (INTknTXFEmp)

Applies to non-periodic IN endpoints only.

Indicates that an IN token was received when the associated TxFIFO (periodic/non-periodic) was empty. This interrupt is asserted on the endpoint for which the IN token was received.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNEPMIS</name>
              <description>IN Token Received with EP Mismatch (INTknEPMis)

Applies to non-periodic IN endpoints only.

Indicates that the data in the top of the non-periodic TxFIFO belongs to an endpoint other than the one for which the IN token was received. This interrupt is asserted on the endpoint for which the IN token was received.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNAKEFF</name>
              <description>IN Endpoint NAK Effective (INEPNakEff)

Applies to periodic IN endpoints only.

This bit can be cleared when the application clears the IN endpoint NAK by writing to DIEPCTLn.CNAK.

This interrupt indicates that the core has sampled the NAK bit

Set (either by the application or by the core). The interrupt indicates that the IN endpoint NAK bit Set by the application has taken effect in the core.

This interrupt does not guarantee that a NAK handshake is sent on the USB. A STALL bit takes priority over a NAK bit.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFEMP</name>
              <description>Transmit FIFO Empty (TxFEmp)

This bit is valid only for IN endpoints

This interrupt is asserted when the TxFIFO for this endpoint is
either half or completely empty. The half or completely empty
status is determined by the TxFIFO Empty Level bit in the Core
AHB Configuration register (GAHBCFG.NPTxFEmpLvl)).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFIFOUNDRN</name>
              <description>Fifo Underrun (TxfifoUndrn)

