esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
Indicates the total number of USB packets that constitute the Transfer Size amount of data for endpoint 0.

This field is decremented every time a packet (maximum size or short packet) is read from the TxFIFO.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MC</name>
              <description>MC

Applies to IN endpoints only.

For periodic IN endpoints, this field indicates the number of packets that must be transmitted per microframe on the USB. The core uses this field to calculate the data PID for isochronous IN endpoints.
 - 2'b01: 1 packet
 - 2'b10: 2 packets
 - 2'b11: 3 packets
For non-periodic IN endpoints, this field is valid only in Internal DMA mode. It specifies the number of packets the core must fetchfor an IN endpoint before it switches to the endpoint pointed to by the Next Endpoint field of the Device Endpoint-n Control register (DIEPCTLn.NextEp)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPDMA7</name>
          <description>This register contains the DMA Address for the IN Endpoint 7 of the Device controller.  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x9f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>Holds the start address of the external memory for storing or fetching endpoint
data.

Note: For control endpoints, this field stores control OUT data packets as well as
SETUP transaction data packets. When more than three SETUP packets are
received back-to-back, the SETUP data packet in the memory is overwritten.

This register is incremented on every AHB transaction. The application can give
only a DWORD-aligned address.
 - When Scatter/Gather DMA mode is not enabled, the application programs the start address value in this field.
 - When Scatter/Gather DMA mode is enabled, this field indicates the base pointer for the descriptor list.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS7</name>
          <description>This register reflects the status of the IN Endpoint Transmit FIFO Status Register 7 of the Device controller.  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x9f8</addressOffset>
          <size>32</size>
          <resetValue>0x400</resetValue>
          <fields>
            <field>
              <name>INEPTXFSPCAVAIL</name>
              <description>IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail)

Indicates the amount of free space available in the Endpoint TxFIFO.

Values are in terms of 32-bit words.
 - 16'h0: Endpoint TxFIFO is full
 - 16'h1: 1 word available
 - 16'h2: 2 words available
 - 16'hn: n words available (where 0  n  32,768)
 - 16'h8000: 32,768 words available
 - Others: Reserved
In DRD configurations (OTG_MODE = 0, 1, or 2) with dynamic fifo sizing feature enabled (OTG_DFIFO_DYNAMIC=1), the value of this field is,
 - the maximum value of (OTG_TX_HNPERIO_DFIFO_DEPTH, OTG_TX_DINEP_DFIFO_DEPTH_0) during reset, and
 - OTG_TX_DINEP_DFIFO_DEPTH_0, immediately after reset deassertion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPDMAB7</name>
          <description>This register contains the DMA Buffer Address of the IN Endpoint 7 of the Device controller.  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x9fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMABUFFERADDR</name>
              <description>Holds the current buffer address.This register is updated as and when the data
transfer for the corresponding end point is in progress.

This register is present only in Scatter/Gather DMA mode. Otherwise this field is
reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL8</name>
          <description>This register is used to control the characteristics of Endpoint 8.  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0xa00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MPS</name>
              <description>Maximum Packet Size (MPS)

The application must program this field with the maximum packet size for the current logical endpoint. This value is in bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBACTEP</name>
              <description>USB Active Endpoint (USBActEP)

Indicates whether this endpoint is active in the current configuration and interface. The
core clears this bit for all endpoints (other than EP 0) after detecting a USB reset. After
receiving the SetConfiguration and SetInterface commands, the application must
program endpoint registers accordingly and set this bit.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPID</name>
              <description>Endpoint Data PID (DPID)

Applies to interrupt/bulk IN and OUT endpoints only.

