esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
A write to this bit clears the NAK bit for the endpoint.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNAK</name>
              <description>Set NAK (SNAK)

A write to this bit sets the NAK bit for the endpoint.

Using this bit, the application can control the transmission of NAK handshakes on an endpoint. The core can also Set this bit for an endpoint after a SETUP packet is received on that endpoint.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETD0PID</name>
              <description>Set DATA0 PID (SetD0PID)
 - Applies to interrupt/bulk IN endpoints only.
 - Writing to this field sets the Endpoint Data PID (DPID) field in this register to DATA0.
 - This field is applicable both for Scatter/Gather DMA mode and non-Scatter/Gather DMA mode.
Reset: 1'b0

In non-Scatter/Gather DMA mode: Set Even (micro)frame (SetEvenFr)
 - Applies to isochronous IN endpoints only.
 - Writing to this field sets the Even/Odd (micro)frame (EO_FrNum) field to even (micro)frame.
 - When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number in which to send data is in the transmit descriptor structure. The frame in which to receive data is updated in receive descriptor structure.
Reset: 1'b0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETD1PID</name>
              <description>Set DATA1 PID (SetD1PID)
 - Applies to interrupt and bulk IN endpoints only.
 - Writing to this field sets the Endpoint Data PID (DPID) field in this register to DATA1.
 - This field is applicable both for scatter-gather DMA mode and non scatter-gather DMA mode.
Reset: 1'b0

Set Odd (micro)frame (SetOddFr)
 - Applies to isochronous IN endpoints only.
 - Writing to this field sets the even and odd (micro)frame (EO_FrNum) field to odd (micro)frame.
Reset: 1'b0</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDIS</name>
              <description>Endpoint Disable (EPDis)

Applies to IN and OUT endpoints.

The application sets this bit to stop transmitting/receiving data on an endpoint, even
before the transfer for that endpoint is complete. The application must wait for the
Endpoint Disabled interrupt before treating the endpoint as disabled. The core clears
this bit before setting the Endpoint Disabled interrupt. The application must set this bit
only if Endpoint Enable is already set for this endpoint.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint Enable (EPEna)

Applies to IN and OUT endpoints.
 - When Scatter/Gather DMA mode is enabled,
 -- For IN endpoints this bit indicates that the descriptor structure and data buffer with data ready to transmit is setup.
 -- For OUT endpoint it indicates that the descriptor structure and data buffer to receive data is setup.
 - When Scatter/Gather DMA mode is enabled such as for buffer-pointer based DMA mode:
 -- For IN endpoints, this bit indicates that data is ready to be transmitted on the endpoint.
 -- For OUT endpoints, this bit indicates that the application has allocated the memory to start receiving data from the USB.
 - The core clears this bit before setting any of the following interrupts on this endpoint:
 -- SETUP Phase Done
 -- Endpoint Disabled
 -- Transfer Completed
Note: For control endpoints in DMA mode, this bit must be set to be able to transfer SETUP data packets in memory.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT9</name>
          <description>This register contains the interrupts for the IN Endpoint 9 of the Device controller.  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0xa28</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>XFERCOMPL</name>
              <description>Transfer Completed Interrupt (XferCompl)

Applies to IN and OUT endpoints.
 - When Scatter/Gather DMA mode is enabled
 -- For IN endpoint this field indicates that the requested data from the descriptor is moved from external system memory to internal FIFO.
 -- For OUT endpoint this field indicates that the requested data from the internal FIFO is moved to external system memory. This interrupt is generated only when the corresponding endpoint descriptor is closed, and the IOC bit for the corresponding descriptor is set.
 - When Scatter/Gather DMA mode is disabled, this field indicates that the programmed transfer is complete on the AHB as well as on the USB, for this endpoint.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLD</name>
              <description>Endpoint Disabled Interrupt (EPDisbld)

Applies to IN and OUT endpoints.

This bit indicates that the endpoint is disabled per the application's request.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERR</name>
              <description>AHB Error (AHBErr)

Applies to IN and OUT endpoints.

This is generated only in Internal DMA mode when there is an AHB error during an AHB read/write. The application can read the corresponding endpoint DMA address register to get the error address. For details, see AHB Error Handling in the Programming Guide.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout Condition (TimeOUT)
 - In shared TX FIFO mode, applies to non-isochronous IN endpoints only.
 - In dedicated FIFO mode, applies only to Control IN endpoints.
 - In Scatter/Gather DMA mode, the TimeOUT interrupt is not asserted.
Indicates that the core has detected a timeout condition on the USB for the last IN token on this endpoint.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMP</name>
              <description>IN Token Received When TxFIFO is Empty (INTknTXFEmp)

