esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
A write to this bit clears the NAK bit for the endpoint.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNAK</name>
              <description>Set NAK (SNAK)

A write to this bit sets the NAK bit for the endpoint.
Using this bit, the application can control the transmission of NAK handshakes on an endpoint.
The core can also set bit on a Transfer Completed interrupt, or after a SETUP is received on the endpoint.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDIS</name>
              <description>Endpoint Disable (EPDis)

The application cannot disable control OUT endpoint 0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint Enable (EPEna)
 - When Scatter/Gather DMA mode is enabled, for OUT endpoints this bit indicates that the descriptor structure and data buffer to receive data is setup.
 - When Scatter/Gather DMA mode is disabled (such as for buffer-pointer based DMA mode)this bit indicates that the application has allocated the memory to start receiving data from the USB.
 - The core clears this bit before setting any of the following interrupts on this endpoint:
 -- SETUP Phase Done
 -- Endpoint Disabled
 -- Transfer Completed
Note: In DMA mode, this bit must be set for the core to transfer SETUP data packets into memory and it is not cleared on Transfer Completed interrupt of SETUP packet.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPINT0</name>
          <description>This register contains the interrupts for the OUT Endpoint 0 of the Device controller.</description>
          <addressOffset>0xb08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPL</name>
              <description>Transfer Completed Interrupt (XferCompl)

Applies to IN and OUT endpoints.

When Scatter/Gather DMA mode is enabled
 - For IN endpoint this field indicates that the requested data from the descriptor is moved from external system memory to internal FIFO.
 - For OUT endpoint this field indicates that the requested data from the internal FIFO is moved to external system memory. This interrupt is generated only when the corresponding endpoint descriptor is closed, and the IOC bit for the corresponding descriptor is Set.
Note: In DMA mode, this bit must be set for the core to transfer SETUP data packets into memory. When Scatter/Gather DMA mode is disabled, this field indicates that the programmed transfer is complete on the AHB as well as on the USB, for this endpoint.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLD</name>
              <description>Endpoint Disabled Interrupt (EPDisbld)

Applies to IN and OUT endpoints.

This bit indicates that the endpoint is disabled per the application's request.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERR</name>
              <description>AHB Error (AHBErr)

Applies to IN and OUT endpoints.

This is generated only in Internal DMA mode when there is an AHB error during an AHB read/write. The application can read the corresponding endpoint DMA address register to get the error address. For details, see AHB Error Handling section in the Programming Guide.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP Phase Done (SetUp)

Applies to control OUT endpoints only.

Indicates that the SETUP phase for the control endpoint is
complete and no more back-to-back SETUP packets were
received for the current control transfer. On this interrupt, the
application can decode the received SETUP data packet.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTTKNEPDIS</name>
              <description>OUT Token Received When Endpoint Disabled (OUTTknEPdis)

Applies only to control OUT endpoints.

Indicates that an OUT token was received when the endpoint
was not yet enabled. This interrupt is asserted on the endpoint for which the OUT token was received.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STSPHSERCVD</name>
              <description>Status Phase Received for Control Write (StsPhseRcvd)

This interrupt is valid only for Control OUT endpoints.

This interrupt is generated only after the core has transferred all
the data that the host has sent during the data phase of a control
write transfer, to the system memory buffer.

The interrupt indicates to the application that the host has
switched from data phase to the status phase of a Control Write
transfer. The application can use this interrupt to ACK or STALL
the Status phase, after it has decoded the data phase.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACK2BACKSETUP</name>
              <description>Back-to-Back SETUP Packets Received (Back2BackSETup)

Applies to Control OUT endpoints only.

