esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
The application sets this bit to stop transmitting/receiving data on an endpoint, even
before the transfer for that endpoint is complete. The application must wait for the
Endpoint Disabled interrupt before treating the endpoint as disabled. The core clears
this bit before setting the Endpoint Disabled interrupt. The application must set this bit
only if Endpoint Enable is already set for this endpoint.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint Enable (EPEna)

Applies to IN and OUT endpoints.

When Scatter/Gather DMA mode is enabled,
 - For IN endpoints this bit indicates that the descriptor structure and data buffer with data ready to transmit is setup.
 - For OUT endpoint it indicates that the descriptor structure and data buffer to receive data is setup.
When Scatter/Gather DMA mode is enabled such as for buffer-pointer based DMA mode:
 - For IN endpoints, this bit indicates that data is ready to be transmitted on the endpoint.
 - For OUT endpoints, this bit indicates that the application has allocated the memory to start receiving data from the USB.
The core clears this bit before setting any of the following interrupts on this endpoint:
 - SETUP Phase Done
 - Endpoint Disabled
 - Transfer Completed
Note: For control endpoints in DMA mode, this bit must be set for the controller to transfer SETUP data packets to the memory. This bit is not cleared on Transfer Completed interrupt of the SETUP packet.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPINT4</name>
          <description>This register contains the interrupts for the OUT Endpoint 4 of the Device controller.</description>
          <addressOffset>0xb88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XFERCOMPL</name>
              <description>Transfer Completed Interrupt (XferCompl)

Applies to IN and OUT endpoints.
 - When Scatter/Gather DMA mode is enabled
 -- For IN endpoint this field indicates that the requested data from the descriptor is moved from external system memory to internal FIFO.
 -- For OUT endpoint this field indicates that the requested data from the internal FIFO is moved to external system memory. This interrupt is generated only when the corresponding endpoint descriptor is closed, and the IOC bit for the corresponding descriptor is Set.
 - When Scatter/Gather DMA mode is disabled, this field indicates that the programmed transfer is complete on the AHB as well as on the USB, for this endpoint.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLD</name>
              <description>Endpoint Disabled Interrupt (EPDisbld)

Applies to IN and OUT endpoints.

This bit indicates that the endpoint is disabled per the application's request.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERR</name>
              <description>AHB Error (AHBErr)

Applies to IN and OUT endpoints.

This is generated only in Internal DMA mode when there is an AHB error during an AHB read/write. The application can read the corresponding endpoint DMA address register to get the error address. For details, see AHB Error Handling section in the Programming Guide.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP Phase Done (SetUp)

Applies to control OUT endpoints only.

Indicates that the SETUP phase for the control endpoint is
complete and no more back-to-back SETUP packets were
received for the current control transfer. On this interrupt, the
application can decode the received SETUP data packet.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTTKNEPDIS</name>
              <description>OUT Token Received When Endpoint Disabled (OUTTknEPdis)

Applies only to control OUT endpoints.

Indicates that an OUT token was received when the endpoint was not yet enabled. This interrupt is asserted on the endpoint for which the OUT token was received.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STSPHSERCVD</name>
              <description>Status Phase Received for Control Write (StsPhseRcvd)

This interrupt is valid only for Control OUT endpoints.

This interrupt is generated only after the core has transferred all
the data that the host has sent during the data phase of a control
write transfer, to the system memory buffer.

The interrupt indicates to the application that the host has
switched from data phase to the status phase of a Control Write
transfer. The application can use this interrupt to ACK or STALL
the Status phase, after it has decoded the data phase.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACK2BACKSETUP</name>
              <description>Back-to-Back SETUP Packets Received (Back2BackSETup)

Applies to Control OUT endpoints only.

This bit indicates that the core has received more than three
back-to-back SETUP packets for this particular endpoint. For
information about handling this interrupt,</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPKTERR</name>
              <description>OUT Packet Error (OutPktErr)

