esp-rs/esp-pacs/esp32s31/svd/esp32s31.base.svd
In partial power-down mode of operation, this bit needs to be set in host mode before
clamp is removed if the host needs to issue reset after suspend. If this bit is not set,
then the host issues resume after suspend.

This bit is not applicable in device mode and non-partial power-down mode.
In Hibernation mode, this bit needs to be set at RESTORE_POINT before
PCGCCTL.EssRegRestored is set. In this case, PCGCCTL.restore_mode needs to
be set to wait_restore.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GSTARFXDIS</name>
          <description>This register is used to disable STAR fixes added in the controller. The application can set the register fields to operate with the functionality before the fix was done.</description>
          <addressOffset>0xf00</addressOffset>
          <size>32</size>
          <resetValue>0x2200</resetValue>
          <fields>
            <field>
              <name>HOST_IGNORES_RMTWKUP_DIS</name>
              <description>Disable the STAR fix added for Device controller to go back to low power mode when Host ignores Remote wakeup
 The application programs Host_Ignores_RmtWkup_dis=1 to disable the device controller from going back to low power mode (SUSPENDED state) when the host ignores the remote wakeup signalling from the device and does not respond back with resume. This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESUME_FRM_CHK_BUS_DIS</name>
              <description>Disable the STAR fix added for Device controller to detect lineK and move to RESUMING state after the 50us pull-up delay ends
 The application programs Resume_frm_CHK_BUS_dis=1 to disable the device controller from detecting line K and transitioning to RESUMING state in the scenario where Host resume starts immediately after the 50us pull-up delay timer expires. This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNORE_CTLOUT_DATA0_DIS</name>
              <description>Disable the STAR fix added for Device controller to reject DATA0 for the first Control OUT Data Phase and Control Status OUT Phase
 The application programs Ignore_CtlOUT_DATA0_dis=1 to disable the device controller from reporting transaction error when DATA0 PID is received from host for the first Control OUT Data Phase and Control Status OUT phase. This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSPLIT_STALLNYET_ERR_DIS</name>
              <description>Disable the STAR fix added for Host controller to flag error for SSPLIT STALL/NYET
 The application programs SSPLIT_STALLNYET_Err_dis=1 to disable the host controller from reporting transaction error for STALL/NYET received from device for SSPLIT transfer. This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCEPT_ISOC_SPLIT_DATA1_DIS</name>
              <description>Disable the STAR fix added for Host controller to accept DATA1 PID from device for ISOC Split transfers
 The application programs Accept_Isoc_split_DATA1_dis=1 to disable the host controller from accepting DATA1 PID from device for ISOC Split transfers. This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HANDLEFAULTYCABLE_DIS</name>
              <description>Disable the STAR fix added for Host controller to handle Faulty cable scenarios
 The application programs HandleFaultyCable_dis=1 to disable the host controller from reporting Port Babble error when the linestate is stuck at 1 (in FS mode) or 2 (in LS mode) due to a Faulty cable. This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LS_IPG_INCR_DIS</name>
              <description>Disable the STAR fix added for Host controller LS mode IPG increment from 2 LS bit times to 3 LS bit times
 The application programs LS_IPG_incr_dis=1 to disable the IPG increment from 2 to 3 LS bit times when host controller is operating in LS mode. This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSDISC_IDLE_DIS</name>
              <description>Disable the STAR fix added for Device controller to transition to IDLE state during FS device disconnect
 The application programs FSDisc_Idle_dis=1 to disable the Transmit/Receive state machine from moving to IDLE state when FS device disconnect happens. This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONCURRENT_RMTWKUP_USBRESUME_DIS</name>
              <description>Disable the STAR fix added for Device controller to not start Remote Wakeup signalling when USB resume has already started
 The application programs Concurrent_Rmtwkup_USBResume_dis=1 to allow the controller to do remote wakeup signalling when USB resume has already started from the Host. This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONCURRENT_RMTWKUP_USBRESUME_HIB_DIS</name>
              <description>Disable the STAR fix added for Device controller to not hang when Remote Wakeup signalling clashes with Host resume
 The application can program Concurrent_Rmtwkup_USBResume_Hib_dis=1 to disable the fix.
 Note: With Concurrent_Rmtwkup_USBResume_Hib_dis=0, the STAR fix is enabled and the device controller does not hang when the remote wakeup clashes with host resume. After the remote wakeup programming is done, if there was no utmi_txready received from the PHY while the utmi_txvalid was asserted, then the controller detects the line K as the host resume and directly moves to the RESUMING state, along with de-asserting utmi_txvalid. This prevents the controller from hanging but also violates the UTMI spec requirement which states that utmi_txvalid must be de-asserted only after getting utmi_txready. Hence, if any misbehaviour is observed with this fix enabled, it is recommended to keep the fix disabled.
 This bit must be programmed during the initial configuration of the controller and must not be modified later. The fix is applicable only for Hibernation case.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LS_IPG_CHK_AFTER_NAK_STALL_FOR_IN_DIS</name>
              <description>Disable the STAR fix added for Host controller to wait for IPG duration to send next token after receiving NAK/STALL for previous IN token with FS/LS device
 The application programs LS_IPG_chk_after_NAK_STALL_for_IN_dis=1 to allow the controller to send the next token without waiting for the interpacket gap duration after receiving a NAK/STALL from device for the previous IN token. This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_IOP_XCVRSEL_TXVLD_CORR_DIS</name>
              <description>Disable the STAR fix added for Host controller to increase the gap between utmi_xcvrselect switching and utmi_txvalid assertion in LS/FS mode
 The application programs PHY_IOp_xcvrsel_txvld_corr_dis=1 to allow the controller to assert utmi_txvalid 1 cycle after the utmi_xcvrselect switching. This can cause interop issues with SNPS PHY which requires at least 2 cycles of gap between the utmi_xcvrselect switch and the utmi_txvalid assertion. Hence it is recommended to program PHY_IOp_xcvrsel_txvld_corr_dis=0.
This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULPI_XCVRSEL_SWITCH_CORR_DIS</name>
              <description>Disable the STAR fix added for Host controller to increase the preamble transceiver select switch delay to accommodate time taken for ULPI function control write
 The application programs ULPI_xcvrsel_switch_corr_dis=1 to allow the controller to do back to back transceiver select switching within the duration required for a single ULPI function control write (around 5-6 ulpi_clk cycles). This can cause a corrupted packet to go on the bus since the ULPI wrapper may not be able to do the second ULPI functional update (register write) correctly. Hence it is recommended to program ULPI_xcvrsel_switch_corr_dis=0.
With ULPI_xcvrsel_switch_corr_dis=0, the delay between transceiver select switch and txvalid assertion has also been increased for FS/LS mode to resolve PHY interop issues.
This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XACTERR_DATA0_CTRL_STS_IN_DIS</name>
              <description>Disable the STAR fix added for Host controller to report transaction error when DATA0 PID is received for CTRL STATUS IN transfer in DMA mode
 The application programs XactErr_DATA0_CTRL_STS_IN_dis=1 to allow the controller to respond with ACK for the incorrect DATA0 PID and then retry the control STATUS IN transfer until DATA1 PID is received. With XactErr_DATA0_CTRL_STS_IN_dis=0, the controller generates Transaction Error interrupt when the incorrect PID is received. This STAR fix is applicable only for Buffer DMA and Descriptor DMA modes.
This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_XCVRSEL_RESETAFTRSUSP_CORR_DIS</name>
              <description>Disable the STAR fix added for correcting XcvrSel on UTMI Interface in host mode.
When host controller drives reset in power down suspend state, the behavior of XcvrSel has been corrected to drive the valid combination of XcvrSel (HS_XCVR) and TermSel (HS_TERM) on the UTMI interface.
The application can set this register bit to 1'b1 to fall back to the original behavior of the Host controller driving XcvrSel (FS_XCVR) and TermSel (HS_TERM) when reset is driven to exit from power down state.
This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_UTMI_TXVLD_CORR_DIS</name>
              <description>Disable the correction to OpMode/XcvrSel/TermSel on UTMI Interface in Host mode.
When HPRT.PrtRst is set by the application, the Host controller can change the Opmode, XcvrSel and TermSel while TxValid is still high (1'b1) during SOF transmission in 8-bit UTMI mode. This behavior of the controller has been corrected to handle port reset during SOF transmission. With the fix, the controller waits for Txvalid to go low (1'b0) and then changes the OpMode, XcvrSel and TermSel.
The application can set this register bit to 1'b1 to fall back to the original behavior of the controller.
This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPMODE_XCVRSEL_CHIRPEN_CORR_DIS</name>
              <description>Disable the STAR fix added for correcting Opmode and XcvrSel on UTMI Interface when reset is detected in suspend state.
 In configurations with Battery charger support enabled (and GOTGCTL.ChirpEn programmed to 1), the RTL has been updated to wait for 1ms and then change the opmode and xcvrselect when reset is detected in the suspend state.
The application can set this register bit to 1'b1 to fall back to the original behavior of the controller and change Opmode and XcvrSel without waiting for 1ms after reset detection.
This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXVALID_DEASSERTION_CORR_DIS</name>
              <description>Disable the STAR fix added for correcting Txvalid deassertion on UTMI Interface when soft disconnect is done.
 The RTL has been updated to wait for utmi_txready and then de-assert the utmi_txvalid being driven by MAC DSSR when soft disconnect is done.
The application can set this register bit to 1'b1 to fall back to the original behavior of the controller and change Txvalid without waiting for Txready.
This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_NO_XFER_AFTER_PRTDIS_FIX_DIS</name>
              <description>Disable the STAR fix added for correcting Host behavior when port is disabled.
 The RTL has been updated to not assert utmi_txvalid when the port is disabled.
The application can set this register bit to 1'b1 to fall back to the original behavior of the controller.
This bit must be programmed during the initial configuration of the controller and must not be modified later.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
